Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/install.po
Languages: es

source: This screen can be used to configure full-disk encryption which is meant to protect the data on the disks should the system itself be lost or stolen. This type of encryption prevents the data on the disks from being available during bootup, unless the correct passphrase is typed at the bootup screen. Once the passphrase is accepted, the data is unencrypted and can easily be read from disk.
es: Esta pantalla puede usarse para configurar la encriptación completa del disco la cual tiene el objetivo de proteger los datos en los discos que el mismo sistema llegue a perder o sean robados. Este tipo de encriptación previene que los datos en los discos estén disponibles durante el arranque, a menos que la contraseña correcta sea escrita en la pantalla de arranque. Una vez que la contraseña sea aceptada, los datos son desencriptados y se pueden leer fácilmente desde el disco.

source: To configure full disk encryption, check the box "Encrypt disk with GELI". This option will be greyed out if "GPT (Best for new hardware)" is not selected as GELI does not support MBR partitioning at this time. If needed, use the "Back" button to go back to the :ref:`Advanced Mode` screen and select the option "GPT (Best for new hardware)". Once the "Encrypt disk with GELI" box is checked, input a good passphrase twice into the "Password" fields. This password should be long and something that you will not forget, but hard for other users, especially those who know you, to guess.
es: Para configurar la encriptación completa del disco, seleccione la casilla "Encriptar el disco con GELI". Esta opción estará en gris si "GPT (Mejor para hardware nuevo)" no está seleccionada ya que GELI no soporta particionamiento MBR en este momento. Si se necesita, use el botón "Atrás" para retroceder a la pantalla :ref:`Modo Avanzado` y seleccione la opción "GPT (Mejor para hardware nuevo)". Una vez que la casilla "Encriptar el disco con GELI" sea seleccionada, ingrese una buena contraseña dos veces en los campos "Contraseña". Esta contraseña debe ser larga y algo que no se le olvide, pero difícil de adivinar para otros usuarios, especialmente aquellos que le conocen.

source: if you ever forget this passphrase, you will be unable to decrypt the disks and will lose access to their data!
es: Si usted olvida esta contraseña, usted no será capaz de desencriptar los discos y perderá el acceso a sus datos!

source: When finished, click "Next" to move on the screen shown in :numref:`Figure %s: Default ZFS Layout <install12a>`.
es: Cuando termine, presione "Siguiente" para pasar a la pantalla mostrada en la :numref:`Figura %s: Diseño ZFS Predeterminado <install12a>`.

source: Regardless of how many disks you selected for your ZFS configuration, the default layout will be the same. ZFS does not require separate partitions for :file:`/usr`, :file:`/tmp`, or :file:`/var`. Instead, you create one ZFS partition (pool) and specify a mount for each dataset. A :file:`/boot` partition is not mandatory with ZFS as the PC-BSD® installer puts a 64k partition at the beginning of the drive.
es: Independientemente de cuántos discos seleccione para su configuración ZFS, el diseño predeterminado siempre será el mismo. ZFS no requiere de particiones separadas para :file:`/usr`, :file:`/tmp`, o :file:`/var`. En vez de eso, usted crea una patición ZFS (pool) y especifica un punto de montaje para cada dataset. Una partición :file:`/boot` no es obligatoria con ZFS ya que el instalador de PC-BSD® crea una partición de 64k en el principio del disco.

source: **do not remove any of the default mount points** as they are used by PC-BSD®.
es: **No elimine nunguno de los puntos de montaje predeterminados** ya que los mismos son usados por PC-BSD®.

source: You can use the "Add" button to add additional mount points. You will only be prompted for the name of the mount point as size is not limited at creation time. Instead, the data on any mount point can continue to grow as long as space remains within the ZFS pool.
es: Puede usar el botón "Añadir" para añadir puntos de montaje adicionales. Solo se le preguntará por el nombre del punto de montaje ya que el tamaño no se establece al momento de la creación. En vez de eso, los datos en cualquier punto de montaje pueden continuar creciendo tanto como espacio disponible quede en el pool ZFS.

source: If you wish to set the swap size, click the "Swap Size" button. This will prompt you to enter a size in MB. If you have created a RAIDZ or mirror, a swap partition of the specified size will be created on each disk and mirrored between the drives. For example, if you specify a 2048MB swap size, a 2GB swap partition will be created on all of the specified disks, yet the total swap size will be 2GB, due to redundancy.
es: Si quiere establecer el tamaño de la swap, presione el botón "Tamaño de Swap". Esto le preguntará por un tamaño en MB. Si ha creado un RAIDZ o un mirror, una partición swap del tamaño especificado será creada en cada disco y reflejada entre los discos. Por ejemplo, si especifica un tamaño de swap de 2048 MB, una partición swap de 2 GB será creada en todos los discos especificados, sin embargo, el tamaño total de la swap será de 2 GB, debido a la redundancia.

source: If you right-click any mount point, you can toggle between enabling or disabling any of the following ZFS properties.
es: Si presiona el botón derecho sobre cualquier punto de montaje, puede cambiar entre habilitar y deshabilitar cualquiera de las siguientes propiedades para ZFS.

source: **atime:** when set to "on", controls whether the access time for files is updated when they are read. When set to "off", this property avoids producing write traffic when reading files and can result in significant performance gains, though it might confuse mailers and some other utilities.
es: **atime:** Cuando se pone en "Activado", controla si la hora de acceso para los archivos se actualiza cuando son leídos. Cuando se pone en "Desactivado", esta propiedad evita producir tráfico de escritura cuando se leen los archivos y puede resultar en ganancias significativas en el rendimiento, aunque puede confundir a las aplicaciones de correo y a algunas otras utilerías.

source: **canmount:** if set to "off", the filesystem can not be mounted.
es: **canmount:** Si está en "Apagado", el sistema de archivos no se puede montar.

source: **checksum:** automatically verifies the integrity of the data stored on disks. **Setting this property to "off" is highly discouraged.**
es: **checksum:** Automáticamente verifica la integridad de los datos guardados en los discos. **Deshabilitar esta propiedad no se recomienda.**

source: **compression:** if set to "on", automatically compresses stored data to conserve disk space.
es: **compression:** Si se pone en "Activado", automáticamente comprime los datos guardados para conservar espacio en disco.

source: **exec:** if set to "off", processes can not be executed from within this filesystem.
es: **exec:** Si se pone en "Desactivado", los procesos no se pueden ejecutar desde este sistema de archivos.

source: **setuid:** if set to "on", the set-UID bit is respected.
es: **setuid:** Si se pone en "Activado", el bit set-UID es respetado.

source: Once you click "Next", the wizard will show a summary of your selections. If you wish to change anything, use the “Back” button to return to a previous screen. Otherwise, click "Finish" to leave the wizard and return to the "Disk Selection" screen.
es: Una vez que presione "Siguiente", el asistente le mostará un resumen de sus selecciones. Si quiere cambiar cualquier cosa, use el botón "Atrás" para regresar a una pantalla previa. De otra manera, presione "Terminar" para dejar el asistente y regresar a la pantalla de "Selección de Disco".

source: FreeBSD Expert Mode
es: Modo Experto FreeBSD

source: If you select FreeBSD expert mode, you will be prompted to launch a terminal where you can use command line utilities such as :command:`bsdinstall` to manually configure the partitions. When you are finished, type :command:`exit` to leave the terminal, then click "Next" to review the disk summary. If you wish to change anything, use the "Back" button to return to a previous screen. Otherwise, click "Finish" to leave the wizard and return to the "Disk Selection" screen.
es: Si seleccionó el modo experto FreeBSD, se le preguntará si lanza una terminal donde pueda usar utilerías en línea de comando como :command:`bsdinstall` para configurar manualmente las particiones. Cuando termine, escriba :command:`exit` para dejar la terminal, después presione "Siguiente" para revisar el resumen del disco. Si quiere cambiar algo, use el botón "Atrás" para regresar a una pantalla previa. De otra manera, presione "Terminar" para dejar el asistente y regresar a la pantalla de "Selección de Disco".

source: Installation Progress Screen
es: Pantalla de Progreso de la Instalación

source: Once you select "Yes" to start the installation, a progress screen, seen in :numref:`Figure %s: nstallation Progress Screen <install13a>`, provides a progress bar and messages so that you can watch the installation's progress.
es: Una vez que seleccione "Si" para comenzar la instalacion, una pantalla de progreso, mostrada en la :numref:`Figura %s: Pantalla de Progreso de la Instalación <install13a>`, le mostrará una barra de progreso y mensajes para que pueda seguir el proceso de instalación.

source: How long the installation takes depends upon the speed of your hardware, the installation type you selected, and the number of components to be installed. A typical installation takes between 15 and 30 minutes.
es: La duración de la instalación dependerá de la velocidad de su hardware, el tipo de instalación que seleccionó, y el número de componentes para instalar. Una instalación típica toma entre 15 y 30 minutos.

source: Installation Finished Screen
es: Pantalla de Finalización de la Instalación

source: The screen shown in :numref:`Figure %s: PC-BSD® Installation is Now Complete <install14a>` appears once the installation is complete.
es: La pantalla mostrada en la :numref:`Figura %s: La Instalación de PC-BSD® Está Completa <install14a>` aparece una vez que la instalación se ha completado.

source: Click the "Finish" button to reboot into your PC-BSD® installation. Wait until the installer exits before removing the installation media.
es: Presione el botón "Terminar" para reiniciar dentro de su instalación de PC-BSD®. Espere hasta que el instalador salga antes de extraer el medio de instalación.
