Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/install.po
Languages: es

source: Once you have selected the disk and partition, click "Next" to return to the disk "Summary" screen so that you can review your selections. If you wish to change anything, use the "Back" button to return to a previous screen. Otherwise, click "Finish" to leave the wizard. Click "Next" then "Yes" to start the installation.
es: Una vez que haya seleccionado el disco y la partición, presione "Siguiente" para regresar a la pantalla de "Resumen" del disco para que pueda revisar sus selecciones. Si quiere cambiar algo, use el botón "Atrás" para regresar a una pantalla anterior. De otra forma, presione "Terminar" para dejar el asistente. Presione "Siguiente" y después "Sí" para comenzar la instalación.

source: Advanced Mode
es: Modo Avanzado

source: If you select advanced mode, the wizard will display the screen shown in :numref:`Figure %s: Advanced Mode Options <install8a>`.
es: Si selecciona el modo avanzado, el asistente le mostrará la pantalla de la :numref:`Figura %s: Opciones del Modo Avanzado <install8a>`.

source: This screen provides the following options:
es: Esta pantalla proporciona las siguientes opciones:

source: **Selected Disk:** select the disk to install into.
es: **Disco Seleccionado:** Selecciona el disco donde se llevará a cabo la instalación.

source: **Selected Partition:** select the desired partition or area of free space.
es: **Partición Seleccionada:** Selecciona la partición deseada o el área de espacio libre.

source: **Partition Scheme:** the default of "GPT (Best for new hardware)" is a partition table layout that supports larger partition sizes than the traditional "MBR (Legacy)" layout. **If your installation disk/partition is larger than 2 TB, this option must be selected**. Some older motherboards do not support this option. If the installation fails, try again with "MBR (Legacy)" selected. When in doubt, try the default selection first. Note that this section will not appear if you specify a partition rather than "Use entire disk" in the "Selected Partition" drop-down menu.
es: **Esquema de Particiones:** El predeterminado "GPT (Mejor para hardware nuevo)" es un diseño de tabla de particiones que soporta tamaños de particiones más grandes que el diseño tradicional "MBR (Antiguo)". **Si su disco de instalación/partición es más grande que 2 TB, esta opción debe seleccionarse**. Algunas tarjetas madre no soportan esta opción. Si la instalación falla, intente de nuevo con "MBR (Antiguo)" seleccionado. Si tiene dudas, intente primero con la selección predeterminada. Note que esta sección no aparecerá si usted especificó una partición en vez de "Usar el disco completo" en el menú desplegable "Partición Seleccionada".

source: **Target Installation:** when installing to non-UEFI systems, keep the default selection of "BIOS (Legacy motherboards)". If the hardware supports UEFI, change the selection to "UEFI (Modern motherboards)". Note that this section will not appear if you specify a partition rather than "Use entire disk" in the "Selected Partition" drop-down menu.
es: **Destino de la Instalación:** Cuando instale en sistemas sin UEFI, mantenga la selección predeterminada de "BIOS (Tarjetas Madre Antiguas)". Si el hardware soporta UEFI, cambie la selección a "UEFI (Tarjetas Madre Modernas)". Note que esta selección no aparecerá si usted especificó una partición en vez de "Usar el disco completo" en el menú desplegable "Partición Seleccionada".

source: **Force ZFS 4k block size:** this option should only be checked if you know for sure that the disk supports 4k, even though it lies and reports its size as 512b. Use with caution as it may cause the installation to fail.
es: **Forzar el tamaño de bloque ZFS a 4k:** Esta opción solo debería marcarse si está completamente seguro que el disco soporta 4k, a pesar de que mienta y reporte que su tamaño es de 512b. Úselo con precaución ya que puede causar que la instalación falle.

source: **ZFS pool name:** if you wish to use a pool name other than the default of *tank*, check this box and input the name of the pool.
es: **Nombre del pool ZFS:** Si quiere usar otro nombre de pool que el predeterminado de *tank*, marque esta casilla e introduzca el nombre del pool.

source: After making your selections click "Next" to access the ZFS configuration screens. The rest of this section provides a ZFS overview and demonstrates how to customize the ZFS layout. Note that *root* is a reserved term and can not be used as a pool name.
es: Después de hacer sus selecciones presione "Siguiente" para accesar las pantallas de configuración de ZFS. El resto de esta sección proporciona un vistazo a ZFS y demuestra como personalizar el diseño de ZFS. Note que *root* es una palabra reservada y no se puede usar como nombre del pool.

source: ZFS Overview
es: Vistazo a ZFS

source: ZFS is an enterprise grade file-system, which provides many features including: support for high storage capacities, high reliability, the ability to quickly take snapshots, boot environments, continuous integrity checking and automatic repair, RAIDZ which was designed to overcome the limitations of hardware RAID, and native NFSv4 ACLs.
es: ZFS es un sistema de archivos de nivel empresarial, que proporciona muchas características, incluyendo: soporte para almacenamiento de altas capacidades, alta confiabilidad, la habilidad de tomar snapshots rápidamente, entornos de arranque, chequeo de integridad continua y reparación automática, RAIDZ que fue diseñando para cubrir las limitaciones del hardware RAID, y ACLs de NFSv4 nativas.

source: If you are new to ZFS, the `Wikipedia entry on ZFS <https://en.wikipedia.org/wiki/ZFS>`_ provides an excellent starting point to learn about its features. Additionally, `FreeBSD Mastery: ZFS <http://zfsbook.com>`_ by Michael W Lucas and Allan Jude is a very helpful resource and is more specific to ZFS as it is implemented in FreeBSD.
es: Si usted es nuevo en ZFS, la `Entrada de ZFS en la Wikipedia <https://en.wikipedia.org/wiki/ZFS>`_ le proporciona un punto de inicio excelente para aprender acerca de sus características. Adicionalmente, `FreeBSD Mastery: ZFS <http://zfsbook.com>`_ de Michael W. Lucas y Allan Jude es un recurso muy útil y es más específico en ZFS como está implementado en FreeBSD.

source: These resources are also useful to bookmark and refer to as needed:
es: Estos recursos son también útiles para marcarlos y referirse a ellos según los necesite:

source: `ZFS Evil Tuning Guide <http://www.solarisinternals.com/wiki/index.php/ZFS_Evil_Tuning_Guide>`_
es: `ZFS Evil Tuning Guide <http://www.solaris-cookbook.eu/solaris/solaris-10-zfs-evil-tuning-guide/>`_

source: `ZFS Best Practices Guide <http://www.solarisinternals.com/wiki/index.php/ZFS_Best_Practices_Guide>`_
es: `ZFS Best Practices Guide <http://www.solarisinternals.com/wiki/index.php/ZFS_Best_Practices_Guide>`_ (Offline)

source: `blog post explaining how ZFS simplifies the storage stack <https://blogs.oracle.com/bonwick/entry/rampant_layering_violation>`_
es: `Entrada de blog explicando cómo ZFS simplifica la pila de almacenamiento <https://blogs.oracle.com/bonwick/entry/rampant_layering_violation>`_

source: The following is a glossary of terms used by ZFS:
es: El siguiente es un glosario de términos usados por ZFS:

source: **Pool:** a collection of devices that provides physical storage and data replication managed by ZFS. This pooled storage model eliminates the concept of volumes and the associated problems of partitions, provisioning, wasted bandwidth, and stranded storage. Thousands of filesystems can draw from a common storage pool, each one consuming only as much space as it actually needs. The combined I/O bandwidth of all devices in the pool is available to all filesystems at all times. The `Storage Pools Recommendations <http://www.solarisinternals.com/wiki/index.php/ZFS_Best_Practices_Guide#ZFS_Storage_Pools_Recommendations>`_ of the ZFS Best Practices Guide provides detailed recommendations for creating the storage pool.
es: **Pool:** Una colección de dispositivos que proporcionan almacenamiento físico y replicación de datos administrados por ZFS. Este modelo de almacenamiento elimina el concepto de volúmenes y los problemas asociados de particiones, aprovisionamiento, ancho de banda desperdiciado, y almacenamiento atascado. Miles de sistemas de archivos pueden tomar espacio desde un pool de almacenamiento común, cada uno consumiendo solamente tanto espacio como se necesite. La E/S combinada de ancho de banda de todos los dispositivos en el pool está disponible para todos los sistemas de archivos en cualquier momento. Las `Recomendaciones para Pools de Almacenamiento <http://www.solarisinternals.com/wiki/index.php/ZFS_Best_Practices_Guide#ZFS_Storage_Pools_Recommendations>`_ de la Guía de Mejores Prácticas de ZFS proporciona recomendaciones detalladas para crear el pool de almacenamiento.

source: **Mirror:** a form of RAID where all data is mirrored onto two or more disks, creating a redundant copy should a disk fail.
es: **Mirror:** Una forma de RAID donde todos los datos son reflejados dentro de dos o más discos, creando una copia redundante por si un disco llegara a fallar.

source: **RAIDZ:** ZFS software solution that is equivalent to RAID5 in that it allows one disk to fail without losing data. Requires a minimum of 3 disks.
es: **RAIDZ:** Solución de software ZFS que es equivalente al RAID5 en el caso de que permite que un disco falle sin perder datos. Requiere un mínimo de 3 discos.

source: **RAIDZ2:** double-parity ZFS software solution that is similar to RAID6 in that it allows two disks to fail without losing data. Requires a minimum of 4 disks.
es: **RAIDZ2:** Solución de software ZFS de doble paridad que es similar al RAID6 en el caso de que permite que dos discos fallen sin perder datos. Requiere un mínimo de 4 discos.

source: **RAIDZ3:** triple-parity ZFS software solution. RAIDZ3 offers three parity drives and can operate in degraded mode if up to three drives fail with no restrictions on which drives can fail.
es: **RAIDZ3:** Solución de software ZFS de triple paridad. RAIDZ3 ofrece tres discos de paridad y puede operar en modo degradado si más de tres discos fallan, sin restricciones de cuales discos pueden fallar.

source: **Dataset:** once a pool is created, it can be divided into datasets. A dataset is similar to a folder in that it supports permissions. A dataset is also similar to a filesystem in that you can set properties such as quotas and compression.
es: **Dataset:** Una vez que se ha creado un pool, puede dividirse en datasets. Un dataset es similar a una carpeta o directorio en que soporta permisos. Un dataset también es similar a un sistema de archivos en que puede darle propiedades como quotas y compresión.

source: **Snapshot:** a read-only point-in-time copy of a filesystem. Snapshots can be created quickly and, if little data changes, new snapshots take up very little space. For example, a snapshot where no files have changed takes 0MB of storage, but if you change a 10GB file it will keep a copy of both the old and the new 10GB version. Snapshots provide a clever way of keeping a history of files, should you need to recover an older copy or even a deleted file. For this reason, many administrators take snapshots often (e.g. every 15 minutes), store them for a period of time (e.g. for a month), and store them on another system. Such a strategy allows the administrator to roll the system back to a specific time or, if there is a catastrophic loss, an off-site snapshot can restore the system up to the last snapshot interval (e.g. within 15 minutes of the data loss). Snapshots can be cloned or rolled back, but the files on the snapshot can not be accessed independently.
es: **Snapshot:** Una copia de solo lectura y de un punto en el tiempo de un sistema de archivos. Los snapshots pueden ser creados rápidamente y, si pocos datos cambian, los nuevos snapshots ocupan muy poco espacio. Por ejemplo, un snapshot en donde no han cambiado los archivos ocupa 0 MB de almacenamiento, pero si cambia un archivo de 10 GB mantendrá una copia de los dos, el antiguo y la nueva versión de 10 GB. Los snapshots proporcionan una forma inteligente de mantener un historial de archivos, que podría necesitar para recuperar una antigua copia o hasta un archivo eliminado. Por esta razón muchos administradores hacen snapshots muy seguido (por ejemplo cada 15 minutos), mantenerlos por un periodo de tiempo (por ejemplo por un mes), y guardarlos en otro sistema. Dicha estrategia permite al administrador regresar el sistema a un estado anterior o, si hay una pérdida catastrófica, un snapshot remoto puede restaurar el sistema hasta el último intervalo de snapshots (por ejemplo dentro de los 15 minutos de la pérdida de los datos). Los snapshots pueden clonarse o regresarse, pero los archivos en el snapshot no se pueden accesar independientemente.

source: **Clone:** a writable copy of a snapshot which can only be created on the same ZFS volume. Clones provide an extremely space-efficient way to store many copies of mostly-shared data such as workspaces, software installations, and diskless clients. Clones do not inherit the properties of the parent dataset, but rather inherit the properties based on where the clone is created in the ZFS pool. Because a clone initially shares all its disk space with the original snapshot, its used property is initially zero. As changes are made to the clone, it uses more space.
es: **Clon:** Una copia con permisos de escritura de un snapshot, el cuál solo puede ser creado en el mismo volúmen ZFS. Los clones proporcionan una manera extremadamente eficiente en cuando a espacio para guardar muchas copias de datos compartidos principalmente como espacios de trabajo, instalaciones de software, y clientes sin discos. Los clones no heredan las propiedades del dataset padre, pero si heredan las propiedades basadas en dónde se ha creado el clon dentro del pool ZFS. Ya que un clon inicialmente comparte todo su espacio en disco con el snapshot original, su propiedad de uso es inicialmente cero. Conforme se hagan cambios en el clon, usa más espacio.

source: **ZIL:** is effectively a filesystem journal that manages writes. The ZIL is a temporary storage area for sync writes until they are written asynchronously to the ZFS pool. If the system has many sync writes, such as from a database server, performance can be increased by adding a dedicated log device known as a SLOG (Secondary LOG). If the system has few sync writes, a SLOG will not speed up writes. When creating a dedicated log device, it is recommended to use a fast SSD with a supercapacitor or a bank of capacitors that can handle writing the contents of the SSD's RAM to the SSD. If you decide to create a dedicated log device, the SSD should be half the size of system RAM as anything larger than that is unused capacity. Note that a dedicated log device can not be shared between ZFS pools and that the same device cannot hold both a log and a cache device.
es: **ZIL:** Es efectivamente un journal de sistema de archivos que administra escrituras. El ZIL es un área de almacenamiento temporal para escrituras síncronas hasta que se escriben asíncronamente al pool ZFS. Si el sistema tiene muchas escrituras síncronas, tales como de un servidor de base de datos, el rendimiento se puede incrementar añadiendo un dispositivo de logueo dedicado conocido como un SLOG (LOG Secundario). Si el sistema tiene pocas escrituras síncronas, un SLOG no acelerará las escrituras. Cuando se crea un dispositivo de logueo dedicado, se recomienda usar un SSD rápido con un supercapacitor o un banco de capacitores que puedan soportar escribir los contenidos de la RAM del SSD al SSD. Si usted decide crear un dispositivo dedicado de logueo, el SSD debería ser de la mitad del tamaño de la RAM del sistema ya que algo más grande que eso es capacidad no usada. Note que un dispositivo dedicado de logueo no se puede compartir entre pools de ZFS y que el mismo dispositivo no puede alojar ni un dispositivo de logueo ni un dispositivo de caché.

source: **L2ARC:** ZFS uses a RAM cache to reduce read latency. If an SSD is dedicated as a cache device, it is known as an L2ARC and ZFS uses it to store more reads which can increase random read performance. However, adding a cache device will not improve a system with too little RAM and will actually decrease performance as ZFS uses RAM to track the contents of L2ARC. RAM is always faster than disks, so always add as much RAM as possible before determining if the system would benefit from a L2ARC device. If you have a lot of applications that do large amounts of random reads on a dataset small enough to fit into the L2ARC, read performance may be increased by adding a dedicated cache device. SSD cache devices only help if your working set is larger than system RAM, but small enough that a significant percentage of it will fit on the SSD. Note that a dedicated L2ARC device can not be shared between ZFS pools.
es: **L2ARC:** ZFS usa un caché de RAM para reducir la latencia de lectura. Si un SSD está dedicado como dispositivo de caché, se le conoce como un L2ARC y ZFS lo usa para almacenar más lecturas que pueden incrementar el rendimiento de lecturas aleatorias. Sin embargo, añadir un dispositivo de caché no mejorará un sistema con poca RAM y en realidad disminuirá el rendimiento ya que ZFS usa la RAM para seguir la pista de los contenidos de L2ARC. La RAM siempre es más rápida que los discos, así que siempre añada tanta RAM como sea posible antes de determinar si el sistema se beneficiará con un dispositivo L2ARC. Si tiene muchas aplicaciones que hacen un gran número de lecturas aleatorias en un dataset lo suficientemente pequeño para caber dentro del L2ARC, el rendimiento de lectura puede incrementarse añadiendo un dispositivo de caché dedicado. Los dispositivos SSD de caché solo ayudan si su set de trabajo es más grande que la RAM del sistema, pero suficientemente pequeño que un porcentaje significativo de él quepa en el SSD. Note que un dispositivo L2ARC dedicado no puede ser compartido entre pools de ZFS.

source: ZFS Layout
es: Diseño de ZFS

source: In "Advanced Mode", the disk setup wizard allows you to configure your ZFS layout. The initial ZFS configuration screen is seen in :numref:`Figure %s: ZFS Configuration <install9a>`.
es: En el "Modo Avanzado", el asistente de configuración del disco le permite configurar su diseño ZFS. La pantalla inicial de la configuración de ZFS se muestra en la :numref:`Figura %s: Configuración ZFS <install9a>`.

source: If your system contains multiple drives and you would like to use them to create a ZFS mirror or RAIDZ*, check the box "Add additional disks to zpool" which will enable this screen. Any available disks will be listed in the box below the "ZFS Virtual Device Mode" drop-down menu. Select the desired level of redundancy, then the desired number of disks.
es: Si su sistema contiene múltiples discos y quiere usarlos para crear un mirror ZFS o RAIDZ*, seleccione la casilla "Añadir discos adicionales al zpool" el cuál habilitará esta pantalla. Cualquier disco disponible se listará en la caja debajo del menú desplegable "Modo de Dispositivo Virtual ZFS". Seleccione el nivel deseado de redundancia, después el número deseado de discos.

source: the PC-BSD® installer requires you to use entire disks (not partitions) when adding additional disks to the pool.
es: El instalador de PC-BSD® requiere que usted use los discos completos (no particiones) cuando se añaden discos adicionales al pool.

source: While ZFS will let you use disks of different sizes, this is discouraged as it will decrease storage capacity and ZFS performance.
es: Mientras que ZFS le dejará usar discos de diferentes tamaños, esto no se recomienda ya que decrecerá la capacidad de almacenamiento y el rendimiento de ZFS.

source: The PC-BSD® installer supports the following ZFS configurations:
es: El instalador de PC-BSD® soporta las siguientes configuraciones para ZFS:

source: **mirror:** requires a minimum of 2 disks.
es: **Mirror:** Requiere un mínimo de 2 discos.

source: **RAIDZ1:** requires a minimum of 3 disks. For best performance, a maximum of 9 disks is recommended.
es: **RAIDZ1:** Requiere un mínimo de 3 discos. Para un mejor rendimiento, un máximo de 9 discos es recomendado.

source: **RAIDZ2:** requires a minimum of 4 disks. For best performance, a maximum of 10 disks is recommended.
es: **RAIDZ2:** Requiere un mínimo de 4 discos. Para un mejor rendimiento, un máximo de 10 discos es recomendado.

source: **RAIDZ3:** requires a minimum of 5 disks. For best performance, a maximum of 11 disks is recommended.
es: **RAIDZ3:** Requiere un mínimo de 5 discos. Para un mejor rendimiento, un máximo de 11 discos es recomendado.

source: **stripe:** requires a minimum of 2 disks. **Note that a stripe does NOT provide ANY redundancy. If any disk fails in a stripe, all data in the pool is lost!**
es: **Stripe:** requiere un mínimo de 2 discos. **Note que un stripe NO proporciona NINGUNA redundancia. Si cualquier disco en el stripe falla, todos los datos en el pool se pierden!**

source: The installer will not let you save a configuration if your system does not meet the minimum number of disks required by that configuration. As you select a configuration, a message will indicate how many more disks you need to select.
es: El instalador no le permitirá guardar la configuración si su sistema no cumple con el número mínimo de discos requeridos para esa configuración. Ya que seleccione una configuración, un mensaje le indicará cuántos discos más necesita seleccionar.

source: To use multiple disks, select the type of configuration from the "ZFS Virtual Device Mode" drop-down menu, then check the box for each disk that you would like to add to that configuration. When finished, click the "Next" button to see the screen shown in :numref:`Figure %s: Add L2ARC or ZIL <install10a>`.
es: Para usar múltiples discos, seleccione el tipo de configuración desde el menú desplegable "Modo de Dispositivo Virtual ZFS", y elija la casilla para cada disco que quiera añadir a esa configuración. Cuando termine, presione el botón "Siguiente" para ver la pantalla mostrada en la :numref:`Figura %s: Añadiendo L2ARC o ZIL <install10a>`.

source: This screen can be used to specify an SSD to use as an L2ARC or a secondary log device. Any available devices will be listed in the boxes in this screen. Note that a separate SSD is needed for each type of device. Refer to the descriptions for ZIL and L2ARC in the :ref:`ZFS Overview` to determine if your system would benefit from any of these devices before adding them in this screen. When finished, click "Next" to see the screen shown in :numref:`Figure %s: Configure Encryption <install11a>`.
es: Esta pantalla puede ser usada para especificar un SSD a usar como un L2ARC o un dispositivo secundario de logs. Cualquier dispositivo disponible se listará en las cajas de esta pantalla. Note que un SSD separado se necesita para cada tipo de dispositivo. Refiérase a las descripciones para ZIL y L2ARC en :ref:`Vistazo a ZFS` para determinar si su sistema se beneficiará de cualquiera de estos dispositivos antes de añadirlos en esta pantalla. Cuando termine, presione "Next" para ver la pantalla mostrada en la :numref:`Figura %s: Configurando Encriptación <install11a>`.
