Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/install.po
Languages: es

source: Installing PC-BSD®
es: Instalando PC-BSD®

source: This chapter describes how to use the graphical installer to install a graphical desktop directly onto a hard drive or into a virtual machine using virtualization software such as `VirtualBox <https://www.virtualbox.org/>`_. If you have downloaded the CD version of TrueOS® or prefer to use a text based installer, instead use the instructions in :ref:`Using the Text Installer`.
es: Este capítulo describe como usar el instalador gráfico para instalar un escritorio gráfico directamente en un disco duro o en una máquina virtual, usando software de virtualización como `VirtualBox <https://www.virtualbox.org/>`_. Si ha descargado la versión de CD de TrueOS® o prefiere usar un instalador basado en texto, entonces use las instrucciones en :ref:`Usando el Instalador en Modo Texto`.

source: To begin the PC-BSD® installation, insert the prepared boot media and boot the system. If the computer boots into an existing operating system instead of the installer, reboot and check your computer's BIOS program to ensure that the drive containing the installation media is listed first in the boot order. Save your BIOS changes and reboot.
es: Para comenzar la instalación de PC-BSD®, inserte el medio de arranque preparado y arranque el sistema. Si la computadora arranca dentro de un sistema operativo existente en vez de en el instalador, reinicie y revise la BIOS de su computadora para asegurarse que la unidad que contiene la instalación esté listada al principio en el orden de arranque. Guarde sus cambios en el BIOS y reinicie.

source: The initial boot screen, shown in :numref:`Figure %s: PC-BSD® Installer Boot Menu <install1a>`, offers a choice of using either the graphical or the text based installer. Unless you select otherwise, the graphical installer will load. To instead use the text based installer, either from the console or over a serial connection, use the arrow keys to select an option. If the graphical installer hangs when loading the graphics driver, try selecting the VESA mode option of the graphical installer.
es: La pantalla inicial de arranque, mostrada en la :numref:`Figura %s: Menú de Arranque del Instalador de PC-BSD® <install1a>`, ofrece la opción de usar ya sea el instalador gráfico o el basado en texto. A menos que elija otra cosa, el instalador gráfico se iniciará. Para en su lugar, usar el instalador basado en texto, ya sea desde la consola o sobre una conexión serial, use las teclas de flecha para seleccionar una opción. Si el instalador gráfico se cuelga al momento de cargar el controlador gráfico, intente seleccionar la opción del modo VESA del instalador gráfico.

source: The rest of this chapter describes the screens of the graphical installer.
es: El resto de este capítulo describe las pantallas del instalador gráfico.

source: Language Selection Screen
es: Pantalla de Selección de Idioma

source: The first graphical installer screen, seen in :numref:`Figure %s: Welcome and Language Selection Screen <install2a>`, indicates that the installer successfully loaded and is ready to present you with its options.
es: La primera pantalla del instalador gráfico, mostrada en la :numref:`Figura %s: Pantalla de Bienvenida y de Selección de Idioma <install2a>`, indica que el instalador se cargó satisfactoriamente y está listo para presentarle sus opciones.

source: Starting on the left-hand side, the icons in the bottom navigation area allow you to:
es: Comenzando por el lado izquierdo, los iconos en la parte baja del área de navegación le permitiran:

source: access :ref:`Hardware Compatibility` information
es: Accesar la información de :ref:`Compatibilidad de Hardware`.

source: manage :ref:`Network Configuration` for a network installation or system restore
es: Administrar la :ref:`Configuración de Red` para una instalación vía red o una restauración del sistema.

source: read that screen's Help text
es: Leer el texto de Ayuda de esa pantalla.

source: use the onscreen keyboard
es: Usar el teclado en pantalla.

source: switch between the US keyboard layout and a user selected layout
es: Cambiar entre el diseño del teclado en inglés y el diseño del teclado seleccionado por el usuario.

source: access the emergency shell described in :ref:`Using the System Utilities Menu`
es: Accesar el shell de emergencia descrito en :ref:`Usando el Menú de Utilerías del Sistema`.

source: access the :ref:`Disk Manager` utility
es: Accesar la utilería de :ref:`Administración de Disco`.

source: abort the installation
es: Abortar la instalación.

source: navigate to a previous or upcoming screen
es: Navegar a una pantalla previa o a la siguiente.

source: Hover over an icon to view its description in the tip bar at the bottom of the screen.
es: Pase el puntero sobre un icono para ver su descripción en la barra de tips en la parte baja de la pantalla.

source: the default keyboard layout can be changed now, during the post-installation :ref:`Language Screen`, or when :ref:`Logging In`.
es: El diseño predeterminado del teclado se puede cambiar ahora, durante la :ref:`Pantalla de Idioma` después de instalar, o al momento de :ref:`Ingresar`.

source: A button is also provided to "Load config from USB". If you have saved the configuration from a previous installation, it can be loaded at this time from a FAT-formatted USB stick.
es: Un botón se proporciona también para "Cargar la configuración desde USB". Si ha guardado la configuración en una instalación previa, puede cargarla en este momento desde un dispositivo USB formateado con FAT.

source: By default, PC-BSD® menus will display in English, unless you select another language in the drop-down menu in this screen. The menus in PC-BSD® have been translated to several different languages and you can see the status of your native language at the `PC-BSD® Translation Site <http://translate.pcbsd.org/>`_. If your language does not show 100% translation at this website, it means that not all of the menus have been translated yet and that the untranslated menus will be displayed in English. Refer to :ref:`Become a Translator` if you would like to assist in translating the graphical menus to your native language.
es: Por defecto, los menús de PC-BSD® se desplegarán en inglés, a menos que seleccione otro idioma en el menú desplegable en esta pantalla. Los menús en PC-BSD® se han traducido a diferentes idiomas y puede ver el estado de su idioma nativo en el `Sitio de Traducciones de PC-BSD® <http://translate.pcbsd.org/>`_. Si su idioma no se muestra al 100% traducido en este sitio web, significa que no todos los menús han sido traducidos aún y que los menús no traducidos se mostrarán en inglés. Refiérase a :ref:`Conviértase en Traductor` si quiere ayudar a traducir los menús gráficos a su idioma nativo.

source: small screens may not display the entire installer window, which means that the buttons at the bottom of the window are hidden and inaccessible. There are two solutions for this situation: press :kbd:`Alt` while dragging the window with the mouse, or press :kbd:`Alt+N` to select the next button of the window.
es: Las pantallas pequeñas tal vez no muestren la ventana del instalador completa, lo que significa que los botones de la parte baja de la ventana están escondidos e inaccesibles. Hay dos soluciones a esta situación: presione :kbd:`Alt` mientras arrastra la ventana con el ratón, o presione :kbd:`Alt+N` para seleccionar el siguiente botón de la ventana.

source: When you are finished reviewing this screen, click the "Next" button to go to the next installation screen.
es: Cuando termine de revisar esta pantalla, presione el botón "Siguiente" para ir a la siguiente pantalla de instalación.

source: System Selection Screen
es: Pantalla de Selección del Sistema

source: The "System Selection" screen, shown in :numref:`Figure %s: System Selection Screen <install3a>`, allows you to install a desktop (PC-BSD®) or a server (TrueOS®) operating system. It also can be used for :ref:`Restoring the Operating System`. This chapter concentrates on a desktop installation. Refer to :ref:`Install a Server` for instructions on how to install a command-line only server.
es: La pantalla de "Selección del Sistema", mostrada en la :numref:`Figura %s: Pantalla de Selección del Sistema <install3a>`, le permite instalar un sistema operativo de escritorio (PC-BSD®) o un servidor (TrueOS®). También puede usarse para :ref:`Restaurar el Sistema Operativo`. Este capítulo se concentra en una instalación de escritorio. Refiérase a :ref:`Instalando un Servidor` para instrucciones sobre cómo instalar un servidor con solamente línea de comandos.

source: By default, PC-BSD® will be selected and the default window manager will depend upon the amount of RAM on the system. Systems containing more than 2GB of RAM will default to the KDE desktop and all other systems will default to the LXDE desktop. To change the default window manager or to browse for additional desktops and components to install, click the "Customize" button to open the screen shown in :numref:`Figure %s: Browsing Additional System Components <install4>`.
es: Por defecto, PC-BSD® será seleccionado y el gestor de ventanas predeterminado dependerá de la cantidad de RAM en el sistema. Los sistemas que contengan más de 2 GB de RAM ejecutarán el escritorio KDE y los demás sistemas ejecutarán el escritorio LXDE. Para cambiar el gestor de ventanas predeterminado o para buscar escritorios adicionales y componentes para instalar, presione el botón "Personalizar" para abrir la pantalla mostrada en la :numref:`Figura %s: Buscando Componentes del Sistema Adicionales <install4>`.

source: Check the ► next to a component in order to expand it so that you can check or uncheck its sub-components. All components that are checked will be installed. If you highlight then right-click a component and select "View Packages", a pop-up menu will list the name of the packages that are installed with that component.
es: Presione la ► junto a un componente para expandirlo para que pueda seleccionar o deseleccionar sus sub-componentes. Todos los componentes que están seleccionados serán instalados. Si selecciona un componente, después presiona con el botón derecho del ratón y selecciona "Ver Paquetes", un menú emergente listará el nombre de los paquetes que serán instalados con ese componente.

source: The following components are available for installation.
es: Los siguientes componentes están disponibles para instalarse.

source: **Desktops:** the following desktops are available: :ref:`Awesome`, :ref:`Cinnamon`, :ref:`FVWM`, :ref:`GNOME`, :ref:`i3`, :ref:`IceWM`, :ref:`KDE4`, :ref:`Lumina`, :ref:`LXDE`, :ref:`MATE`, :ref:`Openbox`, :ref:`Ratpoison`, :ref:`spectrwm`, :ref:`WindowLab`, :ref:`Window Maker`, and :ref:`XFCE4`. Each desktop that is selected will be installed and will appear in the login menu of the installed PC-BSD® system.
es: **Escritorios:** Los siguientes escritorios están disponibles: :ref:`Awesome`, :ref:`Cinnamon`, :ref:`FVWM`, :ref:`GNOME`, :ref:`i3`, :ref:`IceWM`, :ref:`KDE4`, :ref:`Lumina`, :ref:`LXDE`, :ref:`MATE`, :ref:`Openbox`, :ref:`Ratpoison`, :ref:`spectrwm`, :ref:`WindowLab`, :ref:`Window Maker`, y :ref:`XFCE4`. Cada escritorio que sea seleccionado se instalará y aparecerá en el menú de inicio de sesión del sistema PC-BSD® instalado.

source: even if you uncheck all desktops, :ref:`Fluxbox` is always installed and available in the login menu of a PC-BSD® system.
es: Incluso si deselecciona todos los escritorios, :ref:`Fluxbox` siempre se instalará y estará disponible en el menú de inicio de sesión del sistema PC-BSD®.

source: **Devel:** check the box to install `QGit <http://sourceforge.net/projects/qgit/>`_.
es: **Desarrollo:** Seleccione la casilla para instalar `QGit <http://sourceforge.net/projects/qgit/>`_.

source: **Drivers:** if you have an NVIDIA video card, the correct driver should already be checked for you.
es: **Controladores:** Si tiene una tarjeta de video NVIDIA, el controlador correcto debería estar ya seleccionado para usted.

source: **Editors:** check the box to install `LibreOffice <http://www.libreoffice.org/>`_.
es: **Editores:** Seleccione la casilla para instalar `LibreOffice <http://www.libreoffice.org/>`_.

source: **Emulators:** check the box to install `VirtualBox <https://www.virtualbox.org/>`_.
es: **Emuladores:** Seleccione la casilla para instalar `VirtualBox <https://www.virtualbox.org/>`_.

source: **i18n:** if you expand the ► you can select to install localization for for the KDE desktop and for the operating system.
es: **i18n:** Si expande la ► puede seleccionar instalar la región para el escritorio KDE y para el sistema operativo.

source: **IRC:** check the box to install `HexChat <http://hexchat.github.io/>`_.
es: **IRC:** Seleccione la casilla para instalar `HexChat <http://hexchat.github.io/>`_.

source: **Java:** if you expand the ► you can select to install `IcedTea <http://icedtea.classpath.org/wiki/IcedTea-Web>`_ and `OpenJDK <http://openjdk.java.net/>`_ versions 7 and 8.
es: **Java:** Si expande la ► puede seleccionar instalar `IcedTea <http://icedtea.classpath.org/wiki/IcedTea-Web>`_ y `OpenJDK <http://openjdk.java.net/>`_ versiones 7 y 8.

source: **Mail:** check this box to install the `Thunderbird <https://www.mozilla.org/en-US/thunderbird/>`_ email client.
es: **Correo:** Seleccione la casilla para instalar el cliente de correo `Thunderbird <https://www.mozilla.org/en-US/thunderbird/>`_.

source: **MediaCenter:** if you expand the ► you can select to install `KODI <http://kodi.tv/>`_ and `PlexHome Theater <https://plex.tv/>`_.
es: **MediaCenter:** Si expande la ► puede seleccionar instalar `KODI <http://kodi.tv/>`_ y `PlexHome Theater <https://plex.tv/>`_.

source: **Net:** check this box to install the `KRDC <https://www.kde.org/applications/internet/krdc/>`_ remote desktop client.
es: **Red:** Seleccione la casilla para instalar el cliente de escritorio remoto `KRDC <https://www.kde.org/applications/internet/krdc/>`_.

source: **Net-IM:** check this box to install the `Pidgin <http://www.pidgin.im/>`_ IRC client.
es: **Net-IM:** Seleccione la casilla para instalar el cliente de IRC `Pidgin <http://www.pidgin.im/>`_.

source: **Roles:** if you expand the ► you can select to install the following installation roles: "Development", "Internet", "Media", and "Office and Productivity".
es: **Roles:** Si expande la ► puede seleccionar el instalar los siguientes roles de instalación: "Desarrollo", "Internet", "Media", y "Oficina y Productividad".

source: **Security:** check this box to install the `OpenVPN <https://openvpn.net/index.php/open-source.html>`_ VPN client.
es: **Seguridad:** Seleccione la casilla para instalar el cliente de VPN `OpenVPN <https://openvpn.net/index.php/open-source.html>`_.

source: **SysUtils:** check this box to install the `PySalt <http://saltstack.com/community/>`_ distributed remote execution and configuration management system.
es: **SysUtils:** Seleccione la casilla para instalar el sistema de administración de configuración y ejecución remota distribuida `PySalt <http://saltstack.com/community/>`_.

source: **Virtualization:** if you expand the ► you can install `VirtualBox Guest Additions <https://www.virtualbox.org/>`_ and `VMwareGuest <http://open-vm-tools.sourceforge.net/about.php>`_.
es: **Virtualización:** Si expande la ► puede instalar los `Agregados del Huésped de VirtualBox <https://www.virtualbox.org/>`_ y `VMwareGuest <http://open-vm-tools.sourceforge.net/about.php>`_.

source: **Web:** if you expand the ► you can select to install the `Chromium <http://www.chromium.org/>`_ and `Firefox <https://www.mozilla.org/en-US/firefox/new/>`_ web browsers. By default, Firefox is selected.
es: **Web:** Si expande la ► puede seleccionar instalar los navegadores `Chromium <http://www.chromium.org/>`_ y `Firefox <https://www.mozilla.org/en-US/firefox/new/>`_. Por defecto, Firefox está seleccionado.

source: Once you have made your selection(s), click the "Save" button to save your selections. The "PC-BSD Package Selection" box will list the components that you selected for installation. You can now click the "Next" button to proceed to the next screen.
es: Una vez que ha realizado su(s) selección(es), presione el botón "Guardar" para guardarlas. La casilla de "Selección de Paquetes de PC-BSD" listará los componentes que ha seleccionado para instalar. Ahora puede presionar el botón "Siguiente" para proceder con la siguiente pantalla.

source: if you are installing a desktop, the installer will display a pop-up message if it cannot find a physical or virtual disk that does not meet the recommended minimum size of 50GB. It will let you continue an installation on a smaller disk, but you may run into disk space issues on smaller disks.
es: Si está instalando un escritorio, el instalador desplegará un mensaje emergente si no puede encontrar un disco físico o virtual que cumpla con el tamaño mínimo recomendado de 50 GB. Le dejará continuar la instalación en un disco más pequeño, pero usted tendrá problemas de espacio en disco con discos pequeños.

source: Disk Selection Screen
es: Pantalla de Selección de Disco

source: The "Disk Selection" screen, seen in :numref:`Figure %s: Disk Selection Screen <install5a>`, summarizes the default disk configuration.
es: La pantalla de "Selección de Disco", mostrada en la :numref:`Figura %s: Pantalla de Selección de Disco <install5a>`, resume la configuración predeterminada del disco.

source: by default, PC-BSD® will assume that you wish to install on the entire first disk. If you are installing PC-BSD® as the only operating system on your computer, simply click "Next" to start the installation. However, if this is not your intent, review the rest of this section to determine how to layout your disk. If you plan on booting PC-BSD® with another operating system, you should also review the section on :ref:`Dual Booting`.
es: Por defecto, PC-BSD® asumirá que quiere instalar en el primer disco completo. Si está instalando PC-BSD® como el único sistema operativo en su computadora, simplemente presione "Siguiente" para comenzar la instalación. De cualquier forma, si esta no es su intención, revise el resto de esta sección para determinar cómo diseñar su disco. Si planea arrancar PC-BSD® con otro sistema operativo, también debería revisar la sección sobre :ref:`Arranque Dual`.

source: If you wish to select which disk or partition to install PC-BSD® into, click the "Customize" button to start the Disk Setup Wizard, shown in :numref:`Figure %s: Disk Setup Wizard <install6>`.
es: Si quiere seleccionar en cuál disco o partición instalar PC-BSD®, presione el botón de "Personalizar" para inciar el Asistente de Configuración de Disco, mostrado en la :numref:`Figura %s: Asistente de Configuración de Disco <install6>`.

source: The wizard provides three modes of operation. The rest of this section describes these modes in detail.
es: El asistente proporciona tres modos de operación. El resto de esta sección describe estos modos en detalle.

source: **Basic:** (default) select this mode if you wish to specify which partition or disk to install to.
es: **Basico:** (predeterminado) seleccione este modo si quiere especificar en qué partición o disco instalará.

source: **Advanced:** select this mode if you wish to specify the installation partition or disk, use GPT partitioning, use a UEFI BIOS, force the block size, change the default ZFS pool name, specify the filesystem layout, add a log or cache device, or encrypt the disk.
es: **Avanzado:** seleccione este modo si quiere especificar la partición o disco de instalación, usar particionamiento GPT, usar una BIOS UEFI, forzar el tamaño de bloque, cambiar el nombre predeterminado del pool ZFS, especificar el diseño del sistema de archivos, añadir un dispositivo de log o caché, o encriptar el disco.

source: **FreeBSD Expert:** select this mode if you prefer to drop down to a shell to manually enter the commands to setup your disk.
es: **Experto FreeBSD:** seleccione este modo si prefiere salir al shell para ingresar manualmente los comandos para configurar su disco.

source: regardless of the mode that you select, once the disk wizard completes and you click "Next" at the disk "Summary" screen, a pop-up window will ask if you would like to start the installation. Be sure to review the disk summary before clicking "Yes" and starting the installation. The disk "Summary" screen is your **very last chance** to make sure that you are ready. Once you click "Yes", the selected hard drive or partition will be formatted and any data it contains will be lost.
es: Independientemente del modo que seleccione, una vez que el asistente se complete y usted presione "Siguiente" en la pantalla de "Resumen" del disco, una ventana emergente preguntará si quiere comenzar la instalación. Asegúrese de revisar el resumen del disco antes de presionar "Sí" y comenzar la instalación. La pantalla de "Resumen" del disco es su **última oportunidad** para asegurarse que está listo. Una vez que presione "Sí", el disco duro o partición seleccionada será formateada y cualquier dato que contenga se perderá.

source: Once you have finished configuring your disks, you can save the finished configuration to re-use it at a later time. Insert a FAT-formatted USB stick and click "Save Config to USB".
es: Una vez que ha terminado de configurar sus discos, puede guardar la configuración para re-usarla después. Inserte un dispositivo USB formateado con FAT y presione "Guardar Configuración en USB".

source: Basic Mode
es: Modo Básico

source: If you select "Basic" mode, the wizard will display the screen shown in :numref:`Figure %s: Select a Disk or Partition <install7>`.
es: Si selecciona el modo "Básico", el asistente mostrará la pantalla de la :numref:`Figura %s: Seleccionando un Disco o Partición <install7>`.

source: By default, the first hard disk will be selected. If you wish to install on a different disk, use the "Selected Disk" drop-down menu to select the disk to install into.
es: Por defecto, el primer disco duro será seleccionado. Si quiere instalar en un disco diferente, use el menú desplegable "Disco Seleccionado" para seleccionar el disco en dónde instalar.

source: By default, the entire selected disk will be formatted. If the disk has been divided into partitions or you have an area of free space, use the "Selected Partition" drop-down menu to select the desired partition.
es: Por defecto, el disco se formateará completamente. Si el disco ha sido dividido en particiones o tiene un área con espacio libre, use el menú desplegable "Partición Seleccionada" para seleccionar la partición deseada.

source: PC-BSD® will only install into a primary partition, a GPT partition, or an area of free space. That is, you can not install PC-BSD® into a secondary or an extended partition. If you wish to create an area of free space to install into, refer to :ref:`Creating Free Space` for instructions.
es: PC-BSD® solo se instalará en una partición primaria, una partición GPT, o en un área de espacio libre. Así es, usted no puede instalar PC-BSD® en una partición secundaria o en una partición extendida. Si quiere crear un área de espacio libre para instalar allí, refiérase a :ref:`Creando Espacio Libre` para instrucciones.
