Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/introduction.po
Languages: es, pt_br

source: **Preface**
es: **Prefacio**
pt_br: **Prefácio**

source: Written by users of the PC-BSD® operating system.
es: Escrito por usuarios del sistema operativo PC-BSD®.
pt_br: Escrito por usuários do sistema operacional PC-BSD®.

source: Version |version|
es: Versión |version|
pt_br: Versão |version|

source: Welcome to PC-BSD®! This Handbook covers the installation and use of PC-BSD® |version|. This Handbook is a work in progress and relies on the contributions of many individuals. If you are interested in assisting with the Handbook, refer to the documentation `README <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. If you use IRC Freenode, you are welcome to join the #pcbsd channel where you will find other PC-BSD® users.
es: Bienvenido a PC-BSD®! Este manual cubre la instalación y uso de PC-BSD® |version|. Este Manual es un trabajo en proceso y se basa en las contribuciones de muchas personas. Si está interesado en colaborar con el Manual, remítase a la documentación `README <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. Si usa el IRC de Freenode, es bienvenido a unirse al canal #pcbsd donde encontrará otros usuarios de PC-BSD®.
pt_br: Bem-vindo ao PC-BSD®! Este Manual cobre a instalação e o uso do PC-BSD® |version|. Este Manual é um trabalho em progresso e conta com as contribuições de muitos colaboradores. Se você está interessado em auxiliar na elaboração do Manual, consulte a documentação `LEIA-ME <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. Se você usa o IRC Freenode, está convidado a juntar-se ao canal #pcbsd, onde encontrará outros usuários do PC-BSD®.

source: Previous versions of the Handbook in various formats and languages are available from `here <ftp://ftp.pcbsd.org/pub/handbook/>`_.
es: Versiones previas del Manual en varios formatos e idiomas están disponibles `aquí <ftp://ftp.pcbsd.org/pub/handbook/>`_.
pt_br: Versões anteriores do Manual em vários formatos e línguas estão disponíveis em `here <ftp://ftp.pcbsd.org/pub/handbook/>`_.

source: The PC-BSD® Users Handbook is freely available for sharing and redistribution under the terms of the `Creative Commons Attribution License <https://creativecommons.org/licenses/by/4.0/>`_. This means that you have permission to copy, distribute, translate, and adapt the work as long as you attribute the PC-BSD® Project as the original source of the Handbook.
es: El Manual del Usuario de PC-BSD® está disponible libremente para comprartir y redistribuír bajo los términos de la `Creative Commons Attribution License <https://creativecommons.org/licenses/by/4.0/>`_. Esto significa que tiene permiso de copiar, distribuír, traducir y adaptar el trabajo mientras atribuya al Proyecto PC-BSD® como la fuente original del Manual.
pt_br: O Manual para Usuários do PC-BSD® está livremente disponível para compartilhamento e redistribuição sob os termos da `Creative Commons Attribution License <https://creativecommons.org/licenses/by/4.0/>`_. Isto significa que você tem permissão para copiar, distribuir, traduzir e adaptar o trabalho, desde que você atribua ao Projeto PC-BSD® a qualidade de fonte original do Manual.

source: PC-BSD® and the PC-BSD® logo are registered trademarks of `iXsystems <https://www.ixsystems.com/>`_. If you wish to use the PC-BSD® logo in your own works, ask for permission first from marketing@ixsystems.com.
es: PC-BSD® y el logo de PC-BSD® son marcas registradas de `iXsystems <https://www.ixsystems.com/>`_. Si usted quiere hacer uso del logo de PC-BSD® en sus propios trabajos, pida permiso primero a marketing@ixsystems.com.
pt_br: PC-BSD® e o logotipo do PC-BSD® são marcas registradas da `iXsystems <https://www.ixsystems.com/>`_. Se você quiser usar o logotipo PC-BSD® em suas próprias obras, primeiramente peça permissão para marketing@ixsystems.com.

source: AMD is a trademark of Advanced Micro Devices, Inc.
es: AMD es una marca de Advanced Micro Devices, Inc.
pt_br: AMD é uma marca registrada de Advanced Micro Devices, Inc.

source: Apache is a trademark of The Apache Software Foundation.
es: Apache es una marca de The Apache Software Foundation.
pt_br: Apache é uma marca registrada de The Apache Software Foundation.

source: AppCafe® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
es: AppCafe® es una marca registrada de `iXsystems <https://www.ixsystems.com/>`_.
pt_br: AppCafe® é uma marca registrada de `iXsystems <https://www.ixsystems.com/>`_.

source: Asus® and Eee PC® are registered trademarks of ASUSTeK® Computer Inc.
es: Asus® y Eee PC® son marcas registradas de ASUSTeK® Computer Inc.
pt_br: Asus® e Eee PC® são marcas registradas de ASUSTeK® Computer Inc.

source: Facebook® is a registered trademark of Facebook Inc.
es: Facebook® es una marca registrada de Facebook Inc.
pt_br: Facebook® é uma marca registrada de Facebook Inc.

source: Flash® is a registered trademark of Adobe Systems Incorporated in the United States and/or other countries.
es: Flash® es una marca registrada de Adobe Systems Incorporated en los Estados Unidos y/u otros países.
pt_br: Flash® é uma marca registrada de Adobe Systems Incorporated nos Estados Unidos da América e outros países.

source: FreeBSD® is a registered trademark of the `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.
es: FreeBSD® es una marca registrada de la `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.
pt_br: FreeBSD® é uma marca registrada da `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.

source: FreeNAS® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
es: FreeNAS® es una marca registrada de `iXsystems <https://www.ixsystems.com/>`_.
pt_br: FreeNAS® é uma marca registrada de `iXsystems <https://www.ixsystems.com/>`_.

source: IBM® is a registered trademark of International Business Machines Corporation.
es: IBM® es una marca registrada de International Business Machines Corporation.
pt_br: IBM® é uma marca registrada de International Business Machines Corporation.

source: Intel, the Intel logo, Pentium Inside, and Pentium are trademarks of Intel Corporation in the U.S. and/or other countries.
es: Intel, el logo de Intel, Pentium Inside, y Pentium son marcas de Intel Corporation en los E.U. y/u otros países.
pt_br: Intel, o logotipo Intel, Pentium Inside, e Pentium são marcas registradas de Intel Corporation nos Estados Unidos da América e outros países.

source: Java™ is a trademark of Oracle America and/or its affiliates in the United States and other countries.
es: Java™ es una marca de Oracle America y/o sus afiliadas en los Estados Unidos y otros países.
pt_br: Java™ é uma marca registrada de Oracle America e suas afiliadas nos Estados Unidos da América e outros países.

source: Lenovo® is a registered trademark of Lenovo.
es: Lenovo® es una marca registrada de Lenovo.
pt_br: Lenovo® é uma marca registrada de Lenovo.

source: LinkedIn® is a registered trademark of LinkedIn Corporation.
es: LinkedIn® es una marca registrada de LinkedIn Corporation.
pt_br: LinkedIn® é uma marca registrada de LinkedIn Corporation.

source: Linux® is a registered trademark of Linus Torvalds.
es: Linux® es una marca registrada de Linus Torvalds.
pt_br: Linux® é uma marca registrada de Linus Torvalds.

source: Mac and Mac OS are trademarks of Apple Inc., registered in the U.S. and other countries.
es: Mac y Mac OS son marcas de Apple Inc., registradas en los E.U. y otros países.
pt_br: Mac e Mac OS são marcas registradas de Apple Inc., registradas nos Estados Unidos da América e outros países.

source: MacBook® is a registered trademark of Apple Inc.
es: MacBook® es una marca registrada de Apple Inc.
pt_br: MacBook® é uma marca registrada de Apple Inc.

source: MySQL is a trademark of Oracle.
es: MySQL es una marca de Oracle.
pt_br: MySQL é uma marca registrada de Oracle.

source: NVIDIA® is a trademark and/or registered trademark of NVIDIA Corporation in the U.S. and other countries.
es: NVIDIA® es una marca y/o marca registrada de NVIDIA Corporation en los E.U. y otros países.
pt_br: NVIDIA® é uma marca registrada de NVIDIA Corporation nos Estados Unidos da América e outros países.

source: PostgreSQL® is a registered trademark of the PostgreSQL Global Development Group.
es: PostgreSQL® es una marca registrada del PostgreSQL Global Development Group.
pt_br: PostgreSQL® é uma marca registrada do PostgreSQL Global Development Group.

source: ThinkPad® is a registered trademark of Lenovo.
es: ThinkPad® es una marca registrada de Lenovo.
pt_br: ThinkPad® é uma marca registrada de Lenovo.

source: TrueOS® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
es: TrueOS® es una marca registrada de `iXsystems <https://www.ixsystems.com/>`_.
pt_br: TrueOS® é uma marca registrada de `iXsystems <https://www.ixsystems.com/>`_.

source: Twitter is a trademark of Twitter, Inc. in the United States and other countries.
es: Twitter es una marca de Twitter, Inc. en los Estados Unidos y otros países.
pt_br: Twitter é uma marca registrada de Twitter, Inc. nos Estados Unidos da América e outros países.

source: UNIX® is a registered trademark of The Open Group.
es: UNIX® es una marca registrada de The Open Group.
pt_br: UNIX® é uma marca registrada do The Open Group.

source: VirtualBox® is a registered trademark of Oracle.
es: VirtualBox® es una marca registrada de Oracle.
pt_br: VirtualBox® é uma marca registrada de Oracle.

source: VMWare® is a registered trademark of VMWare, Inc.
es: VMWare® es una marca registrada de VMWare, Inc.
pt_br: VMWare® é uma marca registrada de VMWare, Inc.

source: Windows® is a registered trademark of Microsoft Corporation in the United States and other countries.
es: Windows® es una marca registrada de Microsoft Corporation en los Estados Unidos y otros países.
pt_br: Windows® é uma marca registrada de Microsoft Corporation nos Estados Unidos da América e outros países.

source: **Typographic Conventions**
es: **Convenciones Tipográficas**
pt_br: **Convenções Tipográficas**

source: Names of graphical elements such as buttons, icons, fields, columns, and boxes are enclosed within quotes. For example: click the "Browse Categories" button.
es: Los nombres de elementos gráficos como botones, iconos, campos, columnas y casillas están encerradas en comillas. Por ejemplo: presione el botón "Examinar Categorías".
pt_br: Nomes de elementos gráficos tais como botões, ícones, campos, colunas e caixas estão entre aspas. Por exemplo: acione o botão "Mostre as Categorias".

source: Menu selections are italicized and separated by arrows. For example: :menuselection:`Control Panel --> About`.
es: Las selecciones de menú están en cursivas y separadas por flechas. Por ejemplo: :menuselection:`Panel de Control --> Acerca de`.
pt_br: Seleções de Menu estarão em itálico e separadas por setas. Por examplo: :menuselection:`Painel de Controle --> Sobre`.

source: Commands that are mentioned within text are highlighted in :command:`bold text`. Command examples and command output are contained in green code blocks.
es: Comandos que son mencionados en el texto están indicados en :command:`negritas`. Ejemplos de comandos y salida de los mismos se contienen en bloques de código verdes.
pt_br: Comandos que são mencionadas dentro de textos estão realçados em :command:`negrito`. Exemplos de comandos e saídas de comando estão contidos em blocos de código verde.

source: File names are enclosed in a blue box :file:`/like/this`.
es: Los nombres de archivos están contenidos en una caja azul :file:`/como/aquí`.
pt_br: Nomes de arquivos estão dentro de uma caixa azul :file:`/como/este`.

source: Keystrokes are formatted in a blue box. For example: press :kbd:`Enter`.
es: Las teclas están formateadas en una caja azul. Por ejemplo: presiona :kbd:`Enter`.
pt_br: Teclas são formatadas em uma caixa azul. Por examplo: pressione :kbd:`Entra`.

source: **bold text** is used to emphasize an important point.
es: Las **negritas** son usadas para enfatizar un punto importante.
pt_br: **texto em negrito** é usado para enfatizar um ponto importante.

source: *italic text* is used to represent device names or text that is input into a GUI field.
es: El texto en *cursivas* se usa para representar nombres de dispositivos o texto que es insertado en un campo de la GUI.
pt_br: *texto em itálico* é usado para representar nomes de dispositivos ou um texto que é a entrada em um campo gráfico.

source: Introduction
es: Introducción
pt_br: Introdução

source: Welcome to PC-BSD®!
es: Bienvenido a PC-BSD®!
pt_br: Bem-vindo ao PC-BSD®!

source: `PC-BSD® <http://www.pcbsd.org/>`_ began in 2005 when Kris Moore presented the first beta version of a FreeBSD operating system pre-configured for desktop use. Since then, PC-BSD® has matured into a polished, feature-rich, free-of-charge, open source operating system that meets the desktop or server needs of the beginner to the advanced user alike.
es: `PC-BSD® <http://www.pcbsd.org/>`_ comenzó en 2005 cuando Kris Moore presentó la primera versión beta de un sistema operativo FreeBSD pre-configurado para uso como escritorio. Desde entonces, PC-BSD® ha madurado en un pulido, rico en características, libre de cargos, sistema operativo de código abierto que cubre las necesidades del escritorio o servidor del usuario novato al avanzado sin distinción.
pt_br: O `PC-BSD® <http://www.pcbsd.org/>`_ começou em 2005, quando Kris Moore apresentou a primeira versão beta de um sistema operacional FreeBSD pré-configurado para uso em desktop. Desde então, o PC-BSD® amadureceu para um sistema operacional elegante, rico em recursos, sem custos e de código aberto que atende às necessidades de desktop ou de servidor, desde o usuário iniciante ao avançado da mesma forma.

source: PC-BSD® is essentially a customized installation of FreeBSD, not a forked derivative. Since the underlying FreeBSD system has been kept intact, you have a fully functional FreeBSD system under the hood. PC-BSD® provides a graphical installer which can be used to easily install a desktop or a server version of FreeBSD, known as TrueOS®. Other differences from FreeBSD include:
es: PC-BSD® es esencialmente una instalación personalizada de FreeBSD, no un derivado bifurcado. Dado que el sistema FreeBSD que subyace se ha mantenido intacto, usted tiene un sistema FreeBSD completamente funcional tras bambalinas, PC-BSD® provee un instalador gráfico que puede ser usado para instalar fácilmente una version de escritorio o servidor de FreeBSD, conocido como TrueOS®. Otras diferencias con FreeBSD incluyen:
pt_br: O PC-BSD® é essencialmente uma instalação personalizada do FreeBSD, não uma derivação deste. Uma vez que o sistema base do FreeBSD foi mantido intacto, você tem um sistema FreeBSD totalmente funcional sob o capô. O PC-BSD® fornece um instalador gráfico que pode ser usado para instalar facilmente um desktop ou uma versão servidor do FreeBSD conhecida como TrueOS®. Outras diferenças incluem:

source: PC-BSD® pre-configures at least one desktop environment during a desktop installation. Installed desktop environments appear in the login menu, allowing the user to select which environment to log into.
es: PC-BSD® preconfigura al menos un entorno de escritorio durante la instalación de escritorio. Los entornos de escritorio instalados aparecerán en el menú de inicio de sesión, permitiendo al usuario, seleccionar en qué entorno quiere iniciar sesión.
pt_br: O PC-BSD® pré-configura ao menos um ambiente de trabalho durante uma instalação de desktop. Os ambientes de trabalho instalados aparecem no menu de login, permitindo ao usuário selecionar em qual ambiente efetuar login.

source: The PC-BSD® graphical installer supports additional features such as configuring ZFS and encryption during installation.
es: El instalador gráfico de PC-BSD® soporta características adicionales como configurar ZFS y la encriptación durante la instalación.
pt_br: O instalador gráfico do PC-BSD® suporta recursos adicionais, tais como configurar o ZFS e criptografia durante a instalação.

source: PC-BSD® provides a graphical software management system for the desktop and a command line equivalent for the server.
es: PC-BSD® proporciona un sistema de gestión de software gráfico para el escritorio y un equivalente en linea de comandos para el servidor.
pt_br: O PC-BSD® fornece um sistema de gerenciamento de software gráfico para o desktop e um equivalente em linha de comando para o servidor.

source: PC-BSD® provides a :ref:`Control Panel` of utilities for configuring the system. The graphical versions of these utilities are available on both versions, the desktop and server.
es: PC-BSD® proporciona un :ref:`Panel de Control` de utilerías para configurar el sistema. La versión gráfica de estas utilerías está disponible en las dos versiones, el escritorio y servidor.
pt_br: O PC-BSD® fornece um :ref:`Painel de Controle` com utilitários para a configuração do sistema. As versões gráficas destes utilitários estão disponíveis no desktop, e as versões em linha de comando estão disponíveis em ambos desktop e servidor.

source: PC-BSD® comes pre-configured with a number of automatic scripts to perform tasks such as connecting digital cameras or USB memory sticks.
es: PC-BSD® viene pre-configurado con una cantidad de scripts automatizados que realizan tareas como conectar cámaras digitales o memorias USB.
pt_br: O PC-BSD® vem pré-configurado com um número de scripts automáticos para executar tarefas tais como a conexão de câmeras digitais ou cartões de memória USB.

source: The PC-BSD® boot menu supports boot environments, or snapshots of the operating system, and the PC-BSD® Update Manager automatically adds a new boot environment to the boot menu before updating the operating system or software. This means that if an update fails, you can reboot into the previous version of the operating system, before the update occurred.
es: El menú de arranque de PC-BSD® soporta entornos de arranque, o instantáneas del sistema operativo, y el Administrador de Actualizaciones de PC-BSD® añade automáticamente un nuevo entorno de arranque al menú de arranque antes de actualizar el sistema operativo o software. Esto significa que si una actualización falla, puede reiniciar dentro de una versión previa del sistema operativo, antes de que ocurriera la actualización.
pt_br: O menu de inicialização do PC-BSD® suporta ambientes de inicialização, ou snapshots do sistema operacional, e o Gerenciador de Atualizações do PC-BSD® adiciona automaticamente um novo ambiente de inicialização ao menu de inicialização antes de atualizar o sistema operacional ou software. Isto significa que se uma atualização falhar, você pode reiniciar na versão anterior do sistema operacional existente antes da atualização ocorrida.

source: PC-BSD® started off as an independent project, but since October, 2006 PC-BSD® is financially backed and supported by the enterprise-class hardware solutions provider `iXsystems <https://www.ixsystems.com/>`_.
pt_br: O PC-BSD® começou como um projeto independente, mas desde Outubro de 2006, o PC-BSD® é financeiramente apoiado e suportado pelo fornecedor de soluções de hardware de classe empresarial `iXsystems<https://www.ixsystems.com/>`_.

source: Goals and Features
es: Objetivos y Funcionalidades
pt_br: Objetivos e Recursos

source: PC-BSD® provides the following features:
es: PC-BSD® le proporciona las siguientes características:
pt_br: O PC-BSD® oferece os seguintes recursos:

source: **Easy installation:** to install either a graphical desktop or command-line server version of PC-BSD®, simply insert the installation media, reboot the system to start the installer, and answer a few questions in the installation menus.
es: **Fácil instalación:** para una instalación ya sea versión de escritorio gráfico o servidor en modo texto de PC-BSD®, simplemente inserte el medio de instalación, reinicie el sistema para comenzar el instalador, y responda algunas preguntas en los menús de instalación.
pt_br: **Instalação fácil:** para instalar um desktop gráfico ou uma versão servidor de linha de comando do PC-BSD®, basta inserir a mídia de instalação, reiniciar o sistema para começar o instalador e responder algumas perguntas nos menus de instalação.

source: **Automatically configured hardware:** video, sound, network, and other devices are automatically configured for you.
es: **Hardware configurado automáticamente:** video, sonido, red, y otros dispositivos se configuran automáticamente para usted.
pt_br: **Hardware configurado automaticamente:** vídeo, som, rede e outros dispositivos são configurados automaticamente para você.

source: **Intuitive desktop interface:** PC-BSD® comes with a choice of :ref:`Desktops` to support your day-to-day computing needs.
es: **Interfaz de escritorio intuitiva:** PC-BSD® viene con una variedad de :ref:`Escritorios` para apoyarle en sus necesidades informáticas del día a día.
pt_br: **Interface de ambiente de trabalho intuitiva:** O PC-BSD® oferece uma gama de :ref:`Ambientes de trabalho` para apoiar as suas necessidades diárias de computação.

source: **Easy software management:** with :ref:`AppCafe®`, installing, upgrading, and uninstalling software is safe and easy.
es: **Fácil gestión de software:** con :ref:`AppCafe®`, instalar, actualizar, y desinstalar software es fácil y seguro.
pt_br: **Gerenciamento de programas facilitado:** com o :ref:`AppCafe®`, a instalação, atualização e desinstalação de programas é segura e fácil.

source: **Lots of software available:** in addition to its own software, PC-BSD® can install software that has been ported to FreeBSD (currently over 24,700 applications).
es: **Mucho software disponible:** adicionalmente a su propio software, PC-BSD® puede instalar software que ha sido portado a FreeBSD (actualmente más de 24,700 aplicaciones).
pt_br: **Grande quantidade de programas disponíveis:** em adição aos seus próprios programas, o PC-BSD® pode instalar programas que foram portados para o FreeBSD (atualmente mais de 24.700 aplicações).

source: **Easy to update:** PC-BSD® provides a built-in :ref:`Update Manager` that will notify you of available updates and allow you to apply operating system security fixes, bug fixes, and system enhancements as well as upgrade to newer versions of the operating system or installed software.
es: **Fácil de actualizar:** PC-BSD® provee un :ref:`Administrador de Actualizaciones` pre-instalado que le notificará de actualizaciones disponibles y le permitirá aplicar parches de seguridad, corrección de errores y mejoras al sistema operativo, así como actualizar a nuevas versiones del sistema operativo o software instalado.
pt_br: **Fácil de atualizar:** O PC-BSD® fornece um :ref:`Gerenciador de Atualizações` incorporado que irá notificá-lo das atualizações disponíveis e permite-lhe aplicar as correções de segurança do sistema operacional, correções de bugs e melhorias do sistema, bem como atualizar para versões mais recentes do sistema operacional ou dos programas instalados.

source: **Virus-free:** PC-BSD® is not affected by viruses, spyware, or other malware.
es: **Libre de Virus:** PC-BSD® no es afectado por virus, spyware, u otro malware.
pt_br: **Livre de Vírus:** O PC-BSD® não é afetado por vírus, spywares ou quaisquer outros malwares.
