Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/introduction.po
Languages: es, pt_br

source: **No defragmentation:** PC-BSD® hard drives do not need to be defragmented and do not slow down over time. PC-BSD® uses OpenZFS which is a self-healing filesystem.
es: **Sin defragmentación:** Los discos duros de PC-BSD® no necesitan ser defragmentados y no se alentan con el tiempo. PC-BSD® usa OpenZFS que es un sistema de archivos que se auto repara.
pt_br: **Sem desfragmentação:** Os discos rígidos do PC-BSD® não precisam ser desfragmentados e não ficam lentos ao longo do tempo. O PC-BSD® usa o OpenZFS que é um sistema de arquivos com a função de auto-recuperação.

source: **Laptop support:** provides power saving and swap space encryption and automatically switches between wired and wifi network connections.
es: **Soporte para Portátiles:** proporciona ahorro de energía y encriptación en el espacio de intercambio de memoria, y automáticamente cambia entre conexiones de red alámbricas e inalámbricas.
pt_br: **Suporte a laptops:** proporciona economia de energia, criptografia do espaço de swap e alterna automaticamente entre as conexões de rede com fio e sem fio.

source: **Secure environment:** PC-BSD® provides a pre-configured firewall and a built-in host-based Intrusion Detection System.
es: **Entorno seguro:** PC-BSD® provee un cortafuegos preconfigurado y un Sistema de Detección de Intrusiones incorporado.
pt_br: **Ambiente seguro:** O PC-BSD® fornece um firewall pré-configurado e um sistema de detecção de intrusos integrado do tipo host-based.

source: **Easy system administration:** PC-BSD® provides a :ref:`Control Panel` containing many graphical tools for performing system administration tasks.
es: **Sistema de Administración simplificada:** PC-BSD® proporciona un :ref:`Panel de Control` que contiene herramientas gráficas para realizar tareas de administración del sistema.
pt_br: **Administração facilitada do sistema:** O PC-BSD® fornece um :ref:`Painel de Controle` contendo muitas ferramentas gráficas para executar as tarefas de administração do sistema.

source: **Localization:** PC-BSD® supports a number of native languages and locales.
es: **Localización:** PC-BSD® soporta una variedad de lenguas nativas.
pt_br: **Localização:** O PC-BSD® suporta várias línguas nativas e os seus respectivos locales.

source: **Vibrant community:** PC-BSD® has a friendly and helpful community.
es: **Comunidad vibrante:** PC-BSD® cuenta con una comunidad útil y amistosa.
pt_br: **Comunidade vibrante:** O PC-BSD® tem uma comunidade amigável e prestativa.

source: **Professional support:** professional email and phone support is available from `iXsystems <https://www.ixsystems.com/support/>`_.
es: **Soporte profesional:** Soporte profesional por correo electrónico y por teléfono está disponible a cargo de `iXsystems <https://www.ixsystems.com/support/>`_.
pt_br: **Suporte profissional:** suporte profissional por e-mail e por telefone está disponível pela empresa `iXsystems <https://www.ixsystems.com/support/>`_.

source: What's New in |version|
es: Lo Nuevo En |version|
pt_br: O que há de novo na |version|

source: The following features or enhancements were introduced for PC-BSD® |version|:
es: Las siguientes características y mejoras fueron introducidas para PC-BSD® |version|:
pt_br: Os seguintes recursos ou melhorias foram introduzidos no PC-BSD® |version|:

source: Based on FreeBSD 10.2 which adds these `features <https://www.freebsd.org/releases/10.2R/relnotes.html>`_.
pt_br: Baseado no FreeBSD 10.2, o que acrescenta estas `características <https://www.freebsd.org/releases/10.2R/relnotes.html>`_.

source: CD-sized network installers are available for both the graphical and text installers. The installation looks the same for both, with the difference being the size of the downloaded media and the fact that the installation files are retrieved over the network rather than from the installation media.
pt_br: Instaladores de rede do tamanho de um CD estão disponíveis para ambos os instaladores gráfico e de texto. A instalação parece a mesma para ambos, com a diferença de que o tamanho da mídia baixada e o fato de que os arquivos de instalação são carregados através da rede, ao invés da mídia de instalação.

source: Lumina has been updated to `0.8.6 <http://blog.pcbsd.org/2015/08/lumina-desktop-0-8-6-released/>`_.
pt_br: O Lumina foi atualizado para `0.8.6 <http://blog.pcbsd.org/2015/08/lumina-desktop-0-8-6-released/>`_.

source: `iocage <https://github.com/iocage/iocage>`_ has replaced Warden as the back-end for jail management in :ref:`AppCafe®` and the "Warden" tab has been renamed to "Plugins". The Warden graphical utility has been removed from Control Panel and the command line usage docs have been changed to describe how to use the :command:`iocage` command line utility.
pt_br: O `iocage <https://github.com/iocage/iocage>`_ substituiu o Warden como o back-end para gerenciamento do jail no :ref:`AppCafe®` e a guia " Warden" foi renomeada para "Plugins". O utilitário gráfico do Warden foi removido do Painel de Controle e os documentos para uso na linha de comando foram alterados para descrever como usar o utilitário de linha de comando :command:`iocage`.

source: The default Serif/Sans Serif font is now `Noto <http://www.google.com/get/noto/>`_ instead of Dejavu.
pt_br: A fonte Serif/Sans Serif padrão agora é `Noto <http://www.google.com/get/noto/>`_ ao invés de Dejavu.

source: The graphical installer now uses the `Droid <http://www.droidfonts.com/>`_ font.
pt_br: O instalador gráfico agora usa a fonte `Droid <http://www.droidfonts.com/>`_ .

source: The installer now supports installing to free space. This means that you no longer need to temporarily format a partition after shrinking a drive when installing PC-BSD® in a dual-boot scenario.
pt_br: O instalador agora suporta a instalação em espaço livre. Isso significa que você não precisa mais formatar uma partição temporária, após a redução do espaço de uma unidade ao instalar o PC-BSD® em um cenário de dual-boot.

source: The graphical installer now provides a shortcut to :ref:`Disk Manager`.
pt_br: O instalador gráfico agora oferece um atalho para o :ref:`Disk Manager`.

source: Wine has been removed from the installer but can be installed afterwards using :ref:`AppCafe®`.
pt_br: O Wine foi removido do instalador, mas pode ser instalado mais tarde usando o :ref:`AppCafe®`.

source: The "Domain Name" field has been added to the :ref:`Time Zone Selection Screen`.
pt_br: O campo "Nome de Domínio" foi adicionado à :ref:`Time Zone Selection Screen`.

source: The "Enable Optional Services" screen has been added to the post-configuration wizard. Currently, this screen allows you to enable the SSH service or to disable IPv6.
pt_br: A tela "Ativar Serviços Opcionais" foi adicionada ao assistente de pós-configuração. Atualmente, esta tela permite ativar o serviço SSH ou desativar o IPv6.

source: The "Tile Plugins" and "Cascade Plugins" entries have been added to the right-click menu of Lumina.
pt_br: As entradas de "Plugins lado a lado" e "Plugins em cascata" foram adicionadas ao menu do botão direito do Lumina.

source: You can now create and manage more than two panels using the Lumina configuration utility.
pt_br: Agora você pode criar e gerenciar mais de dois painéis usando o utilitário de configuração do Lumina.

source: The "Save Pkg List" option has been added to the "Configure" button of :ref:`AppCafe®`.
pt_br: A opção "Salvar Lista Pkg" foi adicionada ao botão "Configurar" do :ref:`AppCafe®`.

source: The "Enterprise (Long Term Support)" repository has been added to :menuselection:`AppCafe® --> Configure --> Repository Configuration`. This option is meant for enterprise users that wish to only receive software updates which fix known security vulnerabilities.
pt_br: O repositório "Corporativo (Suporte a Longo Prazo)" foi adicionado em :menuselection:`AppCafe® --> Configurar --> Configuração de Repositório`. Esta opção é destinada a usuários corporativos que desejam receber apenas atualizações de software que corrigem vulnerabilidades de segurança conhecidas.

source: If you install or uninstall any software in AppCafe®, a "Status" tab will appear so that you can review the installation log.
pt_br: Se você instalar ou desinstalar qualquer software no AppCafe®, uma guia "Status" será exibida para que você possa rever o registo de instalação.

source: The :menuselection:`System --> Branches` menu has been added to :ref:`Update Manager`. This can be used to change which software branch is used to track updates.
pt_br: O menu :menuselection:`Sistema --> Ramos` foi adicionado ao :ref:`Gerenciador de Atualizações`. Isto pode ser usado para alterar em qual ramo de software ocorrerá o rastreamento das atualizações.

source: The **showeol** option has been added to :command:`pc-updatemanager`.
pt_br: A opção **showeol** foi adicionada ao :command:`pc-updatemanager`.

source: The "Allow Valid Users with UID under 1000" checkbox and "Additional Excluded Users" field have been added to :menuselection:`Control Panel --> Login Manager --> Misc`.
pt_br: A caixa de seleção "Somente Usuários Válidos com UID abaixo de 1000" e o campo "Usuários Adicionais Excluídos" foram adicionados em :menuselection:`Painel de Controle --> Gerenciador de Login --> Misc`.

source: The **probe-netdrives**, **list-mountednetdrives**, **mountnet**, and **unmountnet** options have been added to :ref:`pc-sysconfig`.
pt_br: As opções **probe-netdrives**, **list-mountednetdrives**, **mountnet** e **unmountnet** foram adicionadas ao :ref:`pc-sysconfig`.

source: The "Domain Name" field has been added to :menuselection:`Control Panel --> Network Configuration --> Network Configuration (Advanced)`.
pt_br: O campo "Nome de Domínio" ao :menuselection:`Painel de Controle --> Configuração de Rede --> Configuração de Rede (Avançado)`.

source: The "Replication Server" screen has been removed from the :ref:`Life Preserver` initial configuration wizard and an option has been added to the last screen of the wizard offering to open the advanced configuration options so that replication can be configured.
pt_br: A tela "Servidor de Replicação" foi removida do assistente de configuração inicial :ref:`Life Preserver` e uma opção foi adicionada à última tela do assistente, oferecendo para abrir as opções avançadas de configuração para que a replicação possa ser configurada.

source: Life Preserver's "Local Snapshots" tab now allows you to create a list of datasets to exclude when creating snapshots.
pt_br: A aba "Snapshots Locais" do Life Preserver agora permite que você crie uma lista de datasets para excluir ao criar snapshots.

source: Life Preserver's "Replication" tab now allows you to create a list of datasets to exclude when replicating to the remote server.
pt_br: A aba "replicação" do Life Preserver agora permite que você crie um dataset para excluir ao replicar para o servidor remoto.

source: The "Reset Replication Password" option has been added to the :menuselection:`Life Preserver --> Snapshots` menu.
pt_br: A opção "Reset da Senha de Replicação" foi adicionada ao menu :menuselection:`Life Preserver --> Snapshots`.

source: PC-BSD® for Linux Users
es: PC-BSD® para Usuarios de Linux
pt_br: PC-BSD® para Usuários Linux

source: PC-BSD® is based on FreeBSD, meaning that it is not a Linux distribution. If you have used Linux before, you will find that some features that you are used to have different names on a BSD system and that some commands are different. This section covers some of these differences.
es: PC-BSD® está basado en FreeBSD, esto significa que no es una distribución Linux. Si usted ha usado Linux antes, encontrará que algunas características a las que está acostumbrado, tienen diferentes nombres en un sistema BSD y que algunos comandos son diferentes. Esta sección cubre algunas de estas diferencias.
pt_br: O PC-BSD® é baseado no FreeBSD, o que significa que ele não é uma distribuição Linux. Se você já usou o Linux antes, você vai descobrir que alguns recursos que você está acostumado terão nomes diferentes em um sistema BSD e que alguns comandos são diferentes. Esta seção aborda algumas destas diferenças.

source: BSD and Linux use different filesystems during installation. Many Linux distros use EXT2, EXT3, EXT4, or ReiserFS, while PC-BSD® uses OpenZFS. This means that if you wish to dual-boot with Linux or access data on an external drive that has been formatted with another filesystem, you will want to do a bit of research first to see if the data will be accessible to both operating systems.
es: BSD y Linux usan diferentes sistemas de archivos durante la instalación. Muchas distribuciones Linux usan EXT2, EXT3, EXT4, o ReiserFS, mientras que PC-BSD® usa OpenZFS. Esto significa que si usted quiere un arranque dual con Linux o accesar datos en un disco externo que ha sido formateado con otro sistema de archivos, usted necesitará hacer algo de investigación para saber si los datos serán accesibles en los dos sistemas operativos.
pt_br: O BSD e o Linux usam diferentes sistemas de arquivos durante a instalação. Muitas distribuições Linux usam EXT2, EXT3, EXT4 ou ReiserFS, enquanto o PC-BSD® usa o OpenZFS. Isto significa que se você quiser ter dual-boot com Linux ou acesso a dados em uma unidade externa que tenha sido formatada com outro sistema de arquivos, você vai querer fazer um pouco de pesquisa primeiro para ver se os dados serão acessíveis a ambos os sistemas operacionais.

source: Table 1.3a summarizes the various filesystems commonly used by desktop systems. Most of the desktop managers available from PC-BSD® should automatically mount the following filesystems: FAT16, FAT32, EXT2, EXT3 (without journaling), EXT4 (read-only), NTFS5, NTFS6, and XFS. See the section on :ref:`Files and File Sharing` for more information about available file manager utilities.
es: La Tabla 1.3a comprende los diferentes sistemas de archivos comúnmente usados por los sistemas de escritorio. La mayoría de los gestores de escritorio disponibles para PC-BSD® deberían montar automáticamente los siguientes sistemas de archivo: FAT16, FAT32, EXT2, EXT3 (sin journaling), EXT4 (solo lectura), NTFS5, NTFS6, y XFS. Vea la sección de :ref:`Archivos y Compartición de Archivos` para más información acerca de utilerías disponibles para la gestión de archivos.
pt_br: A Tabela 1.3a resume os vários sistemas de arquivos comumente usados por sistemas de desktop. A maioria dos gerenciadores de desktop disponíveis no PC-BSD® deve montar automaticamente os seguintes sistemas de arquivos: FAT16, FAT32, EXT2, EXT3 (sem journaling), EXT4 (somente leitura), NTFS5, NTFS6, e XFS. Veja a seção :ref:`Arquivos e Compartilhamento de Arquivos` para obter mais informações sobre os utilitários de gerenciamento de arquivos disponíveis.

source: **Table 1.3a: Filesystem Support on PC-BSD®**
es: **Tabla 1.3a: Soporte para Sistemas de Archivo en PC-BSD®**
pt_br: **Tabela 1.3a: Suporte a Sistemas de Arquivo no PC-BSD®**

source: Filesystem
es: Sistema de Archivos
pt_br: Sistema de Arquivo

source: Native to
es: Nativo en
pt_br: Nativo de

source: Type of non-native support
es: Tipo de soporte no nativo
pt_br: Tipo de suporte não-nativo

source: **Usage notes**
es: **Notas de uso**
pt_br: **Notas de uso**

source: none
es: Ninguno
pt_br: nenhum

source: requires a license from Microsoft
es: Requiere una licencia de Microsoft
pt_br: requer uma licença da Microsoft

source: r/w support loaded by default
es: Soporte de lectura/escritura predeterminado
pt_br: suporte a leitura/escrita carregada por padrão

source: since EXT3 journaling is not supported, you will not be able to mount a filesystem requiring a journal replay unless you :command:`fsck` it using an external utility such as `e2fsprogs <http://e2fsprogs.sourceforge.net>`_
es: Dado que el journaling en EXT3 no está soportado, usted no será capaz de montar un sistema de archivos que requiera una reproducción del journal a menos que haga :command:`fsck` usando una utilería externa como `e2fsprogs <http://e2fsprogs.sourceforge.net>`_
pt_br: uma vez que o journaling no EXT3 não é suportado, você não será capaz de mountar um sistema de arquivos exigindo uma reescrita, a menos que, você execute o comando :command:`fsck` usando um utilitário externo como o `e2fsprogs <http://e2fsprogs.sourceforge.net>`_

source: r/o support loaded by default
es: Soporte de solo lectura predeterminado
pt_br: suporte somente a leitura carregada por padrão.

source: EXT3 journaling, extended attributes, and inodes greater than 128 bytes are not supported; EXT3 filesystems converted to EXT4 may have better performance
es: El journaling en EXT3, atributos extendidos, e inodos mayores a 128 bytes no están soportados; sistemas de archivos EXT3 convertidos a EXT4 deben tener mejor desempeño
pt_br: Journaling EXT3, atributos estendidos e inodes maiores do que 128 bytes não são suportados; sistemas de arquivos EXT3 convertidos para EXT4 podem ter um melhor desempenho

source: older Mac versions might work with `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_
es: Las versiones anteriores de Mac deberían trabajar mejor con `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_
pt_br: versões anteriores do Mac podem trabalhar com `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_

source: full r/w support loaded by default
es: Soporte completo de lectura/escritura predeterminado
pt_br: suporte total a leitura e escrita carregado por padrão

source: r/o support is loaded by default
es: Soporte de solo lectura predeterminado
pt_br: suporte somente para leitura e escrita carregado por padrão

source: check if your Linux distro provides ufsutils; r/w support on Mac; UFS Explorer can be used on Windows
es: Asegúrese que su distribución Linux proporcione ufsutils; soporte de lectura/escritura en Mac; UFS Explorer puede usarse en Windows
pt_br: verifique se a sua distro Linux fornece ufsutils; suporte a leitura e escrita no Mac; UFS Explorer pode ser usado no Windows

source: changed to r/o support in Mac Lion
es: Cambiado a soporte de solo lectura en Mac Lion
pt_br: alterado para suporte somente leitura no Mac Lion

source: Linux and BSD use different naming conventions for devices. For example:
es: Linux y BSD usan diferentes convenciones al nombrar dispositivos. Por ejemplo:
pt_br: Linux e BSD usam diferentes convenções para nomes de dispositivos. Por exemplo:

source: in Linux, Ethernet interfaces begin with :file:`eth`; in BSD, interface names indicate the name of the driver. For example, an Ethernet interface may be listed as :file:`re0`, indicating that it uses the Realtek :file:`re` driver. The advantage of this convention is that you can read the **man 4** page for the driver (e.g. type :command:`man 4 re`) to see which models and features are provided by that driver.
es: En Linux, las interfaces Ethernet comienzan con :file:`eth`; en BSD, los nombres de las interfaces indican el nombre del controlador. Por ejemplo, una interfaz Ethernet puede listarse como :file:`re0`, indicando que usa el controlador Realtek :file:`re`. La ventaja de esta convención es que puede leer la página **man 4** del controlador (por ejemplo, teclee :command:`man 4 re`) para ver cuáles modelos y características se proporcionan con ese controlador.
pt_br: no Linux, interfaces de rede começam com :file:`eth`; no BSD, nomes de interfaces indicam o nome do driver. Por exemplo, uma interface de rede pode ser listada como :file:`re0`, indicando que usa um driver Realtek :file:`re`. A vantagem desta convenção é que você pode ler a página **man 4** do driver (ou seja, digite :command:`man 4 re`) para ver quais modelos e funcionalidades são fornecidas pelo driver.

source: BSD disk names differ from Linux. IDE drives begin with :file:`ad` and SCSI and USB drives begin with :file:`da`.
es: Los nombres de discos en BSD son diferentes a Linux. Discos IDE comienzan con :file:`ad` y los discos SCSI y USB comienzan con :file:`da`.
pt_br: Nomes de disco no BSD são diferentes do Linux. Dispositivos IDE começam com :file:`ad` e dispositivos SCSI e USB começam com :file:`da`.

source: Some of the features used by BSD have similar counterparts to Linux, but the name of the feature is different. Table 1.3b provides some common examples:
es: Algunas de las características usadas por BSD tienen una contraparte similar en Linux, pero el nombre de la característica es diferente. La Tabla 1.3b proporciona algunos ejemplos comunes:
pt_br: Algumas das funcionalidades usadas pelo BSD tem similaridades correspondentes ao Linux, mas o nome da funcionalidade é diferente. A tabela 1.3b fornece alguns exemplos comuns:

source: **Table 1.3b: Names for BSD and Linux Features**
es: **Tabla 1.3b: Nombres para Características de BSD y Linux**
pt_br: **Tabela 1.3b: Nomes para características BSD e Linux**

source: **Description**
es: **Descripción**
pt_br: **Descrição**

source: default firewall
es: Cortafuegos predeterminado
pt_br: firewall padrão

source: :file:`/etc/rc.d/` for operating system and :file:`/usr/local/etc/rc.d/` for applications
es: :file:`/etc/rc.d/` para el sistema operativo y :file:`/usr/local/etc/rc.d/` para aplicaciones
pt_br: :file:`/etc/rc.d/` para o sistema operacional e :file:`/usr/local/etc/rc.d/` para aplicações

source: in PC-BSD the directories containing the startup scripts do not link to runlevels as there are no runlevels; system startup scripts are separated from third-party application scripts
es: En PC-BSD los directorios que contienen los scripts de arranque no apuntan a niveles de corrida ya que no los hay; los scripts de arranque del sistema se separan de los scripts de aplicaciones de terceros
pt_br: no PC-BSD os diretórios contendo os scripts de inicialização não são ligados a níveis de execução, assim como não há os usuais níveis de execução; scripts de inicialização do sistema são separados dos scripts de aplicação de terceiros

source: :file:`/etc/ttys` and :file:`/etc/rc.conf`
es: :file:`/etc/ttys` y :file:`/etc/rc.conf`
pt_br: :file:`/etc/ttys` e :file:`/etc/rc.conf`

source: terminals are configured in *ttys* and *rc.conf* indicates which services will start at boot time
es: Las terminales se configuran en *ttys* y *rc.conf* indica qué servicios se arrancaran al inicio
pt_br: terminais são configurados em *ttys* e *rc.conf* indica quais serviços irão iniciar na inicialização do sistema

source: **Table 1.3c: Common BSD and Linux Commands**
es: **Table 1.3c: Comandos Comunes en BSD y Linux**
pt_br: **Tabela 1.3c: Comandos comuns no BSD e Linux**

source: Command
es: Comando
pt_br: Comando

source: **Used to:**
es: **Usado para:**
pt_br: **Usado para:**

source: discover what hardware was detected by the kernel
es: Encontrar qué hardware fue detectado por el kernel
pt_br: descobrir qual hardware foi detectado pelo kernel

source: display configured devices
es: Muestra dispositivos configurados
pt_br: mostra dispositivos configurados

source: If you are comfortable with the command line, you may find that some of the commands that you are used to have different names on BSD. Table 1.3c lists some common commands and what they are used for.
es: Si usted se siente cómodo con la línea de comandos, encontrará que algunos de los comandos a los que está acostumbrado, tienen diferentes nombres en BSD. La Tabla 1.3c lista comandos comunes y para qué se usan.

source: show PCI devices
es: Muestra dispositivos PCI

source: show USB devices
es: Muestra dispositivos USB

source: list all modules loaded in the kernel
es: Lista todos los módulos cargados en el kernel

source: :command:`kldload <module>`
es: :command:`kldload <modulo>`

source: load a kernel module for the current session
es: Cargar un módulo del kernel para la sesión activa

source: :command:`pbi_add -r <pbiname>`
es: :command:`pbi_add -r <nombredelpbi>`
