Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/introduction.po
Languages: es, pt_br

source: install software from the command line
es: Instalar software desde la línea de comandos

source: display hardware memory
es: Mostrar la memoria del harware

source: display CPU model
es: Mostrar modelo del CPU

source: display CPU Architecture
es: Muestra la arquitectura del CPU

source: display number of CPUs
es: Muestra el número de CPUs

source: get release version information
es: Muestra información de la versión

source: show device partition information
es: Muestra la información de las particiones

source: list IDs of all processes that have one or more files open
es: Lista los IDs de todos los procesos que tienen uno o más archivos abiertos

source: The following articles and videos provide additional information about some of the differences between BSD and Linux:
es: Los siguientes artículos y videos proporcionan información adicional sobre algunas de las diferencias entre BSD y Linux:

source: `Interview: BSD for Human Beings <http://www.unixmen.com/bsd-for-human-beings-interview/>`_
es: `Entrevista: BSD for Human Beings <http://www.unixmen.com/bsd-for-human-beings-interview/>`_
