Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/postinstall.po
Languages: es

source: Post Installation Configuration and Installation Troubleshooting
es: Configuración Post Instalación y Solución de Problemas en la Instalación

source: Once the PC-BSD® system has finished booting for the first time, the installer will present you with some additional screens so that you can configure your system. This section describes the boot process, the post-installation configuration screens, and provides some troubleshooting tips for failed installations.
es: Una vez que el sistema PC-BSD® ha terminado de arrancar por primera vez, el instalador le presentará algunas pantallas adicionales para que pueda configurar su sistema. Esta sección describe el proceso de arranque, las pantallas de configuración post-instalación, y proporciona algunos tips de solución de problemas para instalaciónes con problemas.

source: Booting Into PC-BSD®
es: Arrancando en PC-BSD®

source: After installation, PC-BSD® will reboot and you will be prompted to configure your system and to login to a desktop.
es: Después de la instalación, PC-BSD® se reiniciará y se le pedirá configurar su sistema e iniciar sesión en el escritorio.

source: Once the first boot is complete, the installer will attempt to set the optimal display settings. A pop-up menu will ask if you would like to accept these settings. Simply click "Yes" to continue. PC-BSD® will then proceed to the :ref:`Language Screen`.
es: Una vez que el primer arranque se complete, el instalador intentará aplicar las configuraciones óptimas de la pantalla. Un menú desplegable le preguntará si quiere aceptar esas configuraciones. Simplemente presione "Sí" para continuar. PC-BSD® procederá entonces a la :ref:`Pantalla de Idioma`.

source: Read through the rest of this section if you have encrypted your disk(s), your system hangs at boot time, or if you have problems setting the display settings. If you are dual booting and your other operating system was not automatically added to the graphical boot menu by the installer, refer to :ref:`Dual Booting`.
es: Lea a través del resto de esta sección si usted ha encriptado su(s) disco(s), su sistema se cuelga al momento de arrancar, o si tiene problemas aplicando las configuraciones de la pantalla. Si usted está haciendo arranque dual y su otro sistema operativo no se añadió automáticamente al menú de arranque gráfico por el instalador, refiérase a :ref:`Arranque Dual`.

source: If you Encrypted Your Disks
es: Si Encriptó Sus Discos

source: If you selected the "Encrypt disk with GELI" checkbox during installation, you will need physical access to the PC-BSD® system when it boots. As the system starts to boot, it will display a message similar to the one shown in :numref:`Figure %s: Input Password to Decrypt Master Key <encrypt1>`.
es: Si seleccionó la casilla "Encriptar disco con GELI" durante la instalación, necesitará acceso físico al sistema PC-BSD® cuando arranque. Mientras el sistema comienza a arrancar, desplegará un mensaje similar al mostrado en la :numref:`Figura %s: Ingresando la Contraseña para Desencriptar la Llave Maestra <encrypt1>`.

source: The boot process will wait for you to successfully input the password that you created in the installation screen shown in Figure 3.3g. If the correct password is typed in, the system will continue to boot.
es: El proceso de arranque esperará a que usted ingrese correctamente la contraseña que creó en la pantalla de instalación mostrada en la figura anterior. Si se ingresa la contraseña correcta, el sistema continuará el arranque.

source: Interrupting the Boot to Access the Boot Menu
es: Interrumpiendo el Arranque para Accesar el Menú de Arranque

source: By default, the graphical PC-BSD® bootloader menu shown in :numref:`Figure %s: PC-BSD® Graphical Boot Menu <boot1>` is not displayed at first boot.
es: Por defecto, el menú del gestor de arranque gráfico de PC-BSD® mostrado en la :numref:`Figura %s: Menú de Arranque Gráfico de PC-BSD® <boot1>` no se muestra en el primer arranque.

source: The boot menu is used to display the installation of PC-BSD®, any boot environments, and other operating systems installed on a dual-boot system.
es: El menú de arranque se usa para desplegar la instalación de PC-BSD®, cualquier entorno de arranque, y otros sistemas operativos instalados en un sistema de arranque dual.

source: To access this menu, you have to be quick. As soon as the boot process starts and you see a "GRUB loading" message in the upper left corner, press the left :kbd:`Shift` button. After the system boots, you can increase the timer value in :ref:`Boot Manager` if you find that the boot delay is too quick.
es: Para accesar este menú, usted debe ser rápido. Tan pronto como el proceso de arranque comience y vea el mensaje de "GRUB loading" en la esquina superior izquierda, presione la tecla :kbd:`Shift` izquierda. Después que el sistema arranque, puede aumentar el valor del conteo en el :ref:`Administrador de Arranque` si piensa que la espera para el arranque es muy corta.

source: Once you access the graphical menu, it will pause for a few seconds then continue to boot PC-BSD®. If you wish to select a different operating system or specify how PC-BSD® boots, press a key to pause this screen. If multiple operating systems are available and you want to boot into PC-BSD®, make sure it is highlighted and press enter. This will load the PC-BSD® boot options screen shown in :numref:`Figure %s: PC-BSD® Graphical Boot Menu Options <boot2>`.
es: Una vez que accese el menú gráfico, se pausará por unos segundos y continuará el arranque de PC-BSD®. Si quiere seleccionar un sistema operativo diferente o especificar cómo arranca PC-BSD®, presione cualquier tecla para pausar la pantalla. Si están disponibles múltiples sistemas operativos y quiere arrancar en PC-BSD®, asegúrese que esté seleccionado y presione enter. Esto cargará la pantalla de las opciones de arranque de PC-BSD® mostrada en la :numref:`Figura %s: Opciones del Menú de Arranque Gráfico de PC-BSD® <boot2>`.

source: The following boot options are available:
es: Las siguientes opciones de arranque están disponibles:

source: **Normal Bootup:** continues to boot PC-BSD®.
es: **Normal Bootup:** Continúa cargando PC-BSD®.

source: **Single User Mode:** advanced users can select this option to fix critical system failures.
es: **Single User Mode:** Los usuarios avanzados pueden seleccionar esta opción para arreglar fallas críticas del sistema.

source: **Verbose Mode:** select this option if you would like to see more detailed messages during the boot process. This can be useful if you are troubleshooting a piece of hardware.
es: **Verbose Mode:** Seleccione esta opción si quiere ver mensajes más detallados durante el proceso de arranque. Esto puede ser útil si está resolviendo errores de una pieza de hardware.

source: **Run the Display Wizard:** if you are unable to access the GUI due to a display setting, enable this option to boot into the display settings wizard.
es: **Run the Display Wizard:** Si no puede accesar en la GUI debido a una configuración de la pantalla, habilite esta opción para arrancar en el asistente de configuración de la pantalla.

source: **Run X in vesa mode:** try this option if the screen goes black or the system freezes when booting into PC-BSD®.
es: **Run X in vesa mode:** Intente con esta opción si su pantalla se pone en negro o si el sistema se congela cuando arranca PC-BSD®.

source: Use the arrow keys to select an option then press enter to boot using that option.
es: Use las teclas de flecha para seleccionar una opción y presione Intro para arrancar usando esa opción.

source: This menu is provided by GRUB. If you are familiar with editing GRUB, you can press :kbd:`e` to access the GRUB editor or :kbd:`c` to access the GRUB command line.
es: Este menú es desplegado por GRUB. Si está familiarizado editando GRUB, puede presionar :kbd:`e` para accesar el editor de GRUB o :kbd:`c` para accesar la línea de comandos de GRUB.

source: If Your Display is Not Automatically Detected
es: Si Su Pantalla No es Detectada Automáticamente

source: If the optimal display settings can not be determined during first boot, if you select "No"in the "Confirm Resolution" screen when asked to confirm the display settings, or if you select "Run the Display Wizard" from the boot menu, the "Display Settings" screen shown in :numref:`Figure %s: Display Settings Wizard <display1>` will launch.
es: Si las configuraciones de pantalla óptimas no se pueden determinar durante el primer arranque, si usted seleccionó "No" en la pantalla de "Confirmar Resolución" cuando se le pidió confirmar las configuraciones de la pantalla, o si seleccionó "Lanzar el Asistente de Pantalla" desde el menú de arranque, la pantalla de "Configuraciones de Pantalla" mostrada en la :numref:`Figura %s: Asistente de Configuraciones de Pantalla <display1>` se lanzará.

source: The settings in this screen are described in more detail in :ref:`Display`. If you wish to return to this display wizard at a later time, go to :menuselection:`Control Panel --> Display`.
es: Las configuraciones en esta pantalla se describen con más detalle en :ref:`Pantalla`. Si quiere regresar a este asistente de pantalla en el futuro, vaya a :menuselection:`Panel de Control --> Pantalla`.

source: If you change any display settings, click the "Apply" button for the settings to be tested. If anything goes wrong during testing, you will be taken back to the "Display Settings" screen so that you can try another setting. Once you are happy with the tested setting, click the "Yes" button to save the setting and to proceed.
es: Si cambia cualquier configuración de la pantalla, presione el botón "Aplicar" para probar las configuraciones. Si algo va mal durante la prueba, se le llevará de vuelta a la pantalla de "Configuración de Pantalla" para que pueda probar otra configuración. Una vez que esté conforme con la configuración probada, presione el botón "Sí" para guardar la configuración y proceder.

source: Language Screen
es: Pantalla de Idioma

source: The language selection screen is seen in :numref:`Figure %s: Language Selection Screen <config1>`.
es: La pantalla de selección de idioma se muestra en la :numref:`Figura %s: Pantalla de Selección de Idioma <config1>`.

source: This allows you to select the language you will use to access the installed system.
es: Esto le permite seleccionar el idioma que usará para accesar el sistema instalado.

source: Once you have made your selection from the drop-down menu, click "Next" to go to the next configuration screen.
es: Una vez que ha realizado su selección desde el menú desplegable, presione "Siguiente" para ir a la siguiente pantalla de configuración.

source: Time Zone Selection Screen
es: Pantalla de Selección de Zona Horaria

source: The next configuration screen, shown in :numref:`Figure %s: Select Time Zone <config2a>`, allows you to select your timezone.
es: La siguiente pantalla de configuración, mostrada en la :numref:`Figura %s: Seleccionar Zona Horaria <config2a>`, le permite seleccionar su zona horaria.

source: Use the drop-down menu to select the city closest to your location. If the system is connected to the Internet, the installer will most likely have the correct timezone already selected.
es: Use el menú desplegable para seleccionar la ciudad más cercana a su ubicación actual. Si el sistema está conectado a Internet, el instalador tendrá casi siempre seleccionada la zona horaria ya seleccionada.

source: If the system is dual booting and the other operating system expects the BIOS to use UTC, also check the box "Set BIOS to UTC time".
es: Si el sistema es de arranque dual y el otro sistema operativo espera que la BIOS use UTC, también seleccione la casilla "Poner BIOS en tiempo UTC".

source: A default system hostname will be created for you. If you wish to change the default, type in the desired hostname in the "System Hostname" field. If the computer is a member of a DNS domain, you can also input the "Domain Name".
es: Un nombre de equipo predeterminado será creado para usted. Si quiere cambiarlo, ingrese el nombre de equipo deseado en el campo "Nombre de Equipo del Sistema". Si la computadora es un miembro de un dominio DNS, puede también ingresar el "Nombre de Dominio".

source: When finished, click "Next" to proceed to the next screen.
es: Cuando termine, presione "Siguiente" para proceder con la pantalla siguiente.

source: Set Root Password Screen
es: Pantalla para Establecer Contraseña de Administrador

source: This configuration screen, seen in :numref:`Figure %s: Set Root Password <config3>`, requires you to set the root password.
es: Esta pantalla de configuración, mostrada en la :numref:`Figura %s: Establecer Contraseña de Root <config3>`, requiere que usted establezca la contraseña de root.

source: The password must be a minimum of 4 characters and you are required to type it in twice to confirm the password. Click the "Next" button when you are finished.
es: La contraseña debe ser de al menos 4 caracteres y requiere que usted la escriba dos veces para confirmarla. Presione el botón "Siguiente" cuando termine.

source: Create a User Screen
es: Pantalla Crear Usuario

source: This screen is used to create the primary user account that will be used to login to the system. Set a good value for the password as it is used whenever the system indicates that administrative access is required.
es: Esta pantalla se usa para crear la cuenta del usuario primario que será usada para accesar al sistema. Establezca un buen valor para la contraseña ya que se usará cada que el sistema indique que el acceso de administrador es requerido.

source: :numref:`Figure %s: User Creation Screen <config4>` shows the configuration screen used to create the initial user account.
es: La :numref:`Figura %s: Pantalla de Creación de Usuarios <config4>` muestra la pantalla de configuración usada para crear la cuenta de usuario inicial.

source: The "User Details" tab is used to create a login user. This screen requires you to complete the following fields:
es: La pestaña "Detalles del Usuario" se usa para crear el acceso del usuario. Esta pantalla requiere que complete los siguientes campos:

source: **Name:** this value will be displayed in the login screen. It can be your full name and can contain capital letters and spaces.
es: **Nombre:** Este valor se desplegará en la pantalla de acceso. Puede ser su nombre completo y puede contener mayúsculas y espacios.

source: **Username:** this is the name you will use when logging in. It can not contain spaces and is case sensitive (e.g. *Kris* is a different username than *kris*).
es: **Nombre de Usuario:** Este es el nombre que usted usará cuando accese. No puede contener espacios y es sensible a mayúsculas (por ejemplo *Kris* es un nombre de usuario diferente a *kris*).

source: **Password:** this is the password you will use when logging in. You must type it twice in order to confirm it.
es: **Contraseña:** Esta es la contraseña que usará para accesar. Debe escribirla dos veces para poder confirmarla.

source: **Specify UID:** by default, the user will be assigned the next available User ID (UID). If you need to force a specific UID, you can set it here. Note that you cannot set a UID lower than 1001 or specify a UID that is already in use by another user account.
es: **Especificar UID:** por defecto, al usuario se le asignará el siguiente ID de usuario (UID) disponible. Si necesita forzar un UID específico, puede ponerlo aquí. Note que no puede poner un UID menor a 1001 o especificar un UID que ya está siendo usado por otra cuenta de usuario.

source: PC-BSD® provides the ability to use a removable device, such as a USB stick, as the user's encrypted home directory. This is useful in a multi-user or multi-computer environment as it provides the user with secure access to their encrypted files. When a user is configured to use :ref:`PersonaCrypt`, their username will only appear in the login menu if the removable media associated with that PC-BSD® system is inserted and they must input the password associated with the removable device in order to login.
es: PC-BSD® proporciona la habilidad de usar un dispositivo removible, como una memoria USB, como el directorio personal encriptado. Esto es útil en un ambiente multi-usuario o multi-computadora ya que proporciona al usuario acceso seguro a sus archivos encriptados. Cuando un usuario es configurado para usar :ref:`PersonaCrypt`, su usuario solo aparecerá en el menú de acceso si el medio removible asociado con ese sistema PC-BSD® es insertado y debe ingresar la contraseña asociada con el dispositivo removible para poder accesar.

source: The "PersonaCrypt" tab, shown in :numref:`Figure %s: Initializing PersonaCrypt for this User <persona1>`, is used to initialize PersonaCrypt for the user.
es: La pestaña "PersonaCrypt", mostrada en la :numref:`Figura %s: Inicializando PersonaCrypt para este Usuario <persona1>`, se usa para inicializar PersonaCrypt para el usuario.

source: Check the box "Initialize PersonaCrypt Device", insert a removable media that is large enough to hold the files you plan to store in your home directory, and click the "Select" button.
es: Seleccione la casilla "Inicializar Dispositivo PersonaCrypt", inserte el medio removible que sea tan grande como para alojar los archivos que piense almacenar en su directorio personal, y presione el botón "Seleccionar".

source: make sure you do not have any files that you wish to keep on the removable media. Initializing the media for PersonaCrypt will format the device with ZFS and encrypt it with GELI, meaning that any existing data will be destroyed.
es: Asegúrese de que no tiene ningún archivo que quiera mantener en el medio removible. Inicializar el medio para PersonaCrypt formateará el dispositivo con ZFS y lo encriptará con GELI, significando que cualquier dato será destruido.

source: Input and repeat the "Device Password" to associate with the device. A pop-up menu will indicate that the current contents of the device will be wiped. Click "Yes" to initialize the device.
es: Ingrese y repita la "Contraseña del Dispositivo" para asociarla con el dispositivo. Un menú emergente le indicará que el contenido actual del dispositivo será eliminado. Presione "Sí" para inicializar el dispositivo.

source: If you share your computer with other users, you will be able to create additional login and PersonaCrypt accounts once you are logged in using :menuselection:`Control Panel --> User Manager`. After you have created at least one user, click "Next" to continue to the next screen.
es: Si comparte su computadora con otros usuarios, usted podrá crear cuentas de acceso y de PersonaCrypt adicionales una vez que esté dentro de su sesión usando :menuselection:`Panel de Control --> Administración de Usuarios`. Después que haya creado por lo menos un usuario, presione "Siguiente" para continuar con la siguiente pantalla.

source: Configure Audio Output
es: Configurar Salida de Audio

source: The next screen, seen in :numref:`Figure %s: Configure Audio Output <audio1>`, is used to configure the default audio output.
es: La siguiente pantalla, mostrada en la :numref:`Figura %s: Configurando Salida de Audio <audio1>`, se usa para configurar la salida de audio predeterminada.

source: Click the "Output Device" drop-down menu to select the desired sound device. You can click the "Test" button to verify the setting as a working configuration will result in a test sound. You can also use the "Testing Volume" slider to set the default volume level.
es: Presione "Dispositivo de Salida" en el menú desplegable, para seleccionar el dispositivo de audio deseado. Puede presionar el botón "Probar" para verificar la configuración ya que una configuración válida resultará en un sonido de prueba. Puede también usar la barra deslizable "Probando Volumen" para fijar el nivel de volúmen predeterminado.

source: You can view and edit these settings at a later time using the instructions in :ref:`PC-BSD Mixer Tray`.
es: Puede ver y editar estas configuraciones en el futuro usando las instrucciones en el :ref:`Mezclador de PC-BSD`.

source: Connect to a Wireless Network
es: Conectarse a una Red Inalámbrica

source: If the system has an active wireless interface, a screen similar to :numref:`Figure %s: Connect to a Wireless Network <config5>` will indicate the wireless networks which were automatically detected. Available networks will be ordered by signal strength.
es: Si el sistema tiene una interfaz inalámbrica activa, una pantalla similar a la de la :numref:`Figura %s: Conectándose a una Red Inalámbrica <config5>` le indicará las redes inalámbricas que son detectadas automáticamente. Las redes disponibles se ordenarán por la fuerza de la señal.

source: If you would like to set the default wireless connection, highlight the network that you would like to connect to. If the network requires a password, it will prompt you to input it and will indicate the type of security used on the network. If the network you wish to connect to does not appear, try clicking the "Rescan" button. If you are unable to connect, or you wish to configure the connection at a later time, refer to the instructions in :ref:`Network Configuration`.
es: Si quiere establecer una conexión inalámbrica predeterminada, marque la red a la que se quiere conectar. Si la red requiere una contraseña, se le pedirá que la ingrese e indicará el tipo de seguridad usada por la red. Si la red a la que se quiere conectar no aparece, intente presionar el botón "Buscar Nuevamente". Si no se puede conectar, o quiere configurar la conexión más tarde, refiérase a las instrucciones en :ref:`Configuración de Red`.

source: Enable Optional Services
es: Habilitando Servicios Opcionales

source: The next screen is shown in :numref:`Figure %s: Optional Services <optional1a>`.
es: La siguiente pantalla se muestra en la :numref:`Figura %s: Servicios Opcionales <optional1a>`.

source: If you check the "Disable IPV6" box, the system will be configured to only support IPv4 addresses. The default is to support both IPv4 and IPv6 and to prefer IPv6 over IPv4.
es: Si selecciona la casilla "Deshabilitar IPV6", el sistema se configurará para soportar solamente direcciones IPv4. Lo predeterminado es soportar los dos, IPv4 e IPv6 y darle preferencia a IPv6 sobre IPv4.

source: If you check the "Enable SSH" box, the SSH service will start and be configured to start whenever the system boots. It will also create the firewall rules needed to allow incoming SSH connections to the PC-BSD® system. **DO NOT check this box if you do not want to allow SSH connections to the system.**
es: Si selecciona la casilla "Habilitar SSH", el servicio SSH arrancará y se configurará para iniciar cada que el sistema arranque. También creará las reglas necesarias del cortafuegos para permitir conexiones SSH entrantes al sistema PC-BSD®. **NO seleccione esta casilla si no quiere permitir conexiones SSH al sistema.**

source: When finished, click the "Next" button. The screen in :numref:`Figure %s: Setup is Complete <config6>` indicates that the post-installation setup is complete. Click the "Finish" button to access the login menu.
es: Cuando termine, presione el botón "Siguiente". La pantalla de la :numref:`Figura %s: La Configuración se ha Completado <config6>` indica que la configuración post-instalación se ha completado. Presione el botón "Terminar" para accesar al menú de inicio de sesión.

source: Logging In
es: Accesando
