Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/postinstall.po
Languages: es

source: Once you have finished setting up your system, you will be presented with the PCDM (PC-BSD® Display Manager) graphical login screen. An example is seen in :numref:`Figure %s: PC-BSD® Login Screen <login1>`.
es: Una vez que ha terminado de configurar su sistema, se le presentará la pantalla gráfica de inicio de sesión PCDM (PC-BSD® Display Manager). Un ejemplo se muestra en la :numref:`Figura %s: Pantalla de Inicio de Sesión de PC-BSD® <login1>`.

source: The hostname of the system will be displayed at the top of the login window. In this example, it is *pcbsd-5320*. The login window lets you select or input the following:
es: El nombre del equipo se desplegará en la parte superior de la ventana de acceso. En este ejemplo, es *pcbsd-5320*. La ventana de acceso le permite seleccionar o ingresar lo siguiente:

source: **user:** the first time you login, the "Username" that you created in the :ref:`Create a User Screen` will be the only available user to login as. Later, if you create additional users using :ref:`User Manager`, they will be added to the drop-down menu so you choose which user to login as. PCDM will not let you login as the *root* user. Instead, whenever you access a utility that requires administrative access, PC-BSD® will first ask you to input the password of your login account.
es: **usuario:** La primera vez que ingrese, el "Nombre de Usuario" que creó en la :ref:`Pantalla Crear Usuario` será el único usuario disponible para accesar. Después, si usted crea usuarios adicionales usando el :ref:`Administrador de Usuarios`, los mismos serán añadidos al menú desplegable para que pueda elegir con qué usuario ingresará. PCDM no lo dejará ingresar como el usuario *root*. De cualquier forma, cuando accese una utilería que requiera acceso administrativo, PC-BSD® primero le pedirá que ingrese la contraseña de su cuenta de acceso.

source: **password:** input the password associated with the selected user.
es: **contraseña:** Ingrese la contraseña asociada con el usuario seleccionado.

source: **desktop:** if you installed any desktops, use the drop-down menu to select the desktop to log into. If you did not install any desktops, :ref:`Fluxbox` will be the only available desktop. You can install or uninstall desktops using :ref:`AppCafe®`.
es: **escritorio:** Si instaló cualquier escritorio, use el menú desplegable para seleccionar el escritorio en el cual quiera accesar. Si no instaló ningún escritorio, :ref:`Fluxbox` será el único escritorio disponible. Puede instalar o desinstalar escritorios usando :ref:`AppCafe®`.

source: if you created a PersonaCrypt user, you will need to insert the PersonaCrypt device in order to login. As seen in the example in :numref:`Figure %s: PC-BSD® PersonaCrypt Login Screen <login5>`, this will add an extra field to the login screen so that you can input the password associated with the PersonaCrypt device.
es: Si usted creó un usuario de PersonaCrypt, necesitará el dispositivo PersonaCrypt para poder iniciar sesión. Como se muestra en el ejemplo de la :numref:`Figura %s: Pantalla de Inicio de Sesión de PersonaCrypt en PC-BSD® <login5>`, esto añadirá un campo extra a la pantalla de inicio de sesión para que pueda ingresar la contraseña asociada con el dispositivo PersonaCrypt.

source: The toolbar at the bottom of the screen allows you to select the following options:
es: La barra de herramientas en la parte inferior de la pantalla le permite seleccionar las siguientes opciones:

source: **Locale:** if you did not set the localization during installation or wish to change it, click this icon to set the locale for the login session.
es: **Ubicación:** Si no estableció su ubicación durante la instalación o quiere cambiarla, presione este icono para establecer la ubicación para el inicio de sesión.

source: **Keyboard Layout:** click this icon to change the keyboard layout for the login session.
es: **Diseño de Teclado:** Presione este icono para cambir el diseño del teclado para el inicio de sesión.

source: **Restart/Shut Down:** if you wish to restart or shutdown the system without logging in, click the icon in the lower, far right corner.
es: **Reiniciar/Apagar:** Si quiere reiniciar o apagar el sistema sin accesar, presione el icono de la esquina inferior derecha.

source: Once you have made your selections, input the password associated with the selected user and press enter or click the blue arrow icon to login.
es: Una vez que ha realizado sus selecciones, ingrese la contraseña asociada con el usuario seleccionado y presione Intro o presione el icono de la flecha azul para accesar.

source: The first time you log in, the PC-BSD® "Getting Started" screen will load as seen in :numref:`Figure %s: PC-BSD® Getting Started Screen <welcome1>`.
es: La primera vez que inicie sesión, la pantalla "Comenzando" de PC-BSD® se mostrará como en la :numref:`Figura %s: Pantalla "Comenzando" de PC-BSD® <welcome1>`.

source: If you click the "Next" button, you can read an overview of the utilities that are used to configure your network connection, install applications, configure your system, make a backup, and keep the system updated, as well as how to get involved with the PC-BSD® community. Check the box "Don't show on next startup" if you do not want to see this screen the next time you log in. To re-open the screen after checking that box, type :command:`pc-welcome`.
es: Si presiona el botón "Siguiente", puede leer un resumen de las utilerías que son usadas para configurar su conexión de red, instalar aplicaciones, configurar su sistema, hacer un respaldo, y mantener el sistema actualizado, también cómo puede involucrarse con la comunidad PC-BSD®. Seleccione la casilla "No mostrar la próxima vez" si no quiere ver esta pantalla la próxima vez que accese. Para re-abrir la pantalla despues de seleccionar la casilla, teclee :command:`pc-welcome`.

source: Installation Troubleshooting
es: Solución de Problemas de la Instalación

source: Installing PC-BSD® is usually an easy process that "just works". However, sometimes you will run into a problem. This section will look at solutions to the most common installation problems.
es: Instalar PC-BSD® casi siempre es un proceso fácil que, "simplemente, funciona". Sin embargo, algunas veces podría tener algún problema. Esta sección revisará soluciones a los problemas más comunes de la instalación.

source: The PC-BSD® installer creates a log which keeps a record of all the steps that are completed as well as any errors. When an installation error occurs, the PC-BSD® installer will ask if you would like to generate an error report. If you click "Yes", a pop-up message will ask if you would like to save the error log to a USB stick. Type **y** and insert a FAT formatted USB thumb drive to copy the log.
es: El instalador de PC-BSD® crea un log que mantiene un registro de todos los pasos que se han completado así como de cualquier error. Cuando un error en la instalación ocurre, el instalador de PC-BSD® le preguntará si quiere generar un reporte de error. Si presiona "Sí", un mensaje emergente le preguntará si quiere guardar el log del error en una memoria USB. Presione **s** e inserte una memoria USB formateada con FAT para copiar el log.

source: While in the installer, you can read this log to see what went wrong. Right-click an area on the desktop outside of the installation window and select "xterm" from the menu. You can read the log with this command::
es: Mientras esté en el instalador, puede leer este log para ver qué salió mal. Presione el botón derecho en un área del escritorio fuera de la ventana de instalación y seleccione "xterm" del menú. Puede leer el log con este comando::

source: If you can not figure out how to fix the error or believe that you have discovered an installation bug, send the log that was saved on the USB stick using the instructions in :ref:`Report a Bug`.
es: Si no se le ocurre como arreglar el error o cree que ha descubierto un error en la instalación, mande el log que guardó en la memoria USB usando las instrucciones en :ref:`Reportando un Error`.

source: If the installer does not make it to the initial GUI installer screen, try unplugging as many devices as possible, such as webcams, scanners, printers, USB mice and keyboards. If this solves the problem, plug in one piece of hardware at a time, then reboot. This will help you pinpoint which device is causing the problem.
es: Si el instalador no logra llegar a la pantalla del instalador GUI, intente desconectar los más dispositivos posibles, como cámaras web, escaners, impresoras, ratón y teclado USB. Si esto resuelve el problema, conecte cada pieza de hardware una por una, después reinicie. Esto le ayudará a encontrar que dispositivo está causando el problema.

source: If your computer freezes while probing hardware and unplugging extra devices does not fix the problem, it is possible that the installation media is corrupt. If the :ref:`Data Integrity check` on the file you downloaded is correct, try burning the file again at a lower speed.
es: Si su computadora se congela mientras se prueba el hardware y desconectando dispositivos extra no resuleve el problema, es posible que el medio de instalación esté corrompido. Si realizó el paso: :ref:`Verificando la Integridad de los Datos` en el archivo que descargó y el resultado es correcto, intente grabar nuevamente el archivo a una velocidad menor.

source: If the system freezes and you suspect the video card to be the cause, review your system's BIOS settings. If there is a setting for video memory, set it to its highest value. Also check to see if the BIOS is set to prefer built-in graphics or a non-existent graphics card. On some systems this is determined by the order of the devices listed; in this case, make sure that the preferred device is listed first. If you can not see your BIOS settings you may need to move a jumper or remove a battery to make it revert to the default of built-in graphics; check your manual or contact your manufacturer for details.
es: Si el sistema se congela y sospecha que la tarjeta de video pueda ser la causa, revise las configuraciones de la BIOS de su sistema. Si hay una configuración para la memoria de video, establézcala en su valor más alto. También revise si su BIOS está configurada para dar preferencia a los gráficos integrados o a tarjetas de video inexistentes. En algunos sistemas esto se determina por el orden de los dispositivos listados; en este caso, asegúrese que su dispositivo preferido esté listado al principio. Si no puede ver las configuraciones de su BIOS, usted tendrá que mover un jumper o quitar la batería para que regrese a las opciones predeterminadas de gráficos integrados; revise su manual o contacte a su proveedor para más detalles.

source: If that change did not help, try rebooting and selecting the "Graphical Install (Failsafe VESA mode)" option from the boot menu shown in :numref:`Figure %s: PC-BSD® Installer Boot Menu <install1a>`.
es: Si ese cambio no ayuda, intente reiniciar y seleccionar la opción "Graphical Install (Failsafe VESA mode)" del menú de arranque mostrada en la :numref:`Figura %s: Menú de Arranque del Instalador de PC-BSD® <install1a>`.

source: A not uncommon cause for problems is the LBA (Logical Block Addressing) setting in the BIOS. If your PC is not booting up before or after installation, check your BIOS and turn LBA off (do not leave it on automatic).
es: Una causa no muy común de problemas es la configuración LBA (Logical Block Addressing) en la BIOS. Si su PC no arranca antes o después de la instalación, revise su BIOS y deshabilite LBA (no lo deje en automático).

source: If the SATA settings in your BIOS are set to "compatibility" mode, try changing this setting to "AHCI". If the system hangs with a BTX error, try turning off AHCI in the BIOS.
es: Si las configuraciones SATA en su BIOS están en modo "compatibilidad", intente cambiar esta configuración a "AHCI". Si el sistema se congela con un error BTX, intente deshabilitar AHCI en la BIOS.

source: If the USB keyboard is non-functional, check if there is an option in your BIOS for "legacy support" in relation to the keyboard or to USB, or both. Enabling this feature in your BIOS may solve this issue.
es: Si su teclado USB no funciona, revise si hay alguna opción en su BIOS para "Soporte Legado" en relación al teclado o a USB, o a los dos. Habilitando esta característica en su BIOS puede resolver el problema.

source: If you boot the installer and receive a *mountroot>* command prompt, it may be due to a change in the location of the boot device. This can occur when the if the enumeration of a card reader changes. The solution is to enter *ufs:/dev/da1* at the prompt. Depending on the exact location of the boot media, it may be different than :file:`da1`. Type *?* at the prompt to display the available devices.
es: Si arranca el instalador y recibe un indicador de comando *mountroot>*, puede ser debido a un cambio en el lugar de su dispositivo de arranque. Esto puede ocurrir cuando la enumeración de un lector de tarjetas cambia. La solución es teclear *ufs:/dev/da1* en el indicador de comando. Dependiendo del lugar exacto del medio de arranque, puede ser diferente de :file:`da1`. Teclee *?* en el indicador de comando para mostrar los dispositivos disponibles.

source: If none of the above has fixed your problem, search the `PC-BSD® forums <https://forums.pcbsd.org/>`_ to see if a solution exists, try a web search, or check the section on :ref:`Finding Help`.
es: Si nada de lo anterior arregla su problema, busque en los `Foros de PC-BSD® <https://forums.pcbsd.org/>`_ para ver si existe alguna solución, intente una búsqueda en la web, o revise la sección :ref:`Buscando Ayuda`.
