Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/preinstall.po
Languages: es

source: the first time you run VirtualBox on a PC-BSD® system, a background script will automatically give your user account the permissions required to run this application. Depending upon your desktop, this might break any existing shortcuts to VirtualBox. To fix the shortcut, logout and back in.
es: La primera vez que corra VirtualBox en un sistema PC-BSD®, un script de segundo plano le dará automáticamente a su usuario, los permisos necesarios para correr esta aplicación. Dependiendo de su escritorio, esto pudiera romper cualquier acceso directo a VirtualBox. Para arreglar el acceso directo, salga y entre de nuevo a su sesión.

source: If your computer is running another operating system, download the binary for your operating system from the `VirtualBox Downloads page <https://www.virtualbox.org/wiki/Downloads>`_. VirtualBox runs on Windows, Linux, Macintosh, and OpenSolaris and supports a large number of operating systems that can be installed into a virtual machine.
es: Si su computadora corre otro sistema operativo, descargue el binario para su sistema operativo desde la `página de Descargas de VirtualBox <https://www.virtualbox.org/wiki/Downloads>`_. VirtualBox corre en Windows, Linux, Macintosh, y OpenSolaris y soporta un amplio número de sistemas operativos que se pueden instalar en una máquina virtual.

source: This section describes how to prepare VirtualBox for an installation of PC-BSD® using an :file:`.iso` file as well as how to use the downloadable :file:`.vmdk`, :file:`.vdi`, and :file:`.ova` images with VirtualBox.
es: Esta sección describe como preparar VirtualBox para una instalación de PC-BSD® usando un archivo :file:`.iso` y también cómo usar las imágenes descargables :file:`.vmdk`, :file:`.vdi`, y :file:`.ova` con VirtualBox.

source: Creating a Virtual Machine for an ISO File
es: Creando una Máquina Virtual para un Archivo ISO

source: Once you have downloaded the PC-BSD® ISO and installed VirtualBox on the current system, create a virtual machine and use the ISO to install PC-BSD® into the virtual machine. The virtual machine must meet the following minimum requirements:
es: Una vez que ha descargado la ISO de PC-BSD® e instalado VirtualBox en el sistema actual, cree una máquina virtual y use la ISO para instalar PC-BSD® en la máquina virtual. La máquina virtual tiene que cumplir con los siguientes requerimientos mínimos:

source: 1024 MB base memory size
es: 1024 MB de memoria base

source: a virtual disk **at least 20 GB in size** for a TrueOS® installation or **at least 50 GB in size** for a PC-BSD® installation
es: Un disco virtual de **al menos 20 GB de espacio** para una instalación de TrueOS® o **al menos 50 GB de espacio** para una instalación de PC-BSD®

source: a bridged adapter
es: Un adaptador puente

source: To create the virtual machine, start VirtualBox to see the screen shown in :numref:`Figure %s: Initial VirtualBox Screen <vbox1>`.
es: Para crear la máquina virtual, inicie VirtualBox para ver la pantalla mostrada en la :numref:`Figura %s: Pantalla Inicial de VirtualBox <vbox1>`.

source: Click the "New" button to start the new virtual machine wizard. Click the "Next" button to see the screen in :numref:`Figure %s: Type in a Name and Select the Operating System for the New Virtual Machine <vbox2>`.
es: Presione el botón "Nuevo" para comenzar el asistente de nueva máquina virtual. Presione el botón "Siguiente" para ver la pantalla de la :numref:`Figura %s: Ingrese un Nombre y Seleccione el Sistema Operativo para la Nueva Máquina Virtual <vbox2>`.

source: Enter a name for your virtual machine, which can be anything that makes sense to you. Click the "Operating System" drop-down menu and select "BSD". In the "Version" drop-down menu, select "FreeBSD (64 bit)". Click "Next" to see the screen in :numref:`Figure %s: Select the Amount of Memory Reserved for the Virtual Machine <vbox3>`.
es: Ingrese un nombre para su máquina virtual, que puede ser cualquier cosa que tenga sentido para usted. Presione el menú desplegable "Sistema Operativo" y seleccione "BSD". En el menú desplegable "Versión", seleccione "FreeBSD (64 bit)". Presione "Siguiente" para ver la pantalla de la :numref:`Figura %s: Seleccionando la Cantidad de Memoria Reservada para la Máquina Virtual <vbox3>`.

source: The base memory size must be changed to **at least 1024 MB.** If your system has a lot of RAM, use more. Any number within the green area is considered a safe value by VirtualBox, meaning it should not slow down your computer too much. When finished, click Next to see the screen in :numref:`Figure %s: Select Whether to Use an Existing or Create a New Virtual Hard Drive <vbox4>`.
es: El tamaño de la memoria base deberá cambiarse a **al menos 1024 MB.** Si su sistema tiene mucha RAM, use más. Cualquier número dentro del área verde es considerado un valor seguro para VirtualBox, significando que no debería alentar mucho su computadora. Cuando termine, presione "Siguiente" para ver la pantalla en la :numref:`Figura %s: Seleccione Si Usa o Crea un Nuevo Disco Duro Virtual <vbox4>`.

source: This screen is used to create the virtual hard drive, or the amount of disk space that will be available to the virtual machine. If this is your first virtual machine, keep the default of "Create a virtual hard drive now" and click "Create" to go to the screen shown in :numref:`Figure %s: Select the Hard Drive Type <vbox5>`. If you have created a virtual machine in the past and wish to reuse its disk space, select "Use an existing virtual hard drive file" from the drop-down menu. You can create as many virtual machines as you wish. However, if your computer is getting low on disk space, you should consider reusing existing virtual hard drives to prevent your physical hard drive from being used up by old virtual machines.
es: Esta pantalla es usada para crear el disco duro virtual, o la cantidad de espacio en disco que estará disponible para la máquina virtual. Si ésta es su primera máquina virtual, mantenga el valor predeterminado de "Crear un disco duro virtual ahora" y presione "Crear" para ir a la pantalla mostrada en la :numref:`Figura %s: Seleccionando el Tipo de Disco Duro <vbox5>`. Si ha creado ya una máquina virtual en el pasado y quiere reusar su espacio en disco, seleccione "Use un archivo existente de disco duro virtual" desde el menú desplegable. Puede crear tantas máquinas virtuales como guste. Sin embargo, si su computadora se está quedando sin espacio en disco, debería considerar reusar discos duros virtuales existentes para prevenir que su disco duro físico sea consumido por viejas máquinas virtuales.

source: Select "VDI" and click the "Next" button to see the screen in :numref:`Figure %s: Select the Storage Type <vbox6>`.
es: Seleccione "VDI" y presione el botón "Siguiente" para ver la pantalla mostrada en la :numref:`Figura %s: Seleccionando el Tipo de Almacenamiento <vbox6>`.

source: You can now choose whether you want "Dynamically allocated" or "Fixed size" storage. The first option uses disk space as needed until it reaches the maximum size that you will set in the next screen. The second option creates a disk the same size as that specified amount of disk space, whether it is used or not. Choose the first option if you are worried about disk space; otherwise choose the second option as it allows VirtualBox to run slightly faster. Once you select "Next", you will see the screen in :numref:`Figure %s: Select the File Name and Size of the Virtual Disk <vbox7>`.
es: Ahora puede elegir si quiere almacenamiento "Reservado Dinámicamente" o de "Tamaño Fijo". La primera opción usa el espacio en disco como se vaya necesitando hasta que llega al tamaño máximo que usted elegirá en la siguiente pantalla. La segunda opción crea un disco del mismo tamaño al especificado, se use o no. Elija la primera opción si le preocupa el espacio en disco; de otra forma elija la segunda opción, ya que permite a VirtualBox correr un poco más rápido. Una vez que seleccione "Siguiente", usted verá la pantalla en la :numref:`Figura %s: Seleccionando el Nombre de Archivo y Tamaño del Disco Virtual <vbox7>`.

source: This screen is used to set the size (or upper limit) of the virtual machine. If you plan to install PC-BSD® into the virtual machine, **increase the size to at least 20 GB** or you will receive an error during the PC-BSD® installation. If you plan to install KDE, GNOME, multiple desktop managers, or applications within the virtual machine, you will probably want to choose at least 50GB. Whatever size you set, make sure that your computer has enough free disk space to support it. Use the folder icon to browse to a directory on disk with sufficient space to hold your virtual machine.
es: Esta pantalla se usa para establecer el tamaño (o límite superior) de la máquina virtual. Si planea instalar PC-BSD® en una máquina virtual, **aumente el tamaño al menos hasta 20 GB** o recibirá un error durante la instalación de PC-BSD®. Si planea instalar KDE, GNOME, múltiples escritorios, o aplicaciones dentro de la máquina virtual, probablemente querrá elegir al menos 50 GB. Cualquier tamaño que establezca, asegúrese que su computadora tiene el suficiente espacio libre en disco para soportarla. Use el icono de carpeta para examinar un directorio en el disco con espacio suficiente para alojar su máquina virtual.

source: Once you make your selection and press "Next", you will see a summary of your choices. You can use the "Back" button to return to a previous screen if you wish to change any values. Otherwise, click "Create" to finish using the wizard. Your virtual machine should now show up in the left box, as seen in the example in :numref:`Figure %s: The New Virtual Machine <vbox8>`.
es: Una vez que haya realizado su selección y presione "Siguiente", verá un resumen de sus elecciones. Puede usar el botón "Atrás" para regresar a una pantalla previa si quiere cambiar cualquier valor. De otra forma, presione "Crear" para terminar de usar el asistente. Su máquina virtual debería ahora mostrarse en la caja de la izquierda, como se muestra en el ejemplo en la :numref:`Figura %s: La Máquina Virtual Nueva <vbox8>`.

source: In order to use your network card, configure bridging on your virtual machine. To do this, go to :menuselection:`Settings --> Network`. In the "Attached to" drop-down menu select "Bridged Adapter" then select the name of the physical interface from the "Name" drop-down menu. In the example shown in :numref:`Figure %s: Configuring a Bridged Adapter in VirtualBox <vbox9>`, the Intel Pro/1000 Ethernet card is attached to the network and has a device name of :file:`re0`.
es: Para usar su tarjeta de red, configure un puente en su máquina virtual. Para hacer esto, vaya a :menuselection:`Configuraciones --> Red`. En el menú desplegable "Conectado a" seleccione "Adaptador Puente" y después seleccione el nombre de la interfaz física desde el menú desplegable "Nombre". En el ejemplo mostrado en la :numref:`Figura %s: Configurando un Adaptador Puente en VirtualBox <vbox9>`, la tarjeta Ethernet Intel Pro/1000 está conectada a la red y tiene un nombre de dispositivo de :file:`re0`.

source: Before starting your virtual machine, configure it to use your installation media. Click the "Storage" hyperlink in the right frame to access the storage screen seen in :numref:`Figure %s: The Storage Settings of the Virtual Machine <vbox10>`.
es: Antes de iniciar su máquina virtual, configúrela para usar su medio de instalación. Presione el enlace "Almacenamiento" en el marco derecho para accesar la pantalla de almacenamiento mostrada en la :numref:`Figura %s: Las Configuraciones de Almacenamiento de la Máquina Virtual <vbox10>`.

source: Double-click the word "Empty", which represents your DVD reader. If you wish to access the PC-BSD® installer from your DVD reader, double-check that the "Slot" is pointing to the correct location (e.g. "IDE Secondary Master") and use the drop-down menu to change it if the location is incorrect. Click the "CD/DVD Device" drop-down menu to change it from empty to the "Host Drive" value.
es: Haga doble-clic en la palabra "Vacío" que representa su lector DVD. Si quiere accesar el instalador de PC-BSD® desde su lector de DVD, revise que el "Slot" esté apuntando a la dirección correcta (por ejemplo "IDE Secundario Maestro") y use el menú desplegable para cambiarlo si la dirección es incorrecta. Presione el menú desplegable "Unidad CD/DVD" para cambiarlo de vacío al valor "Unidad Anfitrión".

source: If you prefer to use an ISO that is stored on your hard disk, click the DVD icon then "Choose a virtual CD/DVD disk file" to open a browser menu where you can navigate to the location of the ISO. Highlight the desired ISO and click "Open". The name of the ISO will now appear in the "Storage Tree" section.
es: Si prefiere usar la ISO que está almacenada en su disco duro, presione el icono del DVD y luego "Elija el archivo de disco virtual CD/DVD" para abrir el menú del navegador donde podrá navegar a la ruta de la ISO. Seleccione la ISO deseada y presione "Abrir". El nombre de la ISO ahora aparecerá en la sección "Árbol de Almacenamiento".

source: You are now ready to install PC-BSD® into your virtual machine. Simply highlight the virtual machine and click on the green "Start" icon. A window will open indicating that the virtual machine is starting. If you have a DVD inserted, you should hear it spin and it should start to boot into the installation program. If it does not or if you are using an ISO stored on the hard disk, press "F12" to select the boot device when you see the message to do so, then press "c" to boot from CD-ROM. You can then proceed through the installation as described in :ref:`Installing PC-BSD®`.
es: Ahora está listo para instalar PC-BSD® en su máquina virtual. Simplemente seleccione la máquina virtual y presione en el icono verde "Iniciar". Una ventana se abrirá indicando que la máquina virtual está iniciando. Si tiene el DVD montado, debe escucharlo girar y debe comenzar a arrancar en el programa de instalación. Si no lo está o está usando la ISO almacenada en el disco duro, presione "F12" para seleccionar el dispositivo de arranque cuando vea el mensaje para hacerlo, entonces presione "c" para arrancar desde el CD-ROM. Ahora puede proceder a través de la instalación como se describe en :ref:`Instalando PC-BSD®`.

source: Using the Downloadable VirtualBox or VMWare Disk
es: Usando el Disco Descargable VirtualBox o VMware

source: PC-BSD® provides pre-built VirtualBox and VMWare disks which create a a pre-made virtual machine with PC-BSD® already installed. The VirtualBox file ends in a :file:`.vdi.xz` extension and the VMWare disk file ends in a :file:`.vmdk.xz` extension. The :file:`.xz` means that the file needs to be unzipped first so that it just ends with a :file:`.vdi` or :file:`.vmdk` extension.
es: PC-BSD® proporciona discos VirtualBox y VMWare pre-construidos que crean una máquina virtual pre-configurada con PC-BSD® ya instalado. El archivo VirtualBox termina con una extensión :file:`.vdi.xz` y el disco de VMWare termina con una extensión :file:`.vmdk.xz`. El :file:`.xz` significa que el archivo necesita ser extraído primero para que solo termine con una extensión :file:`.vdi` o :file:`.vmdk`.

source: On a Linux or BSD system, use the :command:`xz` command by giving it the name of the file which you downloaded::
es: En un sistema Linux o BSD, use el comando :command:`xz` dándole el nombre del archivo que descargó:

source: Since this is a large file, the command will take a few minutes to extract the image. You will receive the prompt back when it has finished.
es: Dado que es un archivo grande, el comando tomará unos minutos para extraer la imágen. Recibirá el indicador de comandos cuando termine.

source: On a Windows system, you can use a utility such as `7-Zip <http://www.7-zip.org/>`_. On a Mac OS X system, simply double-click the file in "Finder" to extract it.
es: En un sistema Windows, puede usar una utilería como `7-Zip <http://www.7-zip.org/>`_. En un sistema Mac OS X, simplemente haga doble-clic en el archivo en el "Buscador" para extraerlo.

source: Once the file is unzipped, open VirtualBox. When you get to :numref:`Figure %s: Select Whether to Use an Existing or Create a New Virtual Hard Drive <vbox4>`, select "Use an existing virtual hard drive file".
es: Una vez que el archivo es descomprimido, abra VirtualBox. Cuando llegue a la :numref:`Figura %s: Seleccionando si Usa o Crea un Nuevo Disco Duro Virtual <vbox4>`

source: Use the browse icon to browse to the location of the :file:`.vdi` or :file:`.vmdk` file then press "Next". A message will indicate that the virtual machine will be created. Click the "Create" button to finish the wizard. You can then configure the network adapter and start the virtual machine.
es: Use el icono de examinar para examinar la ruta del archivo :file:`.vdi` o :file:`.vmdk` y presione "Siguiente". Un mensaje le indicará que la máquina virtual será creada. Presione el botón "Crear" para finalizar el asistente. Usted puede ahora configurar el adaptador de red e iniciar la máquina virtual.

source: The "consumer-desktop" virtual machine will boot into the post-installation configuration screens so that the system can be configured. Once the display wizard is finished and the login menu appears, input the username and password that you configured at the :ref:`Create a User Screen`.
es: La máquina virtual "consumer-desktop" arrancará en las pantallas de configuración post-instalación para que el sistema pueda ser configurado. Una vez que el asistente de pantalla termine y el menú de inicio de sesión aparezca, introduzca el usuario y contraseña que configuró en la :ref:`Pantalla de Creación de Usuario`.

source: When using the "trueos-server" edition, the virtual machine will boot into a password prompt. Enter *root* as the username and *pcbsd* as the password. It is recommended to immediately change the *root* password by typing :command:`passwd` and following the prompts. It is also recommended to create a user account to login with. You can do so by typing :command:`adduser` and following the prompts.
es: Cuando use la edición "trueos-server", la máquina virtual arrancará en un indicador para introducir la contraseña. Ingrese *root* como el nombre de usuario y *pcbsd* como la contraseña. Se recomienda que inmediatamente cambie la contraseña de *root* tecleando :command:`passwd` y siguiendo los indicadores. También se recomienda crear una cuenta de usuario con la cual ingresar. Puede hacerlo tecleando :command:`adduser` y siguiendo los indicadores.

source: Using the Downloadable .ova File
es: Usando el Archivo Descargable .ova

source: A file that ends in a :file:`.ova` extension is a tarball of a virtual machine that follows the Open Virtualization Format (OVF). This file can be used in any virtualization technology that supports OVF, such as VirtualBox or VMware.
es: Un archivo que termina con una extensión :file:`.ova` es un archivo comprimido de una máquina virtual que sigue el Formato Abierto de Virtualización (Open Virtualization Format OVF). Este archivo puede usarse en cualquier tecnología de virtualización que soporte OVF, como VirtualBox o VMware.

source: If you double-click the :file:`.ova` file on a Windows or Mac system, it will automatically open the image for you in the default virtualization application.
es: Si hace doble-clic en el archivo :file:`.ova` en un sistema Windows o Mac, abrirá automáticamente la imágen para usted en la aplicación de virtualización predeterminada.

source: The first time you open an :file:`.ova` file on a PC-BSD® system, right-click the file, select "Open With", browse to the application to open it with, and check the box "Remember application association for this type of file". The following example assumes the user has selected :menuselection:`System --> Oracle VM VirtualBox` as the application.
es: La primera vez que abra un archivo :file:`.ova` en un sistema PC-BSD®, haga doble-clic en el archivo, seleccione "Abrir Con", examine hasta la aplicación con la que lo abrirá, y seleccione la casilla "Recordar asociación de aplicación para este tipo de archivo". El siguiente ejemplo asume que el usuario ha seleccionado :menuselection:`Sistema --> Oracle VM VirtualBox` como la aplicación.

source: The first time a PC-BSD® :file:`.ova` file is opened, a screen will open so that you can review the virtual machine's settings that came with the file. An example is shown in :numref:`Figure %s: Appliance Settings Screen <ova1>`. To edit a setting, double-click its name.
es: La primera vez que un archivo :file:`.ova` de PC-BSD® es abierto, una pantalla se abrirá para que pueda revisar las configuraciones de la máquina virtual que vienen con el archivo. Un ejemplo se muestra en la :numref:`Figura %s: Pantalla de Configuraciones de la Máquina Virtual <ova1>`. Para editar una configuración, haga doble clic en el nombre.

source: Depending upon the setting, you can either type in the desired value or select it from a drop-down menu. Once you are finished, click the "Import" button. It will take a few minutes for the import to complete and a status bar will indicate the status of the import. Once imported, the virtual machine will show in the left frame of VirtualBox. Highlight the virtual machine and click "Start" to boot into the image.
es: Dependiendo de la configuración, puede ingresar el valor deseado o seleccionarlo desde un menú desplegable. Una vez que termine, presione el botón "Importar". Tomará algunos minutos para que se complete la importación y una barra de estado le indicará del estado de la importación. Una vez importada, la máquina virtual aparecerá en el marco izquierdo de VirtualBox. Seleccione la máquina virtual y presione "Iniciar" para arrancar en la imágen.

source: When using the "consumer-desktop" edition, the virtual machine will boot into Figure 4.2a so that you can perform the post-installation configuration for the desktop.
es: Cuando use la edición "consumer-desktop", la máquina virtual arrancará para que pueda realizar las configuraciones post-instalación para el escritorio.
