Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/preinstall.po
Languages: es

source: Files ending in :file:`.vdi.xz` can be used in Virtualbox, as described in :ref:`Using the Downloadable VirtualBox or VMWare Disk`.
es: Los archivos que terminan en :file:`.vdi.xz` pueden ser usados en VirtualBox, como se describe en :ref:`Usando el Disco Descargable VirtualBox o VMware`.

source: Files ending in :file:`.vmdk.xz` can be used in VMware, as described in :ref:`Using the Downloadable VirtualBox or VMWare Disk`.
es: Los archivos que terminan en :file:`.vmdk.xz` pueden ser usados en VMware, como se describe en :ref:`Usando el Disco Descargable VirtualBox o VMware`.

source: Files ending in :file:`.raw.xz` can be used in Qemu and can also be converted to other virtual image formats.
es: Los archivos que terminan en :file:`.raw.xz` pueden ser usados en Qemu, y pueden también convertirse en otros formatos de imágenes virtuales.

source: When selecting a virtual image file, choose a format that matches your virtualization technology, and an edition that matches what you would like to use. The following editions are available:
es: Cuando seleccione un archivo de imágen virtual, elija el formato que coincida con su tecnología de virtualización, y una edición que coincida con lo que usted quiere usar. Las siguientes ediciones están disponibles:

source: :file:`consumer-desktop`: provides an installed version of PC-BSD® with the KDE and Fluxbox desktop environments.
es: :file:`consumer-desktop`: proporciona una versión instalada de PC-BSD® con los entornos de escritorio KDE y Fluxbox.

source: :file:`trueos-server`: provides a pre-installed TrueOS® server that is command-line only.
es: :file:`trueos-server`: proporciona un servidor TrueOS® preinstalado con línea de comandos solamente.

source: If you downloaded an installation file, instead of a virtual image, refer to :ref:`Burning the Installation Media` for instructions on how to burn the file to bootable media.
es: Si descargó un archivo de instalación, en lugar de una imágen virtual, refiérase a :ref:`Grabando el Medio de Instalación` para instrucciones en como grabar el archivo en un medio arrancable.

source: Data Integrity Check
es: Revisando la Integridad de los Datos

source: After downloading the desired file, it is a good idea to check that the file is exactly the same as the one on the PC-BSD® server. While downloading, a portion of the file may get damaged or lost, making the installation file unusable. Each PC-BSD® installation file has an associated MD5 and SHA256 checksum. If a checksum of the file you downloaded matches, your download was successful. If a checksum does not match, try downloading the file again. In order to verify a checksum, you will need to use a checksum verification utility.
es: Después de descargar el archivo deseado, es una buena idea el revisar que el archivo es exactamente el mismo que el del servidor PC-BSD®. Mientras se descarga, una porción del archivo puede dañarse o perderse, haciendo el archivo de instalación no usable. Cada archivo de instalación PC-BSD® tiene asociada una firma MD5 y SHA256. Si la firma del archivo que descargó coincide, su descarga ha sido exitosa. Si la firma no coincide, intente descargar el archivo nuevamente. Para verificar la firma, usted necesitará usar una utilería de verificación de firmas.

source: If you are currently using a Windows system, you can download and install the `FastSum <http://www.fastsum.com/>`_ utility in order to verify the MD5 checksum. Once installed, launch the program and click the "Files" button, shown in :numref:`Figure %s: Verifying a Checksum Using FastSum <fastsum1>`, to browse to the location of your downloaded file.
es: Si actualmente está usando un sistema Windows, puede descargar e instalar la utilería `FastSum <http://www.fastsum.com/>`_ para poder verificar las firmas MD5. Una vez instalada, ejecute el programa y presione el botón "Archivos", mostrado en la :numref:`Figura %s: Verificando la Firma Usando FastSum <fastsum1>`, para encontrar la ubicación de su archivo descargado.

source: Once the file is selected, click the green arrow to calculate the checksum. Once calculated, it will be listed in the "Checksum\State" column, though FastSum will capitalize the letters.
es: Una vez que el archivo ha sido seleccionado, presione en la flecha verde para calcular la firma. Una vez calculada, será listada en la columna "Firma|Estado", aunque FastSum pondrá en mayúsculas todas las letras.

source: On Linux and BSD systems you can use the built-in :command:`md5` or :command:`md5sum` command line tool to check the MD5 checksum. In this example, the file is located in the :file:`Downloads` subdirectory directory. You should substitute the name and location of the file that you downloaded::
es: En los sistemas Linux y BSD puede hacer uso de la utilería de línea de comandos incluida :command:`md5` o :command:`md5sum` para revisar la firma MD5. En este ejemplo, el archivo está localizado en el subdirectorio :file:`Downloads`. Usted debe cambiar el nombre y la ruta del archivo que descargó:

source: Burning the Installation Media
es: Grabando el Medio de Instalación

source: If you downloaded an :file:`.iso` file, it can be burned to either a DVD (or a CD, if it is the TrueOS ISO) or to a removable USB device. This section demonstrates how to do so using several different applications and operating systems.
es: Si descargó un archivo :file:`.iso`, puede ser grabado ya sea en un DVD (o en un CD, si se trata de la ISO de TrueOS) o en un dispositivo USB removible. Esta sección demuestra como hacerlo usando diferentes aplicaciones y sistemas operativos.

source: Burning to DVD on Windows
es: Grabando a un DVD en Windows

source: Windows 7 has built-in support for writing ISO images to disc. Right-click on the :file:`.iso` file in Windows Explorer and select "Burn disk image". Select the DVD device in the "Disk Burner" drop-down menu and then click "Burn" to write the disc. See the Microsoft article `Burn a CD or DVD from an ISO file <http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file>`_ for more detailed instructions.
es: Windows 7 tiene soporte incluido para grabar imágenes ISO a disco. Presione botón derecho en el archivo :file:`.iso` en el Explorador de Windows y seleccione "Grabar imágen de disco". Seleccione el dispositivo DVD en el menú desplegable "Grabador de Disco" y presione en "Grabar" para grabar el disco. Revise el artículo de Microsoft `Grabando un CD o DVD desde un archivo ISO <http://windows.microsoft.com/en-US/windows7/Burn-a-CD-or-DVD-from-an-ISO-file>`_ para instrucciones más detalladas.

source: Alternately, the `InfraRecorder utility <http://infrarecorder.org/>`_ is an open source burning application for both CDs and DVDs. Once installed, open InfraRecorder and click on the "Write Image" button shown in :numref:`Figure %s: Initial InfraRecorder Screen <infra1>`.
es: Alternativamente, la `utilería InfraRecorder <http://infrarecorder.org/>`_ es una aplicación open souce para grabar CDs y DVDs. Una vez instalado, abra InfraRecorder y presione en el botón "Grabar Imágen" mostrado en la :numref:`Figura %s: Pantalla Inicial de InfraRecorder <infra1>`.

source: InfraRecorder will display a screen where you can browse to the location of the :file:`.iso` file. Once selected, you will be presented with an options screen shown in :numref:`Figure %s: Burn Options in InfraRecorder <infra2>`. You can accept the defaults and click "OK" to start the burn. When finished, the burner tray will open and a dialog box will appear indicating that the burning process has finished.
es: InfraRecorder desplegará una pantalla donde puede buscar la ubicación del archivo :file:`.iso`. Una vez seleccionado, se le presentará una pantalla de opciones mostrada en la :numref:`Figura %s: Opciones de Grabado en InfraRecorder <infra2>`. Puede aceptar las opciones predeterminadas y presionar "OK" para iniciar la grabación. Cuando termine, la bandeja del quemador se abrirá y un cuadro de diálogo aparecerá indicándole que el proceso de grabado ha terminado.

source: Burning to DVD on a BSD or Linux System
es: Grabando a un DVD en un sistema BSD o Linux

source: `The K3B burner <https://www.kde.org/applications/multimedia/k3b/>`_ is an easy-to-use graphical burning application for Linux and BSD systems. This utility can be installed using :ref:`AppCafe®`. Once installed, it can be run from any desktop by typing :command:`k3b`.
es: `El grabador K3B <https://www.kde.org/applications/multimedia/k3b/>`_ es una aplicación gráfica de grabado, fácil de usar para Linux y sistemas BSD. Esta utilería puede ser instalada usando :ref:`AppCafe®`. Una vez instalada, puede correr desde cualquier escritorio tecleando :command:`k3b`.

source: To burn your ISO, launch K3B, insert a blank DVD/CD media, browse to the location of the :file:`.iso` file in the screen shown in :numref:`Figure %s: Selecting the Burn Image Tool Within K3B <k3b1>`, and click :menuselection:`Tools --> Burn Image...` to see the screen in :numref:`Figure %s: K3B's Burn Image Screen <k3b2>`.
es: Para grabar su ISO, ejecute K3B, inserte un medio DVD/CD en blanco, busque dónde se localiza el archivo :file:`.iso` en la pantalla mostrada en la :numref:`Figura %s: Seleccionando la Herramienta Grabar Imágen en K3B <k3b1>`, y presione :menuselection:`Herramientas --> Grabar Imágen...` para ver la pantalla que se muestra en la :numref:`Figura %s: Pantalla de Grabar Imágen de K3B <k3b2>`.

source: Click the "Start" button to burn the file. K3B will automatically eject the media once the burn is complete.
es: Presione el botón "Iniciar" para grabar el archivo. K3B automáticamente expulsará el medio una vez que la grabación se haya completado.

source: `The Brasero burner <https://wiki.gnome.org/Apps/Brasero>`_ provides an alternative, easy-to-use burning application included with the :ref:`GNOME` desktop. A PBI is also available within :ref:`AppCafe®`. Once installed, Brasero can be launched by typing :command:`brasero` from within any window manager. :numref:`Figure %s: Brasero's Initial Screen <brasero1>` shows the initial Brasero screen.
es: `El grabador Brasero <https://wiki.gnome.org/Apps/Brasero>`_ proporciona una alternativa, una aplicación fácil de usar para grabar incluida con el escritorio :ref:`GNOME`. Un PBI está también disponible en :ref:`AppCafe®`. Una vez instalado, Brasero puede ejecutarse tecleando :command:`brasero` desde cualquier gestor de ventanas. La :numref:`Figura %s: Pantalla Inicial de Brasero <brasero1>` muestra la pantalla inicial de Brasero.

source: Click "Burn image" to open the screen seen in :numref:`Figure %s: Brasero Image Burning Setup <brasero2>`. Use the "Click here to select a disk image" button to select your :file:`.iso` file.
es: Presione en "Grabar imágen" para abrir la pantalla mostrada en la :numref:`Figura %s: Preparación para Grabar Imágen en Brasero <brasero2>`. Use el botón "Presione aquí para seleccionar una imágen de disco" para seleccionar su archivo :file:`.iso`.

source: The name and size of your :file:`.iso` file should appear and Brasero will indicate the size of the media. If you click on the "Properties" button, you can change some options, but it is fine to keep the default settings. When you are ready, click the "Burn" button and Brasero will burn your ISO.
es: El nombre y tamaño de su archivo :file:`.iso` deberá aparecer y Brasero le indicará el tamaño del medio. Si presiona en el botón "Propiedades", puede cambiar algunas opciones, pero es mejor quedarse con las características predeterminadas. Cuando esté listo, presione el botón "Grabar" y Brasero grabará su ISO.

source: If you are familiar with using the command line on a FreeBSD or PC-BSD® system, you can use the :command:`growisofs` command line utility to burn the DVD. This utility is included with the dvd+rw-tools FreeBSD port which is installed by default on a PC-BSD® system. If that software is not yet installed on a FreeBSD system, issue this command as the superuser::
es: Si está familiarizado con la línea de comandos en un sistema FreeBSD o PC-BSD®, puede usar la utilería de línea de comandos :command:`growisofs` para grabar el DVD. Esta utilería está incluida con el port dvd+rw-tools de FreeBSD que está instalado por defecto un sistema PC-BSD®. Si ese software no ha sido instalado en un sistema FreeBSD, ejecute este comando como superusuario:

source: Depending upon the type of DVD burner hardware, you may have to configure the system to use it. If the device is ATAPI (i.e. not USB or SCSI), the ATAPI driver must be loaded. The superuser can issue this command::
es: Dependiendo del tipo de su hardware para grabar DVD, usted tendrá que configurar el sistema para usarlo. Si el dispositivo es ATAPI (por ejemplo no USB ni SCSI), el controlador ATAPI debería ser cargado. El superusuario puede introducir este comando:

source: If you just get your prompt back, the driver successfully loaded. If you get the message "kldload: can't load atapicam: File exists", this means that the driver was already loaded. If the device is USB or SCSI, no additional drivers need to be loaded if you are running the generic FreeBSD kernel. After inserting the DVD media into the device, you can start the burn using this command::
es: Si obtiene nuevamente el símbolo del sistema, el controlador se ha cargado satisfactoriamente. Si recibe el mensaje "kldload: no se puede cargar atapicam: El archivo ya existe", esto significa que el controlador ya está cargado. Si el dispositivo es USB o SCSI, no se necesita cargar controladores adicionales si está corriendo el kernel genérico de FreeBSD. Después de insertar el medio DVD en el dispositivo, puede comenzar la grabación usando el siguiente comando:

source: If your device is not the first CD device, change the number *0* accordingly. If your ISO has a different name, substitute the correct name in the command shown above.
es: Si su dispositivo no es el primer dispositivo CD, cambie el número *0* según convenga. Si su ISO tiene un nombre diferente, sustituya el nombre correcto en el comando mostrado anteriormente.

source: Burning to DVD on a Mac OS X System
es: Grabando a un DVD en un Sistema Mac OS X

source: To burn the ISO on a Mac OS X system, go to :menuselection:`Finder --> Applications --> Utilities --> Disk Utility`. With a blank media inserted into the burner, highlight the device representing the DVD writer and click the "Burn" button. This will open up a browser where you can select the ISO to burn.
es: Para grabar la ISO en un sistema Mac OS X, vaya a :menuselection:`Buscador --> Aplicaciones --> Utilerías --> Utilería de Disco`. Con un medio vírgen insertado en el grabador, seleccione el dispositivo que representa al grabador DVD y presione el botón "Grabar". Esto abrirá un navegador donde puede seleccionar la ISO a grabar.

source: Once the ISO is highlighted, click the "Burn" button. A pop-up message will indicate that the device is ready to burn. Click "Burn" once more and Disk Utility will write the ISO to the DVD media.
es: Una vez que seleccionó la ISO, presione el botón "Grabar". Una mensaje emergente le indicará que el dispositivo está listo para grabar. Presione "Grabar" una vez más y la Utilería de Disco grabará la ISO al DVD.

source: Writing to a USB Device
es: Grabando en un Dispositivo USB

source: To write to a USB device, you will need the following:
es: Para grabar en un dispositivo USB, necesitará lo siguiente:

source: a utility that can write the image to a USB media; the utility that you use will depend upon your operating system
es: Una utilería que pueda escribir la imágen en un medio USB; la utilería que use dependerá de su sistema operativo.

source: a USB thumb drive or hard drive large enough to hold the image
es: Una memoria USB o un disco duro lo bastante grande para alojar la imágen.

source: Once the image is written, boot from the removable device and proceed with the PC-BSD® installation.
es: Una vez que la imágen se ha grabado, arranque desde el dispositivo removible y proceda con la instalación de PC-BSD®.

source: if there is a card reader on the system or the USB drive is connected using a USB dongle, device enumeration may be affected. For example, with the USB card reader dongle as the destination, the device name could be :file:`/dev/da1` instead of :file:`/dev/da0`.
es: Si tiene un lector de tarjetas en el sistema o el dispositivo USB está conectado usando un concentrador USB, la enumeración del dispositivo puede ser afectada. Por ejemplo, con el lector de tarjetas USB como destino, el nombre del dispositivo puede ser: :file:`/dev/da1` en vez de :file:`/dev/da0`.

source: To write the :file:`.iso` file to a flash card or removable USB drive on a BSD or Linux system, use the :command:`dd` command line utility. On a FreeBSD system, the superuser can use this command to write the file to the first plugged in USB device::
es: Para escribir el archivo :file:`.iso` a una memoria flash o un disco USB removible en un sistema BSD o Linux, use la utilería de línea de comandos :command:`dd`. En un sistema FreeBSD, el superusuario puede usar este comando para escribir el archivo al primer dispositivo USB conectado:

source: When using the :command:`dd` command:
es: Cuando use el comando :command:`dd`:

source: **if=** refers to the input file to be written
es: **if=** se refiere al archivo que será escrito

source: **of=** refers to the output file (the device name of the flash card or removable USB drive); increment the number in the name if it is not the first USB device
es: **of=** se refiere al archivo de salida (el nombre del dispositivo de la memoria flash o el disco USB removible); incremente el número en el nombre si no es el primer dispositivo USB.

source: **bs=** refers to the block size
es: **bs=** se refiere al tamaño del bloque

source: on Linux, if you type :command:`mount` with the USB stick inserted, you will see two or more device nodes corresponding to the USB stick. For example, :file:`/dev/sdc` and :file:`/dev/sdc1`, where :file:`/dev/sdc1` corresponds to the primary partition of the USB stick. Before using the :command:`dd` command, ensure that the usb stick is first unmounted. Then, remember to use :file:`/dev/sdc` (the device node without the number) as the option for the output file **of=**. Once the :command:`dd` completes, you might not be able to mount the USB stick on Linux as Linux has very limited support for UFS, the BSD filesystem that gets created on the USB stick.
es: En Linux, si escribe el comando :command:`mount` con el USB insertado, verá dos o más nodos de dispositivos correspondientes al dispositivo USB. Por ejemplo, :file:`/dev/sdc` y :file:`/dev/sdc1`, donde :file:`/dev/sdc1` corresponde a la partición primaria del dispositivo USB. Antes de usar el comando :command:`dd`, asegúrese que el dispositivo USB esté desmontado primero. Después, recuerde usar :file:`/dev/sdc` ( el nodo del dispositivo sin el número) como la opción para el archivo de salida **of=**. Una vez que :command:`dd` termine, probablemente no sea capaz de montar el dispositivo USB en Linux, ya que Linux tiene un soporte muy limitado para UFS, el sistema de archivos BSD que se ha creado en el dispositivo USB.

source: If you launch :command:`win32-image-writer.exe`, it will start the Win32 Disk Imager utility, shown in :numref:`Figure %s: Using Win32 Disk Imager to Write the Image <writer1>`. Use the "browse" button to browse to the location of the :file:`.iso` file. Insert a USB thumb drive and select its drive letter (in this example, drive D). Click the "Write" button and the image will be written to the USB thumb drive.
es: Si ejecuta :command:`win32-image-writer.exe`, lanzará la utilería Win32 Disk Imager, mostrada en la :numref:`Figura %s: Usando Win32 Disk Imager para Grabar la Imágen <writer1>`. Use el botón "buscar" para buscar la ubicación del archivo :file:`.iso`. Inserte una memoria USB y seleccione su letra de unidad (en este ejemplo, unidad D). Presione el botón "Grabar" y la imágen será grabada en la memoria USB.

source: To burn the :file:`.iso` file on Mac OS X, insert a USB stick and open Terminal. Run the :command:`diskutil list` command to find out the device name of the USB disk, unmount the USB disk, then use :command:`dd` to write the image to the raw disk (:file:`rdisk`). In the following example, an 8GB USB stick has a device name of :file:`/dev/disk1` and a raw device name of :file:`/dev/rdisk1`.::
es: Para grabar el archivo :file:`.iso` en Mac OS X, inserte un dispositivo USB y abra una Terminal. Ejecute el comando :command:`diskutil list` para encontrar el nombre del dispositivo del disco USB, desmonte el disco USB, después use el comando :command:`dd` para escribir la imágen al disco en blanco (:file:`rdisk`). En el siguiente ejemplo, un dispositivo USB de 8 GB tiene un nombre de dispositivo :file:`/dev/disk1` y un nombre de dispositivo raw :file:`/dev/rdisk1`.:

source: Virtualization
es: Virtualización

source: A virtualized environment allows you to test drive an operating system without overwriting your current operating system. This is an excellent way to practice installation, determine whether all of your hardware is supported, or to try multiple versions of different operating systems. Virtualization software effectively creates windows (known as virtual machines) into which you can install and use an operating system. The only limitation to virtualization is your hardware as each virtual machine uses CPU and RAM. Depending upon the amount of CPU and RAM in your computer, you may find that the operating system you install using virtualization software runs slowly. If your computer slows down greatly, try closing other applications running on your computer to free up some RAM.
es: Un ambiente virtualizado le permite probar un sistema operativo sin sobrescribir su sistema operativo actual. Esta es una forma excelente de practicar la instalación, determinar si todo su hardware está soportado, o para probar multiples versiones de diferentes sistemas operativos. El software de virtualización crea ventanas (conocidas como máquinas virtuales) en las que puede instalar y usar un sistema operativo. La única limitación para la virtualización es su hardware ya que cada máquina virtual usa CPU y RAM. Dependiendo de la cantidad de CPU y RAM en su computadora, puede encontrar que el sistema operativo que instale usando el software de virtualización corre lentamente. Si su computadora se alenta en gran medida, trate de cerrar otras aplicaciones corriendo en su computadora para liberar algo de RAM.

source: During the installation of PC-BSD®, you can choose to install the `VirtualBox <https://www.virtualbox.org/>`_ open source virtualization program and the `VirtualBox Guest Additions <http://www.virtualbox.org/manual/ch04.html>`_ with the operating system. The guest additions add mouse pointer integration, shared folders between the host and guest, better video support, and a shared clipboard. To install these after installation, use :ref:`AppCafe®` and search for "virtualbox".
es: Durante la instalación de PC-BSD®, puede elegir instalar el programa de virtualización open source `VirtualBox <https://www.virtualbox.org/>`_ y los `Agregados para el Huésped de VirtualBox <http://www.virtualbox.org/manual/ch04.html>`_ con el sistema operativo. Los agregados añaden integración al puntero del ratón, directorios compartidos entre el anfitrión y el huésped, mejor soporte de video, y un portapapeles compartido. Para instalarlos después de la instalación, use :ref:`AppCafe®` y busque "virtualbox".
