Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/preinstall.po
Languages: es

source: Pre-Installation Tasks
es: Tareas Antes de la Instalación

source: While the PC-BSD® installer is very easy to use, installing a brand new operating system can sometimes be a daunting task.
es: Mientras que el instalador de PC-BSD® es muy fácil de usar, instalar un sistema operativo nuevo puede ser algunas veces una tarea desalentadora.

source: Before you begin, there are a few things you should check to ensure that your system is ready to install PC-BSD®.
es: Antes de comenzar, hay algunas cosas que debería checar para asegurarse que su sistema está listo para instalar PC-BSD®.

source: **Are you dual-booting or installing over the entire drive?** If you are dual-booting you will need to ensure that you have a primary partition available. Refer to the section on :ref:`Dual Booting`.
es: **Está haciendo arranque dual o instalando sobre el disco completo?** Si está haciendo arranque dual, necesitará asegurarse que tiene una partición primaria disponible. Refiérase a la sección de :ref:`Arranque Dual`.

source: **Have you backed up your important data?** Any irreplaceable data, such as emails, bookmarks, or important files and documents should **always** be backed up to an external media, such as a removable drive or another system, **before** installing or upgrading any operating system.
es: **Ha respaldado sus datos importantes?** Cualquier dato irremplazable, como correos electrónicos, marcadores, o archivos importantes y documentos deberían **siempre** ser respaldados en medios externos, como discos removibles u otro sistema, **antes** de instalar o actualizar cualquier sistema operativo.

source: If you wish to determine if your hardware is detected by PC-BSD®, start an installation and click the :ref:`Hardware Compatibility` button in the :ref:`Language Selection Screen`.
es: Si quiere determinar si su hardware es detectado por PC-BSD®, comience una instalación y presione en el botón :ref:`Compatibilidad de Hardware` en la :ref:`Pantalla de Selección de Idioma`.

source: Should you run into an issue with your installation, refer to :ref:`Finding Help`.
es: Si tiene algún problema con su instalación, refiérase a :ref:`Buscando Ayuda`.

source: This section discusses the PC-BSD® hardware requirements, how to prepare the system for installation, and how to obtain and prepare the installation media.
es: Esta sección discute los requerimientos de hardware de PC-BSD®, cómo preparar el sistema para la instalación, y cómo obtener y preparar el medio de instalación.

source: Minimum Requirements
es: Requerimientos Mínimos

source: PC-BSD® has moderate hardware requirements and commonly uses less resources than its commercial counterparts. Before installing PC-BSD®, make sure that your hardware or virtual machine at least meets the minimum requirements. To get the most out of your PC-BSD® experience, use a system that meets the recommended system requirements.
es: PC-BSD® tiene requerimientos moderados de hardware y comúnmente usa menos recursos que sus contrapartes comerciales. Antes de instalar PC-BSD®, asegúrese que su hardware o máquina virtual cuente con al menos los requerimientos mínimos. Para sacar el mayor provecho de su experiencia con PC-BSD®, use un sistema que cumpla con los requerimientos recomendados para el sistema.

source: At a **bare minimum** you need to meet these requirements in order to install PC-BSD®:
es: Como **mínimo** usted necesita cumplir con los siguientes requerimientos para poder instalar PC-BSD®:

source: 64-bit processor
es: Procesador de 64-bits

source: 20GB of free hard drive space on a primary partition for a TrueOS® server installation
es: 20 GB de espacio libre en el disco duro en una partición primaria para una instalación de servidor TrueOS®

source: Network card
es: Tarjeta de Red

source: 4 GB of RAM
es: 4 GB de RAM

source: 50GB of free hard drive space on a primary partition for a desktop installation
es: 50 GB de espacio libre en el disco duro en una partición primaria para una instalación de escritorio

source: Sound card
es: Tarjeta de Sonido

source: NVIDIA 3D-accelerated video card
es: Tarjeta de video NVIDIA con aceleración 3D

source: The PC-BSD® installer's hardware check will display a warning message if the selected partition contains less than 20GB for a server installation or less than 50GB for a desktop installation. The installation itself does not require this much disk space. Instead, the minimum recommendation is to provide sufficient room for the installation of multiple desktops, applications, and to store local ZFS snapshots and boot environments.
es: El comprobador de hardware del instalador de PC-BSD® mostrará un mensaje de alerta si la partición seleccionada contiene menos de 20 GB para una instalación de servidor o menos de 50 GB para una instalación de escritorio. La instalación misma no requiere esta cantidad de espacio en disco. En su lugar, la recomendación mínima es para proveer espacio suficiente para la instalación de multiples escritorios, aplicaciones, y para guardar las instantáneas locales de ZFS y entornos de arranque.

source: Supported Hardware
es: Hardware Soportado

source: Like most open source operating systems, PC-BSD® uses X.org drivers for graphics support. PC-BSD® will automatically detect the optimal video settings for supported video drivers. You can verify that your graphics hardware is supported by clicking the :ref:`Hardware Compatibility` icon within the installer.
es: Como la mayoría de sistemas operativos open source, PC-BSD® usa los controladores X.org para el soporte gráfico. PC-BSD® automáticamente detectará la configuración óptima de video para los controladores soportados. Puede verificar que su hardware de gráficos está soportado presionando el icono :ref:`Compatibilidad de Hardware` dentro del instalador.

source: Support for the major graphic vendors is as follows:
es: El soporte para los grandes fabricantes de gráficos es como sigue:

source: **NVIDIA:** if you want to use 3D acceleration, NVIDIA is currently the best supported as there is a native driver for PC-BSD®. If an NVIDIA video card is detected, an "nVidia settings" icon will be added to the Control Panel for managing NVIDIA settings.
es: **NVIDIA:** Si quiere usar aceleración 3D, NVIDIA es actualmente el mejor soportado ya que existe un controlador nativo para PC-BSD®. Si una tarjéta gráfica NVIDIA es detectada, un icono "Configuraciones nVidia" se añadirá al Panel de Control para gestionar las configuraciones de NVIDIA.

source: **Intel:** 3D acceleration on most Intel graphics is supported.
es: **Intel:** La aceleración 3D en la mayoría de las tarjetas gráficas intel está soportada.

source: **ATI/Radeon:** 3D acceleration on most ATI and Radeon cards is supported.
es: **ATI/Radeon:** La aceleración 3D en la mayoría de las tarjetas ATI y Radeon está soportada.

source: **Optimus:** at this time there is no switching support between the two graphics adapters provided by Optimus. Optimus implementations vary, so PC-BSD® may or may not be able to successfully load a graphics driver on your hardware. If you get a blank screen after installation, check your BIOS to see if it has an option to disable one of the graphics adapters or to set "discrete" mode. If the BIOS does not provide a discrete mode, PC-BSD® will default to the 3D Intel driver and disable NVIDIA. This will change in the future when the NVIDIA driver supports Optimus.
es: **Optimus:** en este momento no hay soporte para cambiar entre dos adaptadores gráficos proveídos por Optimus. Las implementaciones de Optimus varían, así que PC-BSD® puede o no cargar satisfactoriamente un controlador gráfico en su hardware. Si obtiene una pantalla negra después de la instalación, cheque su BIOS para ver si tiene una opción para deshabilitar uno de los adaptadores gráficos o para poner el modo "discreto". Si el BIOS no proporciona un modo discreto, PC-BSD® pondrá por defecto el controlador Intel 3D y deshabilitará NVIDIA. Esto cambiará en el futuro cuando el controlador NVIDIA soporte Optimus.

source: PC-BSD® will automatically detect available wireless networks for supported wireless devices. You can verify that your device is supported by clicking the :ref:`Hardware Compatibility` icon within the installer. If it an external wireless device, insert it before running the "Hardware Compatibility" utility.
es: PC-BSD® detectará automáticamente las redes inalámbricas disponibles para los dispositivos inalámbricos soportados. Puede verificar que su dispositivo está soportado presionando en el icono :ref:`Compatibilidad de Hardware` dentro del instalador. Si cuenta con un dispositivo inalámbrico externo, insértelo antes de arrancar la utilería "Compatibilidad de Hardware".

source: Certain Broadcom devices, typically found in cheap laptops, are quite buggy and can have lockups when in DMA mode. If the device freezes, try switching to "PIO" mode in the BIOS. Alternately, add the line *hw.bwn.usedma=0* to :file:`/boot/loader.conf` and reboot to see if that makes a difference.
es: Ciertos dispositivos Broadcom, comúnmente encontrados en portátiles baratas, son algo problemáticas y pueden tener bloqueos en el modo DMA. Si el dispositivo se congela, intente cambiar al modo "PIO" en el BIOS. Alternativamente, añada la línea *hw.bwn.usedma=0* al archivo :file:`/boot/loader.conf` y reinicie para ver si marca una diferencia.

source: Laptops
es: Portátiles

source: Many PC-BSD® users successfully run PC-BSD® on their laptops. However, depending upon the model of laptop, you may run across some issues. These typically deal with:
es: Muchos usuarios de PC-BSD® corren satisfactoriamente PC-BSD® en sus portátiles. De cualquier modo, dependiendo del modelo de su portátil, puede encontrarse con algunos problemas. Estos típicamente tienen que ver con:

source: **Internal wireless:** some chipsets do not have a FreeBSD driver yet.
es: **Red Inalámbrica Interna:** algunos chipsets no tienen aún un controlador FreeBSD.

source: **Optimus graphics:** the current workaround is to disable Optimus in the BIOS, set the onboard Intel video to be dominant, or to change the graphics mode to discrete.
es: **Gráficos Optimus:** la solución actual es deshabilitar Optimus en el BIOS, ponga el video integrado Intel como el dominante, o cambie el modo gráfico a discreto.

source: If you wish to test your laptop's hardware, use the "Hardware Compatibility" icon in the :ref:`Language Selection Screen` before continuing with the installation.
es: Si quiere probar el hardware de su portátil, use el icono "Compatibilidad de Hardware" en la :ref:`Pantalla de Selección de Idioma` antes de continuar con la instalación.

source: The `FreeBSD Tuning Power Consumption page <https://wiki.FreeBSD.org/TuningPowerConsumption>`_ has some tips for reducing power consumption.
es: La página de `Ajustes de Consumo de Energía en FreeBSD <https://wiki.FreeBSD.org/TuningPowerConsumption>`_ tiene algunos tips para reducir el consumo de energía.

source: With regards to specific hardware, the ThinkPad T420 may panic during install. If it does, go into the BIOS and set the video mode to "discrete" which should allow you to complete an installation. Some Thinkpads have a BIOS bug that prevents them from booting from GPT labeled disks. If you are unable to boot into a new installation, restart the installer and go into "Advanced Mode" in the :ref:`Disk Selection Screen`. Make sure that the "Partition disk with GPT" box is unchecked. If it was checked previously, redo the installation with the box unchecked.
es: Con referencia a hardware específico, la ThinkPad T420 puede colgarse durante la instalación. Si lo hace, vaya al BIOS y ponga el modo de video en “discreto”, lo cuál deberá ayudarle a completar la instalación. Algunas Thinkpads tienen un error en el BIOS que evita que arranquen desde discos marcados como GPT. Si no es capaz de arrancar en una nueva instalación, reinicie el instalador y vaya a “Modo Avanzado” en la :ref:`Pantala de Selección de Disco`. Asegúrese que la casilla “Particionar disco con GPT” esté deshabilitada. Si estaba habilitada previamente, vuelva a instalar con la casilla deshabilitada.

source: Touch Screens
es: Pantallas Táctiles

source: PC-BSD® should automatically detect USB-based touch screen devices. If your display is USB and is not auto-detected, send the output of :command:`usbconfig` and your :file:`/etc/X11/xorg.conf` file using the :ref:`Report a bug` tool.
es: PC-BSD® debe detectar automáticamente los dispositivos de pantalla táctil basados en USB. Si su pantalla es USB y no se auto detecta, mande la salida del comando :command:`usbconfig` y su archivo :file:`/etc/X11/xorg.conf` usando la herramienta :ref:`Reporte un bug`.

source: Creating Free Space
es: Creando Espacio Libre

source: If you wish to dual-boot PC-BSD® with an existing operating system, you must first make sure that there is either a free partition or an area of free space to install into. For example, if you are currently running a Windows operating system, it will be installed to the entire hard drive. You will need to first shrink the partition that contains the current operating system in order to make room to install PC-BSD®. Shrinking is an operation that retains the current operating system, while reducing the size of its partition. This section demonstrates how to create free space within Windows 7.
es: Si quiere un arranque dual de PC-BSD® con un sistema operativo existente, primero debe asegurarse que hay o una partición libre o un área de espacio libre para instalar. Por ejemplo, si actualmente corre el sistema operativo Windows, éste estará instalado en todo el disco duro. Primero necesitará reducir la partición que contiene el sistema operativo actual para poder hacer espacio a la instalación de PC-BSD®. Reducir es una operación que retiene el sistema operativo actual, mientras se reduce el tamaño de su partición. Esta sección demuestra como crear espacio libre en Windows 7.

source: **before** shrinking a partition, make sure that you first back up your valuable data to an external media such as a removable USB drive!
es: **Antes** de reducir la partición, asegúrese que primero ha respaldado sus datos importantes en un medio externo como un disco USB removible!

source: To shrink the drive, open Computer Management and click :menuselection:`Storage --> Disk Management`. In the example shown in :numref:`Figure %s: Viewing Disk Layout in Disk Management <partition1>`, the Windows system has three partitions: a 16GB recovery partition, a 100MB system partition, and a 450GB data partition.
es: Para reducir el disco, abra Administración de Equipo y presione :menuselection:`Almacenamiento --> Administración de Disco`. En el ejemplo mostrado en :numref:`Figura %s: Viendo el Diseño del Disco en el Administrador de Disco <partition1>`, el sistema Windows tiene tres particiones: una partición de recuperación de 16 GB, una partición del sistema de 100 MB, y una partición de datos de 450 GB.

source: In this example, 321089MB of space is available. To divide the partition between Windows and PC-BSD®, change that number to *230000* and click the "Shrink" button. When finished, the newly created free space will be displayed, as seen in :numref:`Figure %s: Disk Now Has Free Space <shrink2>`.
es: En este ejemplo, 321089 MB de espacio están disponibles. Para dividir la partición entre Windows y PC-BSD®, cambie ese número a *230000* y presione el botón "Reducir". Cuando termine, el nuevo espacio libre creado se mostrará, como se ve en la :numref:`Figura %s: El Disco Ahora Tiene Espacio Libre <shrink2>`.

source: it is important that you **do not** choose to install PC-BSD® into any of the three Windows partitions when you get to the :ref:`Disk Selection Screen` of the installer. It is a good idea to write down the sizes of all of the partitions so that you will recognize the free space when the PC-BSD® installer displays your current partitions.
es: Es importante que usted **no** elija instalar PC-BSD® en ninguna de estas tres particiones de Windows cuando llegue a la :ref:`Pantalla de Selección de Disco` del instalador. Es una buena idea escribir los tamaños de todas las particiones para que reconozca el espacio libre cuando el instalador de PC-BSD® muestre sus particiones actuales.

source: Obtaining PC-BSD®
es: Obtener PC-BSD®

source: PC-BSD® version numbers are similar to those used by FreeBSD. In addition, PC-BSD® provides two branches. The branch that you choose to install or upgrade to determines when you will receive updates as new features and drivers are added to the operating system. Downloadable image names include the version number, where |version| is the most recent version, and either the word :file:`RELEASE` or :file:`STABLE`, where:
es: Los números de versión de PC-BSD® son similares a los usados por FreeBSD. Adicionalmente, PC-BSD® proporciona dos ramas. La rama que escoja para instalar o actualizar determinará cuándo recibirá actualizaciones tan pronto como nuevas características y controladores sean añadidos al sistema operativo. Los nombres de las imágenes para descargar incluyen el número de la versión, donde |version| es la versión más reciente, y las palabras :file:`RELEASE` o :file:`STABLE`, donde:

source: **RELEASE:** indicates that new drivers and features will not be added to the operating system until the next RELEASE version becomes available and the user upgrades to that new version. If reliability is more important to you than new features or drivers, use the RELEASE version.
es: **RELEASE:** indica que nuevos controladores y características no serán añadidas al sistema operativo hasta que la próxima versión RELEASE esté disponible y el usuario actualice a esa nueva versión. Si la confiabilidad es más importante para usted que las nuevas características o controladores, use la versión RELEASE.

source: **STABLE:** around the 1st of each month, :ref:`Update Manager` will provide a patch which will update the operating system to include all of the new features and drivers. If you wish to have or test the latest features and drivers as they become available and can tolerate possible breakage caused by new features being available before the next RELEASE, use the STABLE version.
es: **STABLE:** alrededor del día 1° de cada mes, el :ref:`Administrador de Actualizaciones` proporcionará un parche que actualizará el sistema operativo para incluir todas las nuevas características y controladores. Si quiere tener o probar las últimas novedades y características en cuanto estén disponibles y puede tolerar los posibles errores causados por las nuevas características disponibles antes de la siguiente RELEASE, use la versión STABLE.

source: Several types of files are available for download. Before downloading a file, review the following descriptions to see which one best suits your needs:
es: Diferentes tipos de archivos están disponibles para descarga. Antes de descargar un archivo, revise las siguientes descripciones para ver cuales se ajustan mejor a sus necesidades:

source: Files beginning with :file:`PCBSD` and ending in :file:`DVD-USB.iso` contain all of the information needed to install a graphical desktop or command-line server as well as several applications during installation. This type of file can either be burned to a DVD media or a USB thumb drive. There will also be associated files with the same name but ending in a :file:`.md5` or :file:`.sha256` extension. Depending upon your current operating system and its tools, you can use the value in either one of those files to determine the integrity of the download, as described in :ref:`Data Integrity Check`. If a torrent is available, there will also be a file with the same name and a :file:`.torrent` extension.
es: Los archivos que comienzan con :file:`PCBSD` y terminan en :file:`DVD-USB.iso` contienen toda la información necesaria para instalar un escritorio gráfico o un servidor con línea de comandos así como algunas aplicaciones durante la instalación. Este tipo de archivo puede ser grabado en un DVD o en un dispositivo USB. También habrá archivos asociados con el mismo nombre pero terminando en una extensión: :file:`.md5` o :file:`.sha256`. Dependiendo de su sistema operativo actual y sus utilerías, puede usar el valor en cada uno de esos archivos para determinar la integridad de la descarga, como se describe en :ref:`Revisando la Integridad de los Datos`. Si un torrent está disponible, también habrá un archivo con el mismo nombre y una extensión :file:`.torrent`.

source: Files beginning with :file:`TrueOS` contain a command-line installer and are used to install a command-line version of a server. This type of file can either be burned to a CD media or a USB thumb drive. There will also be associated files with the same name but ending in a :file:`.md5` or :file:`.sha256` extension. Depending upon your current operating system and its tools, you can use the value in either one of those files to determine the integrity of the download, as described in :ref:`Data Integrity Check`. If a torrent is available, there will also be a file with the same name and a :file:`.torrent` extension.
es: Los archivos que comienzan con :file:`TrueOS` contienen un instalador en línea de comandos y son usados para instalar una versión de línea de comandos de un servidor. Este tipo de archivo puede ser grabado en un CD o en un dispositivo USB. Siempre habrá archivos asociados con el mismo nombre pero terminando en una extensión :file:`.md5` o :file:`.sha256`. Dependiendo de su sistema operativo y sus utilerías, puede usar el valor en cualquiera de esos archivos para determinar la integridad de la descarga, como se describe en :ref:`Revisando la Integridad de los Datos`. Si un torrent está disponible, siempre habrá un archivo con el mismo nombre y la extensión :file:`.torrent`.

source: Files containing :file:`netinstall` in their name are used to perform a network install. These files can be burned to a CD, so are a smaller initial download size. However, they require an Internet connection during installation as the files needed by the installer will be downloaded from the Internet.
es: Los archivos que contienen :file:`netinstall` en su nombre, son usados para realizar una instalación vía red. Estos archivos pueden ser grabados en un CD, ya que son pequeños en su tamaño de descarga. De cualquier forma, requieren una conexión a internet durante la instalación ya que los archivos necesarios por el instalador serán descargados desde la Internet.

source: If you plan to install a graphical desktop, download the file with :file:`PCBSD` in its name and either burn it to a DVD media or write it to a removable USB device.
es: Si planea instalar un escritorio gráfico, descargue el archivo con :file:`PCBSD` en su nombre y grábelo en un DVD o en un dispositivo USB removible.

source: If you prefer to install a command-line only server, you can either download the same ISO or download the ISO with :file:`TRUEOS` in the name. The :file:`TRUEOS` download is smaller and can be burned to a CD or written to a removable USB device.
es: Si prefiere instalar un servidor solamente con línea de comandos, usted puede descargar la misma ISO o descargar la ISO con :file:`TRUEOS` en el nombre. La descarga de :file:`TRUEOS` es menor y puede ser grabada en un CD o en un dispositivo USB removible.

source: Files ending in :file:`.ova` can be used in VirtualBox, as described in :ref:`Using the Downloadable .ova File`.
es: Los archivos que terminan en :file:`.ova` pueden ser usados en VirtualBox, como se describe en :ref:`Usando el Archivo Descargable .ova`.
