Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/update.po
Languages: es

source: The official PC-BSD® package repository is hosted as a `ScaleEngine <http://www.scaleengine.com/>`_ CDN (Content Delivery Network). It is possible to :command:`rsync` a copy of the package repository, which means you can have a locally hosted, complete package repository available for your own clients.
es: El repositorio oficial de paquetes de PC-BSD® está hospedado como un CDN (Content Delivery Network) en `ScaleEngine <http://www.scaleengine.com/>`_. Es posible hacer una copia con :command:`rsync` del repositorio de paquetes, lo que significa que puede tener un repositorio de paquetes completo y hospedado localmente, disponible para sus propios clientes.

source: To create a local package mirror, first setup a directory which is served over HTTP. The web server can be a public URL on the Internet or a private web server, as long as it is accessible to your target audience. Ensure that this directory is browsable by a web browser from a client system **before** moving on to the next step.
es: Para crear un mirror local de paquetes, primero configure un directorio que sea servido por HTTP. El servidor web puede ser una URL pública en el Internet o un servidor web privado, siempre y cuando sea accesible a su audiencia. Asegúrese que este directorio es navegable por el navegador web de un sistema cliente **antes** de seguir con el siguiente paso.

source: Once you have the HTTP directory ready for serving, use the following commands to sync with the official package repository::
es: Una vez que tiene el directorio HTTP listo para ser publicado, use el siguiente comando para sincronizar con el repositorio oficial de paquetes:

source: The complete package repository may be well over 200GB in size. If you do not need the entire repository, you can instead sync the specific version of PC-BSD® packages to pull as shown in these examples::
es: El repositorio completo de paquetes puede bien estar arriba de los 200 GB de tamaño. Si no necesita el repositorio completo, puede entonces sincronizar la versión específica de paquetes de PC-BSD® a descargar como se muestra en estos ejemplos:

source: Note that for major RELEASES, you will pull the *.0* version for the entire branch. In other words, both the 10.1 and 10.2 minor releases use the *10.0-RELEASE* package directory.
es: Note que para RELEASES mayores, usted descargará la versión *.0* para la rama completa. En otras palabras, las dos releases menores 10.1 y 10.2 usan el directorio de paquetes *10.0-RELEASE*.

source: Once the repository is downloaded, configure each client by editing their :file:`/usr/local/etc/pcbsd.conf` file with the following. Replace *<myhost>* with the URL to the local repository::
es: Una vez que el repositorio sea descargado, configure cada cliente editando su archivo :file:`/usr/local/etc/pcbsd.conf` con lo siguiente. Reemplace *<myhost>* con la URL del repositorio local:

source: After editing each client's file, run :command:`pc-updatemanager syncconf` on the client to apply the changes.
es: Después de editar cada archivo de los clientes, ejecute :command:`pc-updatemanager syncconf` en el cliente para aplicar los cambios.

source: Alternately, on each client, configure :ref:`Appcafe®` to use the custom repository. Go to :menuselection:`Configure --> Repository Settings`. Click "Custom" in the screen shown in :numref:`Figure %s: Add the Custom Repository to AppCafe® <repo1>`, then the "+" button. Input the URL to the repository and click "OK".
es: Alternativamente, en cada cliente, configure :ref:`Appcafe®` para usar un respositorio personalizado. Vaya a :menuselection:`Configurar --> Configuración de Repositorio`. Presione "Personalizado" en la pantalla mostrada en la :numref:`Figura %s: Añadiendo el Repositorio Personalizado en AppCafe® <repo1>`, y luego el botón "+". Ingrese la URL del repositorio y presione "OK".

source: It will take a few minutes for AppCafe® to read in the :file:`INDEX` for the custom repository.
es: Le tomará unos minutos a AppCafe® leer en el archivo :file:`INDEX` el repositorio personalizado.

source: Configured clients will now use your local mirror whenever they use :command:`pkg` or AppCafe®.
es: Los clientes configurados ahora usarán su mirror local cada que usen :command:`pkg` o AppCafe®.
