Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/update.po
Languages: es

source: Installing Applications and Keeping PC-BSD® Updated
es: Instalando Aplicaciones y Manteniendo PC-BSD® Actualizado

source: Both PC-BSD® and TrueOS® provide tools to make it easy to manage software and to keep both the operating system and installed software up-to-date. PC-BSD® provides the graphical :ref:`AppCafe®` and :ref:`Update Manager` utilities for managing and upgrading software from the local system or from a web browser or mobile device. Since TrueOS® is a command-line only install and some users prefer to use command-line utilities, both PC-BSD® and TrueOS® provide the :command:`pkg` command line utility to manage software, as well as :command:`pc-updatemanager` to manage updates. If you install software using any of the tools described in this chapter, you will automatically be notified whenever a newer version of software is available.
es: Ambos PC-BSD® y TrueOS® proporcionan herramientas para hacer más fácil el administrar software y mantener al día el sistema operativo y el software instalado. PC-BSD® proporciona las utilerías gráficas :ref:`AppCafe®` y el :ref:`Administrador de Actualizaciones` para gestionar y actualizar el software desde el sistema local o desde un navegador web o dispositivo móvil. Dado que TrueOS® es una instalación solamente en línea de comandos y algunos usuarios prefieren usar utilerías de línea de comandos, ambos PC-BSD® y TrueOS®proporcionan la utilería de línea de comandos :command:`pkg` para administrar software, así como :command:`pc-updatemanager` para administrar actualizaciones. Si instala software usando cualquiera de las herramientas descritas en este capítulo, usted será notificado automáticamente cada que una nueva versión de software está disponible.

source: The rest of this chapter demonstrates how to use the built-in graphical and command-line tools for managing software and upgrades. It also describes how to :ref:`Create a Local Package Mirror`.
es: El resto de este capítulo demuestra como usar las herramientas gráficas y de línea de comandos incluidas para manejar el software y las actualizaciones. También describe como :ref:`Crear un Mirror Local de Paquetes`.

source: AppCafe® provides an intuitive, graphical method for installing and managing software. It provides a graphical front-end to FreeBSD packages, which are pre-built applications that have been tested for FreeBSD. It also provides a front-end to PBIs, which are packages that contain extra meta-data which is displayed in AppCafe®, such as screenshots and lists of similar applications. It also provides graphical jail management, which allows you to run applications which are isolated from the rest of the operating system.
es: AppCafe® proporciona un método intuitivo y gráfico para instalar y administrar software. Proporciona un front-end gráfico a los paquetes de FreeBSD, lo cuales son aplicaciones prefabricadas que han sido probadas para FreeBSD. También proporciona un front-end para PBIs, que son paquetes que contienen metadatos extra que son desplegados en AppCafe®, como capturas de pantalla y listas de aplicaciones similares. También proporciona administración gráfica para jaulas, lo que le permite correr aplicaciones que están aisladas del resto del sistema operativo.

source: AppCafe® does not require the *root* password to install software. This means that you do not have to give out the root password on multi-user systems. However, it will prompt for the user's password and will fail if that user is not a member of the *wheel* group. This allows you to control which users are able to manage software.
es: AppCafe® no requiere la contraseña de *Administrador* para instalar software. Esto significa que usted no tiene que dar la contraseña de administrador en sistemas multiusuarios. De cualquier forma, le pedirá la contraseña de usuario y fallará si ese usuario no es miembro del grupo *wheel*. Esto le permite controlar qué usuarios son capaces de administrar software.

source: If you prefer to manage software from the command line, refer to the section on :ref:`Using the CLI pkg Utilities` . Refer to :ref:`Managing Jails from the CLI` for instructions on how to manage jails from the command line.
es: Si prefiere administrar software desde la línea de comandos, refiérase a la sección :ref:`Usando las Utilerías CLI pkg`.

source: Configuring AppCafe®
es: Configurando AppCafe®

source: AppCafe® includes the ability to remotely manage software and jails from another system or mobile device. During the installation of a TrueOS® server, the installer provides the ability to configure the user, password, and port number for accessing AppCafe® from any device with a web browser. On a desktop installation, AppCafe® can be run as a local application and optionally configured for remote access. To launch the AppCafe® application on a PC-BSD® desktop, double-click its icon on the Desktop, go to :menuselection:`Control Panel --> AppCafe®`, or type :command:`appcafe` from a command prompt. When prompted, input your password. :numref:`Figure %s: Running AppCafe® from a Desktop <remote1c>` shows the initial AppCafe® screen when it is started from a desktop.
es: AppCafe® incluye la habilidad de administrar remótamente software y jaulas desde otro sistema o dispositivo móvil. Durante la instalación de un servidor TrueOS®, el instalador le proporciona la habilidad de configurar el usuario, contraseña, y número de puerto para accesar AppCafe® desde cualquier dispositivo con un navegador web. En una instalación de escritorio, AppCafe® puede ejecutarse como una aplicación local y opcionalmente configurarse para acceso remoto. Para lanzar la aplicación AppCafe® en un escritorio PC-BSD®, haga doble clic en su icono en el Escritorio, vaya a :menuselection:`Panel de Control --> AppCafe®`, o ingrese :command:`appcafe` desde un indicador de comandos. Cuando se le pregunte, ingrese su contraseña. La :numref:`Figura %s: Ejecutando AppCafe® desde un Escritorio <remote1c>` muestra la pantalla inicial de AppCafe® cuando se inicia desde un escritorio.

source: if updates are available for any of the installed applications, an "Updates available" link with a yellow triangle icon will appear. If you click this link it will provide another link that you can click to get details about the update. Note that :ref:`Update Manager` is used to perform the actual update and that you won't be able to add or delete any software while an update is in progress.
es: Si las actualizaciones están disponibles para cualquiera de las aplicaciones instaladas, un enlace de "Actualizaciones Disponibles" con un icono de triángulo amarillo aparecerá. Si presiona este enlace, le proporcionará otro enlace en el que puede presionar para obtener detalles acerca de la actualización. Note que el :ref:`Administrador de Actualizaciones` se usa para realizar la actualización actual y que usted no será capaz de añadir o borrar cualquier software mientras la actualización está en progreso.

source: The top bar contains navigational arrows and a refresh icon. Click the icon at the far right of this bar to access the following options:
es: La barra de arriba contiene las flechas de navegación y un icono de refresco. Presione el icono en el extremo derecho de la barra para accesar a las siguientes opciones:

source: **Configure:** used to configure the package repository and remote access to AppCafe®.
es: **Configurar:** usado para configurar el repositorio de paquetes y acceso remoto a AppCafe®.

source: **Save Pkg List:** click this option to generate a list of the installed PBIs. A pop-up message will indicate the path to the file containing the list.
es: **Guardar Lista de Paquetes:** presione esta opción para generar una lista de los PBIs instalados. Un mensaje emergente indicará la ruta al archivo que contiene la lista.

source: **Search for Text:** opens a search bar where you can input the name of an application. This is useful for quickly navigating to an application listed on the current screen.
es: **Búsqueda por Texto:** abre una barra de búsqueda donde puede ingresar el nombre de una aplicación. Esto es útil para llegar rápidamente a una aplicación listada en la pantalla actual.

source: **Close AppCafe:** used to exit this application.
es: **Cerrar AppCafe:** usado para salir de esta aplicación.

source: :numref:`Figure %s: Configuring the AppCafe® Repository <remote2a>` shows the menu that appears if you click the "Configure" option.
es: La :numref:`Figura %s: Configurando el Repositorio de AppCafe® <remote2a>` muestra el menú que aparece si presiona en la opción "Configuración".

source: The "Repository Configuration" tab is used to determine which package set to use, where:
es: La pestaña de "Configuración del Repositorio" se usa para determinar qué set de paquetes usar, donde:

source: **Enterprise:** this package set is meant for enterprise users that wish to only receive software updates which fix known security vulnerabilities.
es: **Enterprise:** este set de paquetes está pensado para usuarios empresariales que solamente quieren recibir actualizaciones de software que arreglan vulnerabilidades de seguridad conocidas.

source: **Production:** is the default and recommended setting for most users. Software updates are provided every three months, which gives sufficient time for new software versions to be tested.
es: **Producción:** es el predeterminado y la configuración recomendada para la mayoría de los usuarios. Las actualizaciones de software se proporcionan cada tres meses, lo que da suficiente tiempo para que nuevas versiones de software sean probadas.

source: **Edge:** is meant for users who wish to assist with software testing or who can tolerate the occasional breakage caused by installing new software versions. Software updates are provided approximately every two weeks.
es: **Edge:** está pensado para usuarios que quieren ayudar probando software o que pueden tolerar caídas ocasionales causadas por instalar nuevas versiones de software. Las actualizaciones de software se proporcionan aproximadamente cada dos semanas.

source: **Custom:** assumes that you have followed the instructions to :ref:`Create a Local Package Mirror` and are ready to click the "+" button to browse to the location of the custom :file:`.rpo` file. To allow switching between custom repositories, multiple custom repositories can be listed, but only the one marked as active will be used.
es: **Personalizado:** asume que usted ha seguido las instrucciones para :ref:`Crear un Mirror Local de Paquetes` y está listo para presionar el botón "+" para buscar la localización del archivo :file:`.rpo` personalizado. Para permitir cambiar entre repositorios personalizados, múltiples repositorios personalizados pueden ser listados, pero solo el que esté marcado como activo será usado.

source: To configure remote access, use the "Remote Access" tab shown in :numref:`Figure %s: Configuring Remote Access <remote3>`.
es: Para configurar el acceso remoto, use la pestaña "Acceso Remoto" mostrada en la :numref:`Figura %s: Configurando el Acceso Remoto <remote3>`.

source: Check the box to "Enable AppCafe Remote". Then, input a username and password to use for remote access and select a port number. If the system has a public IP address, be sure to use a hard-to-guess username and password. If you change the port number, make sure it does not conflict with another application running on the system. Click "Apply" to complete the configuration. You will be prompted to input your password to save the configuration.
es: Marque la casilla para "Habilitar AppCafe Remoto". Luego, ingrese un nombre de usuario y contraseña para usar con el acceso remoto y seleccione un número de puerto. Si el sistema tiene una dirección IP pública, asegúrese de usar un nombre de usuario y contraseña difíciles de adivinar. Si cambia el número de puerto, asegúrese de que no hace conflicto con otra aplicación corriendo en el sistema. Presione "Aplicar" para completar la configuración. Se le pedirá que ingrese su contraseña para guardar la configuración.

source: When using AppCafe® to access a system from a public network, it is highly recommended to configure the local firewall to only allow connections over the specified port number and from allowed IP address(es).
es: Cuando use AppCafe® para accesar un sistema desde una red pública, se recomienda ampliamente configurar el cortafuegos local para solamente permitir conexiones bajo el número de puerto especificado y desde las direcciones IP permitidas.

source: AppCafe® uses SSL by default and will automatically create a certificate for this purpose. Once remote access is configured, use :file:`https://` and specify the IP address of the system and configured port number in a web browser. You will then be prompted to input the configured username and password. The AppCafe® interface will load in the web browser. It will be similar to the one shown in :numref:`Figure %s: Running AppCafe® from a Desktop <remote1c>`, except the top navigational buttons and configure button will not be displayed and a "Logout" option will be added to the dark grey bar. Note that AppCafe® will automatically log you out after 60 minutes of inactivity.
es: AppCafe® usa SSL predeterminadamente y creará automáticamente un certificado para este propósito. Una vez que el acceso remoto esté configurado, use :file:`https://` y especifique la dirección IP del sistema y el número de puerto configurado en un navegador web. Entonces se le pedirá que ingrese el usuario y contraseña configurados. La interfaz de AppCafe® se cargará en el navegador. Será similar a la mostrada en la :numref:`Figura %s: Corriendo AppCafe® desde un Escritorio <remote1c>`, excepto por que los botones superiores de navegación y el botón de configuración no se mostrarán y una opción de "Salir" se añadirá a la barra gris oscuro. Note que AppCafe® lo desconectará automáticamente después de 60 minutos de inactividad.

source: The :file:`/usr/local/etc/appcafe.conf` file stores the configuration used by AppCafe® and can be edited in a text editor. By default, the "remote", "port", and "ssl" options are set using the information you provided either during a server installation or using the screen shown in :numref:`Figure %s: Configuring Remote Access <remote3>`. The "mode" option is not set by default, but can be configured by removing the comment symbol (";") from that option and setting its value to either "desktop", "server", or "appliance". Here are the descriptions of the available modes as listed in that file::
es: El archivo :file:`/usr/local/etc/appcafe.conf` guarda la configuración usada por AppCafe® y puede ser editado en un editor de texto. Por defecto, las opciones "remoto", "puerto", y "ssl" se establecen usando la información que usted proporcionó durante la instalación del servidor o usando la pantalla mostrada en la :numref:`Figura %s: Configurando el Acceso Remoto <remote3>`. La opción "modo" no se establece por defecto, pero se puede configurar removiendo el símbolo de comentario (";") de esa opción y estableciendo el valor ya sea a "escritorio", "servidor", o "appliance". Enseguida se muestran las descripciones de los modos disponibles como se listan en ese archivo:

source: Since "appliance" mode restricts the application to jails only, the first time AppCafe® is run in appliance mode, it will go straight to a welcome page offering to create a jail if no jails yet exist on the system.
es: Ya que el modo "appliance" restringe la aplicación solo a jaulas, la primera vez que AppCafe® se ejecuta en modo appliance, irá directo a una página de bienvenida ofreciéndole crear una jaula si no hay ya jaulas existentes en el sistema.

source: The rest of this section describes how to manage software using AppCafe®.
es: El resto de esta sección describe como administrar software usando AppCafe®.

source: Software Management
es: Administración de Software

source: The "Home" tab, seen in :numref:`Figure %s: Running AppCafe® from a Desktop <remote1c>`, is used to browse for available PBIs. Applications which are already installed and which are not required by other applications have a red "X". If you click a red "X", a pop-up message will ask if you would like to uninstall that application. Applications which are not installed have a grey download icon. Click the icon to install that application. Applications which are required by other applications will not display an icon. If you click on that application, a yellow "Required" triangle will be displayed and a "Related" tab will indicate the name of the application(s) which require it.
es: La pestaña "Home", mostrada en la :numref:`Figura %s: Corriendo AppCafe® desde un Escritorio <remote1c>`, se usa para buscar PBIs disponibles. Las aplicaciones que ya están instaladas y las que no se requieren por otras aplicaciones tienen una "X" roja. Si presiona una "X" roja, un mensaje emergente le preguntará si quiere desinstalar dicha aplicación. Las aplicaciones que no están instaladas tienen un icono de descarga gris. Presione el icono para instalar esa aplicación. Las aplicaciones que son requeridas por otras aplicaciones no desplegarán ningún icono. Si presiona en dicha aplicación, se desplegará un triángulo amarillo de "Requerido" y una pestaña de "Relacionados" le indicará el nombre de la aplicación o aplicaciones que la requieren.

source: The "Recommended Applications" section displays applications which are recommended by other PC-BSD® users.
es: La sección de "Aplicaciones Recomendadas" mostrará aplicaciones que son recomendadas por otros usuarios de PC-BSD®.

source: The "Categories" pane lists the available software categories. By default, only the recommended applications for each category are shown. To instead view all of the PBIs for each category, click the "Recommended" button which will change to an "All Apps" button. Click the name of a category to view the available PBIs within that category.
es: El panel "Categorías" lista las categorías de software disponibles. Por defecto, solo las aplicaciones recomendadas para cada categoría se muestran. Para entonces ver todos los PBIs para cada categoría, presione el botón "Recomendados" el cual cambiará a un botón "Todas las Aplicaciones". Presione el nombre de una categoría para ver los PBIs disponibles en esa categoría.

source: To view all of the applications installed on the system, click the "Installed Apps" tab. The applications will be listed in alphabetical order. Click the name of an application to view more information about the application.
es: Para ver todas las aplicaciones instaladas en el sistema, presione la pestaña "Aplicaciones Instaladas". Las aplicaciones se listarán en orden alfabético. Presione en el nombre de una aplicación para ver más información acerca de la aplicación.

source: In the example shown in :numref:`Figure %s: Viewing the Details of an Installed Application <remote4b>`, the user has clicked "Firefox" on a system that has Firefox installed.
es: En el ejemplo mostrado en la :numref:`Figura %s: Viendo los Detalles de una Aplicación Instalada <remote4b>`, el usuario ha presionado "Firefox" en un sistema que tiene Firefox instalado.

source: The information for an application includes the following:
es: La información para una aplicación incluye lo siguiente:

source: Name, version, and icon of the application.
es: Nombre, versión e icono de la aplicación.

source: A hyperlink to the application's website. In this example, clicking "Mozilla" will open the application's website in the user's default web browser.
es: Un hipervínculo al sitio web de la aplicación. En este ejemplo, presionando en "Mozilla" abrirá el sitio web de la aplicación en el navegador web predeterminado del usuario.

source: A hyperlink to the application's information at `freshports.org <http://www.freshports.org/>`_. Click the arrow icon next to "Mozilla" to open the FreshPorts website in the user's default web browser.
es: Un hipervínculo a la información de la aplicación en `freshports.org <http://www.freshports.org/>`_. Presione el icono de flecha junto a "Mozilla" para abrir el sitio web de FreshPorts en el navegador web predeterminado del usuario.

source: A rating of up to five stars. Click the stars to open the PC-BSD® wiki page for the application. If you login to the wiki and hover the mouse over the number of stars to select, it will add your ranking and increment the vote number. If you make a mistake in your vote, refresh the browser, click the "remove" button, and re-select the desired number of stars.
es: Una calificación hasta de cinco estrellas. Presione en las estrellas para abrir la página de la aplicación en el wiki de PC-BSD®. Si ingresa al wiki y pasa el ratón sobre el número de estrellas a seleccionar, añadirá su calificación e incrementará el número de votos. Si comete un error en su voto, refresque el navegador, presione en el botón "eliminar", y vuelva a seleccionar el número deseado de estrellas.

source: User contributed tips and how-tos for the application. Click the blue circle icon to open this wiki page. If you login to the wiki, you can add your own usage tips for the application.
es: Tips contribuidos por los usuarios y COMOs para la aplicación. Presione el icono de circulo azul para abrir esta página wiki. Si ingresa al wiki, puede añadir sus propios tips de uso para la aplicación.

source: The download size.
es: El tamaño de la descarga.

source: Hyperlinks to add an icon for the application to the desktop (on window managers that support desktop icons), to add an entry for the application to the desktop menu for the logged on user only (on window managers that provide desktop menus), or to add an entry to the desktop menu of all users.
es: Hipervínculos para añadir un icono para la aplicación en el escritorio (en gestores de ventanas que soportan iconos en el escritorio), para añadir una entrada para la aplicación en el menú de escritorio para el usuario conectado solamente (en gestores de ventanas que proporcionan menús de escritorio), o para añadir una entrada para el menú de escritorio de todos los usuarios.

source: An icon indicating whether or not the application is already installed, can be installed, or is required by another application.
es: Un icono indicando si la aplicación está ya instalada o no, si puede instalarse, o si es requerida por otra aplicación.

source: A description of the application.
es: Una descripción de la aplicación.

source: The following tabs may also be displayed. If a tab is not displayed, it means that that information is not currently available for this particular application.
es: Las pestañas siguientes también pueden mostrarse. Si una pestaña no se muestra, significa que la información no está disponible actualmente para esta aplicación en particular.

source: **Screenshots:** click a screenshot to view a larger version of the screenshot.
es: **Capturas de Pantalla:** presione una captura de pantalla para ver una versión más grande de la captura de pantalla.

source: **Related:** provides an installable list of applications that provide similar functionality.
es: **Relacionado:** proporciona una lista instalable de aplicaciones que proporcionan funcionalidad similar.

source: **Plugins:** provides an installable list of associated plugins. For an example, search for "firefox" and open its "Plugins" tab.
es: **Plugins:** proporciona una lista instalable de plugins asociados. Por ejemplo, busque por "firefox" y abrirá su pestaña de "Plugins".

source: **Options:** shows the values of the make options that the PBI or package was built with.
es: **Opciones:** muestra los valores de las opciones de compilación con las que fue construido el PBI o paquete.
