Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/update.po
Languages: es

source: **Dependencies:** lists the packages that are dependencies of this application.
es: **Dependencias:** lista los paquetes que son dependencias de esta aplicación.

source: The "App Search" tab is shown in :numref:`Figure %s: Searching for Applications <remote5b>`.
es: La pestaña "Búsqueda de Aplicaciones" se muestra en la :numref:`Figura %s: Buscando Aplicaciones <remote5b>`.

source: To find an application, enter its name and click the "binoculars" icon. Alternately, enter a description. For example, a search for "browser" will display software with "browser" in the name as well as applications which provide browser functionality, such as Firefox.
es: Para encontrar una aplicación, escriba su nombre y presione en el icono de los "binoculares". Alternativamente, escriba una descripción. Por ejemplo, una búsqueda por "navegador" le mostrará software con "navegador" en el nombre así como aplicaciones que proporcionan funcionalidad de navegador, como Firefox.

source: By default, only PBIs are searched. To search for all available software, including packages, check the "Search all available PBIs and packages" box.
es: Por defecto, solo los PBIs se buscan. Para buscar por todo el software disponible, incluyendo paquetes, seleccione la casilla "Buscar todos los PBIs disponibles y paquetes".

source: If you install or uninstall any software, a "Status" tab will be added. In the example shown in :numref:`Figure %s: Example Status Tab <appcafe6>`, the firefox application was installed. Click the hyperlink under the "Result" column to review the installation log.
es: Si usted instala o desinstala cualquier software, una pestaña de "Estado" se añadirá. En el ejemplo mostrado en la :numref:`Figura %s: Pestaña de Ejemplo: Estado <appcafe6>`, la aplicación firefox fue instalada. Presione el enlace bajo la columna "Resultado" para revisar el log de la instalación.

source: Beginning with PC-BSD® 10.2, plugins can be used to install a pre-configured, isolated application into its own jail. A `jail <https://en.wikipedia.org/wiki/FreeBSD_jail>`_ provides a very light-weight, operating system-level virtualization. A jail is similar to running an independent instance of FreeBSD on the same hardware, without all of the overhead usually associated with virtualization. Jails are usually created for running applications or services. For example, you could host your own media server on your desktop system without affecting other installed applications or your data. Each jail has its own IP address, running processes, and users. Whatever happens in that jail does not affect your operating system or other jails running on the PC-BSD® system.
es: Comenzando con PC-BSD® 10.2, los plugins pueden ser utilizados para instalar una aplicación preconfigurada, aislada dentro de su propia jaula. Una `jaula <https://en.wikipedia.org/wiki/FreeBSD_jail>`_ proporciona una virtualización a nivel sistema operativo, muy ligera. Una jaula es similar a correr una instancia independiente de FreeBSD en el mismo hardware, sin toda la carga que generalmente se asocia a la virtualización. Las jaulas se crean generalmente para correr aplicaciones o servicios. Por ejemplo, usted puede hospedar su propio servidor de medios en su sistema de escritorio sin afectar otras aplicaciones instaladas o sus datos. Cada jaula tiene su propia dirección IP, corriendo procesos, y usuarios. Lo que sea que pase en esa jaula no afecta a su sistema operativo u otras jaulas corriendo en el sistema PC-BSD®.

source: Plugins use `iocage <https://github.com/iocage/iocage>`_ for managing jails using either the AppCafe® GUI or :command:`iocage` command line utility. iocage was specifically designed for jail management on systems formatted with the ZFS filesystem. It stores its configuration as a ZFS property rather than using a configuration file.
es: Los plugins usan `iocage <https://github.com/iocage/iocage>`_ para administrar las jaulas usando ya sea la GUI de AppCafe® o la utilería de línea de comandos :command:`iocage`. iocage fue diseñando especialmente para la administración de jaulas en sistemas formateados con el sistema de archivos ZFS. Guarda su configuración como una propiedad de ZFS en vez de usar un archivo de configuración.

source: To create, delete, and manage plugins within AppCafe®, click the "Plugins" tab. This will change the entries in the top blue menu bar to the following:
es: Para crear, eliminar, y administrar plugins con AppCafe®, presione la pestaña "Plugins". Esto cambiará las entradas en la barra de menú azul superior a lo siguiente:

source: **Home:** used to return to the Plugins home page.
es: **Inicio:** se usa para regresar a la página de inicio de los plugins.

source: **Installed Plugins:** lists the available plugins. The "download" and red "x" icons indicate which plugins are already installed.
es: **Plugins Instalados:** lista los plugins disponibles. Los iconos "descarga" y la "x" roja indican cuales plugins están ya instalados.

source: **Configuration:** used to configure the range of IP addresses available for use by plugins.
es: **Configuración:** se usa para configurar el rango de direcciones IP disponibles para usar por los plugins.

source: **System Apps:** used to return to the main AppCafe® page so that you can manage packages and PBIs.
es: **Aplicaciones del Sistema:** se usa para regresar a la página principal de AppCafe® para que pueda administrar paquetes y PBIs.

source: **Status:** this tab appears if you have installed or uninstalled any software and contains the logs for each action.
es: **Estado:** esta pestaña aparece si ha instalado o desinstalado cualquier software y contiene los logs para cada acción.

source: The first time you use plugins, the "Configuration" tab shown in :numref:`Figure %s: Initial Plugins Configuration <remote6c>` will prompt you to configure the range of IP addresses on your network that you will reserve for plugins.
es: La primera vez que use plugins, la pestaña "Configuración" mostrada en la :numref:`Figura %s: Configuración Inicial de Plugins <remote6c>` le pedirá configurar el rango de direcciones IP de su red que reservará para plugins.

source: In this example, AppCafe® has detected that the PC-BSD® system is on the *192.168.1.x* network and the user has input a range of available addresses from *192.168.1.5* to *192.168.1.10* and the subnet mask to use. When inputting your own address range and mask, make sure that no other hosts on your network are, or will be, using those reserved addresses. If you have control over the DHCP server in your network, make a reservation for those addresses so that the DHCP server does not assign them to other hosts on your network.
es: En este ejemplo, AppCafe® ha detectado que el sistema PC-BSD® está en la red *192.168.1.x* y el usuario ha ingresado un rango de direcciones disponibles desde *192.168.1.5* a *192.168.1.10* y la máscara de subred a usar. Cuando ingrese su propio rango de direcciones y máscara, asegúrese de que ningún otro equipo en su red está, o estará usando esas direcciones reservadas. Si tiene control sobre el servidor DHCP en su red, reserve esas direcciones para que el servidor DHCP no las asigne a otros equipos en su red.

source: In this example, AppCafe® has also detected that the name of the ZFS pool is *tank*. If you have multiple ZFS pools and would like to specify which one is used for plugins, use the "Plugin zpool" drop-down menu to select the desired pool.
es: En este ejemplo, AppCafe® ha detectado que el nombre del pool ZFS es *tank*. Si tiene múltiples pools ZFS y quiere especificar cuál es usado para plugins, use el menú desplegable "Plugin zpool" para seleccionar el pool deseado.

source: When finished, click "Save". This will open the "Installed Plugins" tab, showing the listing of available plugins. In the example shown in :numref:`Figure %s: List of Available Plugins <remote7a>`, the `Plex Media Server <https://plex.tv/>`_ plugin is available for installation.
es: Cuando termine, presione "Guardar". Esto abrirá la pestaña de "Plugins Instalados", mostrando la lista de plugins disponibles. En el ejemplo mostrado en la :numref:`Figura %s: Lista de Plugins Disponibles <remote7a>`, el plugin del `Servidor de Medios Plex <https://plex.tv/>`_ está disponible para su instalación.

source: at this time, only the Plex Media Server is available as a plugin. More plugins will be added in future updates to PC-BSD®. If you would like to install other, isolated applications, refer to the section on :ref:`Managing Jails from the CLI`.
es: En este momento, solo el Servidor de Medios Plex está disponible como plugin. Más plugins se añadirán en el futuro a PC-BSD®. Si quiere instalar otras aplicaciones aisladas, refiérase a la sección de :ref:`Administrando Jaulas desde la CLI`.

source: Click the plugin's install icon to begin the installation. Installation will take a few minutes as a new jail will be created, the jail will be assigned the next available reserved IP address, and the application will be installed into the jail. Once installed, a screen similar to :numref:`Figure %s: Plugin is Installed <plugin1>` will indicate that the plugin is installed.
es: Presione el icono de instalación del plugin para comenzar la instalación. La instalación tomará unos pocos minutos ya que se creará una jaula, a la cuál se le asignará la siguiente dirección IP reservada, y la aplicación se instalará dentro de la jaula. Una vez instalada, una pantalla similar a la de la :numref:`Figura %s: El Plugin se ha Instalado <plugin1>` le indicará que el plugin se ha instalado.

source: The title bar will indicate the name of the application that was installed and the IP address assigned to the jail where the application was installed. To configure the application, click the hyperlink for the "Plex Web Interface" configuration icon. This will open the configuration screen shown in :numref:`Figure %s: Plugin Configuration <plugin2>`.
es: La barra de título le indicará el nombre de la aplicación que fue instalada y la dirección IP asignada a la jaula donde la aplicación fue instalada. Para configurar la aplicación, presione el vínculo del icono de configuración "Interfaz Web de Plex". Esto abrirá la pantalla de configuración mostrada en la :numref:`Figura %s: Configuración del Plugin <plugin2>`.

source: depending upon the window manager's default web browser, the configuration link may or may not display properly. For example, the default web browser for the KDE window manager is Konqueror, which does not render the configuration page. To change the default web browser within KDE, click :menuselection:`Kickoff --> System Settings --> Default Applications -->Web Browser --> in the following browser` and use the browse button to select another web browser, such as Firefox.
es: Dependiendo del navegador web predeterminado del gestor de ventanas, el enlace de la configuración puede o no podrá desplegarse propiamente. Por ejemplo, el navegador web predeterminado para el gestor de ventanas KDE es Konqueror, que no renderiza la página de configuración. Para cambiar el navegador web predeterminado dentro de KDE, presione :menuselection:`Kickoff --> Configuraciones del Sistema --> Aplicaciones Predeterminadas --> Navegador Web --> en el siguiente navegador` y use el botón de búsqueda para seleccionar otro navegador web, como Firefox.

source: Click the "Agree" button to accept the application's license. You can now configure your channels and playlists. If you are new to Plex, refer to the `Plex Getting Started Guide <https://support.plex.tv/hc/en-us/categories/200007268-Getting-Started>`_.
es: Presione el botón "Aceptar" para aceptar la licencia de la aplicación. Ahora puede configurar sus canales y listas. Si es nuevo con Plex, refiérase a la `Guía de Inicio de Plex <https://support.plex.tv/hc/en-us/categories/200007268-Getting-Started>`_.

source: Managing Jails from the CLI
es: Administrando Jaulas desde la CLI

source: Beginning with PC-BSD® 10.2, :command:`iocage` has been added for jail management and this utility will replace the :command:`warden` utility in a future version of PC-BSD®. Note that :command:`warden` is still available in this version of PC-BSD® to provide time for users to transition to using :command:`iocage`. Documentation for using the command line version of :command:`warden` can be found in `this section of the 10.1.2 User Guide <http://download.pcbsd.org/iso/10.1-RELEASE/amd64/docs/html/controlpanel.html#using-the-command-line-version-of-warden>`_.
es: Comenzando con PC-BSD® 10.2, :command:`iocage` se ha añadido para administrar jaulas y esta utilería reemplazará a la utilería :command:`warden` en una futura versión de PC-BSD®. Note que :command:`warden` sigue estando disponible en esta versión de PC-BSD® para darles tiempo a los usuarios de hacer la transición a :command:`iocage`. La documentación para usar la versión de línea de comandos de :command:`warden` puede encontrarse en `esta sección del Manual de Usuario 10.1.2 <http://download.pcbsd.org/iso/10.1-RELEASE/amd64/docs/html/controlpanel.html#using-the-command-line-version-of-warden>`_.

source: The :command:`iocage` command line utility is a Bourne shell script. This script can be manually run from the command line on a PC-BSD® server or by users who prefer to manage jails using the command line. Advanced users can also refer to the command line version in their own jail management scripts.
es: La utilería de línea de comando :command:`iocage` es un script del Bourne shell. Este script puede correr manualmente desde la línea de comandos de un servidor PC-BSD® o por usuarios que prefieran administrar jaulas usando la línea de comandos. Los usuarios avanzados pueden también referirse a la versión de línea de comandos en sus propios scripts de administración de jaulas.

source: If you type :command:`iocage` at the command line, you will receive a summary of its usage::
es: Si escribe :command:`iocage` en la línea de comandos, recibirá un resumen de su uso:

source: Before creating a jail for the first time, specify the version of FreeBSD to install. To see which versions are available::
es: Antes de crear una jaula por primera vez, especifique la versión de FreeBSD a instalar. Para ver cuáles versiones están disponibles:

source: In this example, FreeBSD 10.1 and 9.3 are available as jail templates and the user has specified to install the 10.1-RELEASE template. Once the template has been installed, you can create a jail. In this example, the template to use, the jail's hostname, network interface, and IP address are specified::
es: En este ejemplo, FreeBSD 10.1 y 9.3 están disponibles como plantillas de jaulas y el usuario ha especificado instalar la plantilla 10.1-RELEASE. Una vez que la plantilla ha sido instalada, usted puede crear una jaula. En este ejemplo, la plantilla a usar, el nombre de equipo de la jaula, la interfaz de red, y la dirección IP se especifican:

source: The output of this command will list the properties of the new jail. You can list those properties with this command::
es: La salida de este comando listará las propiedades de la nueva jaula. Puede listar esas propiedades con el comando:

source: To start the jail and check its status::
es: Para iniciar la jaula y revisar su estado:

source: To access the jail::
es: Para accesar la jaula:

source: Once inside the jail, you can manage it just like any other FreeBSD system and install software using :command:`pkg`. To leave the jail, type :command:`exit`.
es: Una vez dentro de la jaula, puede administrarla como cualquier otro sistema FreeBSD e instalar software usando :command:`pkg`. Para salir de la jaula, escriba :command:`exit`.

source: Using the CLI pkg Utilities
es: Usando las Utilerías CLI pkg

source: PC-BSD® uses :command:`pkg` to manage packages from the command line.
es: PC-BSD® usa :command:`pkg` para administrar paquetes desde la línea de comandos.

source: The `FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/pkgng-intro.html>`_ provides an introduction to using :command:`pkg`. Section 5.4.1 is not needed on a PC-BSD® or TrueOS® system as the operating system installation does this for you. The various :command:`pkg` commands have associated man pages. Type :command:`man pkg` for an overview of general usage; the names of the associated man pages will be found towards the bottom of this man page. Once you know the name of a command, you can also use the built-in help system to get more information about that command. For example, to learn more about :command:`pkg install`, type :command:`pkg help install`.
es: El `Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/pkgng-intro.html>`_ proporciona una introducción al uso de :command:`pkg`. La Sección 5.4.1 no es necesaria en los sistemas PC-BSD® o TrueOS® ya que la instalación del sistema operativo hace esto por usted. Los comandos :command:`pkg` tienen páginas del manual asociadas. Escriba :command:`man pkg` para una vista rápida del uso general; los nombres de las páginas del manual asociadas, se encuentran casi al final de esta página del manual. Una vez que sabe el nombre del comando, también puede usar el sistema de ayuda integrado para obtener mayor información acerca de ese comando. Por ejemplo, para aprender más acerca de :command:`pkg install`, escriba :command:`pkg help install`.

source: Update Manager
es: Administrador de Actualizaciones

source: Update Manager provides a graphical interface for keeping the PC-BSD® operating system and its installed applications up-to-date. Update Manager will automatically track updates to software installed using either the graphical or command line equivalents of :ref:`AppCafe®`.
es: El administrador de actualizaciones proporciona una interfaz gráfica para mantener el sistema operativo PC-BSD® y sus aplicaciones instaladas al día. El administrador de actualizaciones buscará automáticamente actualizaciones para el software instalado usando ya sea el equivalente gráfico o de línea de comandos de :ref:`AppCafe®`.

source: This utility can be started from :ref:`Control Panel` or by typing :command:`pc-updategui`. It can also be accessed from its icon in the system tray, if you are logged into a desktop that provides a system tray.
es: Esta utilería puede iniciarse desde el :ref:`Panel de Control` o escribiendo :command:`pc-updategui`. También puede accesarse desde su icono en la bandeja del sistema, si su sesión de escritorio proporciona una bandeja del sistema.

source: The status of the icon lets you determine at a glance if any of your installed applications are out-of-date, if a system update is available, or if a new version of the operating system is available. The possible statuses are as follows:
es: El estado del icono le permite determinar de un vistazo si cualquiera de sus aplicaciones instaladas están desactualizadas, si una actualización del sistema está disponible, o si una nueva versión del sistema operativo está disponible. Los estados posibles son los siguientes:

source: Your system is up-to-date.
es: Su sistema está al día.

source: The system is currently checking for updates and patches.
es: El sistema está actualmente buscando actualizaciones y parches.

source: Your operating system is out-of-date and system update(s) or patch(es) are available.
es: Su sistema operativo está desactualizado y están disponibles actualizaciones al sistema o parches.

source: Newer versions of installed applications are available.
es: Versiones nuevas de las aplicaciones instaladas están disponibles.

source: The system was unable to check for updates, meaning you should check your Internet connection.
es: El sistema no fue capaz de buscar actualizaciones, significando que debe revisar su conexión de Internet.

source: The system is currently updating.
es: El sistema está actualmente actualizando.

source: The system needs to restart in order for the newly installed update to take effect.
es: El sistema necesita reiniciar para que tenga efecto la nueva actualización instalada.

source: If you right-click the icon, you will see the menu shown in :numref:`Figure %s: Right-click Menu for Update Manager <update8a>`.
es: Si hace clic derecho en el icono, verá el menú mostrado en la :numref:`Figura %s: Menú de Clic Derecho del Administrador de Actualizaciones <update8a>`.

source: This menu contains the following options:
es: Este menú contiene las siguientes opciones:

source: **Start the Update Manager:** launches the Update Manager GUI which can be used as described in :ref:`Manual Updates (GUI Method)`.
es: **Iniciar el Administrador de Actualizaciones:** lanza la interfaz gráfica del administrador de actualizaciones que puede ser usado como se describe en :ref:`Actualizaciones Manuales (Método Gráfico)`.

source: **Check for Updates:** by default, updates are checked every 24 hours or 20 minutes after booting the system. However, the system won't check for updates more than once per day should you reboot multiple times within a day. You can check for updates now by clicking this option.
es: **Revisar Actualizaciones:** por defecto, las actualizaciones son revisadas cada 24 horas o 20 minutos después de arrancar el sistema. Sin embargo, el sistema no revisará las actualizaciones más de una vez al día en caso de que reinicie muchas veces en el día. Puede revisar las actualizaciones ahora presionando en esta opción.

source: **Start the AppCafe:** launches AppCafe® which can be used to manage installed software as described in :ref:`AppCafe®`.
es: **Iniciar AppCafe:** lanza AppCafe® que puede ser usado para administrar software instalado como se describe en :ref:`AppCafe®`.

source: **Run at Startup:** to disable the automatic update check after the system boots, uncheck this box.
es: **Correr al Iniciar:** para deshabilitar la revisión automática de actualizaciones después de que el sistema inicia, desmarque esta casilla.

source: **Display Notifications:** to disable the pop-up message over the icon when an update becomes available, uncheck this box.
es: **Mostrar Notificaciones:** para deshabilitar el mensaje emergente sobre el icono cuando una actualización está disponible, desmarque esta casilla.

source: **Check Jails:** to also be notified when updates are available to running jails, check this box.
es: **Revisar Jaulas:** para también ser notificado cuando las actualizaciones se encuentran disponibles en jaulas activas, marque esta casilla.

source: **Routing through Tor:** check this box to start browsing the Internet anonymously as described in :ref:`Tor Mode`.
es: **Ruteando por Tor:** marque esta casilla para comenzar a explorar internet de forma anónima como se describe en :ref:`Modo Tor`.

source: **Check Tor connection:** click this to determine if the system is currently routing all Internet traffic through the Tor network.
es: **Revisar conexión de Tor:** presione para determinar si el sistema está actualmente ruteando todo el tráfico de internet a través de la red de Tor.

source: **Quit:** to remove Update Manager from the system tray, click this entry. You can put the icon back into the tray by typing :command:`pc-systemupdatertray &`.
es: **Salir:** para eliminar el Administrador de Actualizaciones de la bandeja del sistema, presione en esta entrada. Puede poner el icono de regreso en la bandeja escribiendo :command:`pc-systemupdatertray &`.

source: How PC-BSD® Updating Works
es: Cómo Funciona la Actualización de PC-BSD®
