Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/update.po
Languages: es

source: The PC-BSD® update mechanism provides several safeguards to ensure that updating the operating system or its software is a low-risk operation. Beginning with version 10.1.1, the following steps occur automatically during an update:
es: El mecanismo de actualización de PC-BSD® proporciona varias salvaguardias para asegurarle que la actualización del sistema operativo o su software es una operación de bajo riesgo. Comenzando con la versión 10.1.1, los siguientes pasos ocurren automáticamente durante una actualización:

source: The update automatically creates a copy of the current operating system, known as a snapshot or boot environment (BE), and mounts that snapshot in the background. All of the updates then occur in the snapshot. This means that you can safely continue to use your system while it is updating as no changes are being made to the operating system or any of the applications currently in use. Instead, all changes are being made to the mounted copy.
es: La actualización automáticamente crea una copia del sistema operativo actual, conocido como instantánea o entorno de arranque (BE, por sus siglas en inglés), y monta la instantánea en segundo plano. Entonces todas las actualizaciones ocurren en la instantánea. Esto significa que usted puede seguir usando su sistema de forma segura mientras se está actualizando ya que ningún cambio se está haciendo en el sistema operatico ni en ninguna de las aplicaciones que están actualmente en uso. En vez de eso, todos los cambios se están haciendo en la copia montada.

source: if the system is getting low on disk space and there is not enough space to create a new BE, the update will fail with a message indicating that there is not enough space to perform the update.
es: si el sistema se está quedando sin espacio en el disco y no hay espacio suficiente para crear un nuevo BE, la actualización fallará con un mensaje indicando que no hay espacio suficiente para realizar la actualización.

source: While the update is occurring, and until you reboot after the update, you won't be able to use AppCafe® to manage software. This is a safety measure to prevent package conflicts. Also, the system shutdown and restart buttons will be greyed out until the update is complete and the system is ready for reboot. Should a power failure occur in the middle of an update, the system will reboot into the current boot environment, returning the system to the point before the upgrade started. Simply restart the update to continue the update process.
es: Mientras la actualización ocurre, y hasta que usted reinicie después de la actualización, no podrá usar AppCafe® para administrar el software. Esta es una medida de seguridad para prevenir conflictos entre paquetes. También, los botones de apagado y reinicio se pondrán en gris hasta que la actualización se complete y el sistema esté listo para reiniciar. Si llegara a ocurrir una falla de energía a la mitad de la actualización, el sistema reiniciará dentro del entorno de arranque actual, regresando el sistema al punto anterior al inicio de la actualización. Simplemente reinicie la actualización para continuar el proceso de actualización.

source: Once the update is complete, the new boot environment, or updated snapshot, is added as the first entry in the boot menu and activated so that the system will boot into it, unless you pause the boot menu and specify otherwise. A pop-up message, shown in :numref:`Figure %s: Managing the Reboot After Update <update9>`, will indicate that a reboot is required. You can either finish what you are doing and reboot now into the upgraded snapshot, or ask the system to remind you again at a later time. To configure the time of the next warning, click the "Next Reminder" drop-down menu where you can select 1, 5, 12, or 24 hours, 30 minutes, or never (for this login session). Note that the system will not apply any more updates or allow you to start another manual update or install additional software using AppCafe® until you reboot.
es: Una vez que la actualización se ha completado, el nuevo entorno de arranque, o snapshot actualizada, se añade como la primera entrada en el menú de arranque y se activa para que el sistema pueda arrancar en él, a menos que pause el menú de arranque y especifique otra cosa. Un mensaje emergente, mostrado en la :numref:`Figura %s: Administrando el Arranque Después de la Actualización <update9>`, le indicará que un reinicio es requerido. Usted puede terminar lo que estaba haciendo y reiniciar ahora dentro de la snapshot actualizada, o indicarle al sistema que le recuerde nuevamente en el futuro. Para configurar el tiempo de la siguiente advertencia, presione en el menú desplegable "Siguiente Recordatorio" donde puede elegir 1, 5, 12, o 24 horas, 30 minutos, o nunca (para esta sesión). Note que el sistema no aplicará más actualizaciones ni le permitirá iniciar otra actualización manual ni instalar software adicionale usando AppCafe® hasta que reinicie.

source: As the update is running, a log is written to :file:`/var/log/pc-updatemanager.log` and this log is displayed in the "View Log" tab of the graphical Update Manager utility, shown in :numref:`Figure %s: Viewing the Update Log <update10a>`. This way you can see which software is being updated and if there are any updating errors. The next time an update occurs, the previous log is written to :file:`/var/log/pc-updatemanager.log.prev`, so that you also have a copy of the previous update's log.
es: Mientras la actualización está en proceso, el log se escribe en :file:`/var/log/pc-updatemanager.log` y este log se muestra en la pestaña "Ver Log" de la utilería gráfica Administrador de Actualizaciones, mostrada en la :numref:`Figura %s: Viendo el Log de la Actualización <update10a>`. De esta forma podrá ver qué software está siendo actualizado y si hay cualquier error en la actualización. La próxima vez que ocurra una actualización, el log previo se escribirá en :file:`/var/log/pc-updatemanager.log.prev`, para que pueda tener una copia del log de la actualización previa.

source: You no longer need to initiate updates manually. PC-BSD® now uses an automated updater that automatically checks for updates, no more than once per day, 20 minutes after a reboot and then every 24 hours. You can configure what gets updated using the "Configure Automatic Updates" tab of Update Manager, shown in :numref:`Figure %s: Configuring What to Update <update11a>`. Choices are "Security & Packages" (all updates), "Security" (only security patches and operating system updates), "Packages" (only installed software), or "Nothing" (disables automatic updating).
es: Usted ya no tiene que iniciar actualizaciones manualmente. PC-BSD® ahora usa un actualizador automatizado que checa automáticamente por actualizacions, no más de una vez al día, 20 minutos después de un reinicio y después cada 24 horas. Usted puede configurar que se actualizará usando la pestaña "Configurar Actualizaciones Automáticas" del Administrador de Actualizaciones, mostrado en la :numref:`Figura %s: Configurando Qué Actualizar <update11a>`. Las opciones son "Seguridad y Paquetes" (todas las actualizaciones), "Seguridad" (solo parches de seguridad y actualizaciones del sistema operativo), "Paquetes" (solo software instalado), o "Nada" (deshabilita las actualizaciones automáticas).

source: The "View" menu of Update Manager provides the following information:
es: El menú "Vista" del Administrador de Actualizaciones proporciona la siguiente información:

source: **Vulnerabilities:** click this entry to determine if any of the installed software has a known, unpatched vulnerability. In the example shown in :numref:`Figure %s: Viewing Installed Software Vulnerability Information <update14>`, two installed packages have known vulnerabilities. If you highlight an entry and click the "More info..." button, the default web browser will open to a page that provides more details about the vulnerability.
es: **Vulnerabilidades:** presione esta entrada para determinar si cualquiera del software instalado tiene vulnerabilidades conocidas o sin parchar. En el ejemplo mostrado en la :numref:`Figura %s: Viendo la Información de Vulnerabilidades del Software Instalado <update14>`, dos paquetes instalados tienen vulnerabilidades conocidas. Si selecciona una entrada y presiona el botón "Más información...", el navegador web predeterminado se abrirá en una página que proporciona más detalles acerca de la vulnerabilidad.

source: **Base updates history:** the "Version" field in :ref:`About` usually includes a patch number which indicates the level to which the operating system has been patched against known vulnerabilities. If you click this entry, it will provide an overview of which vulnerabilities were addressed at each patch level. In the example shown in :numref:`Figure %s: Viewing Operating System Patches <update15>`, the system is running "10.1-RELEASE-p20, or patch level 20. Most patch levels have an associated Security Advisory (SA). More information about each advisory is available from the `FreeBSD Security Advisories page <https://www.freebsd.org/security/advisories.html>`_.
es: **Historial de actualizaciones base:** el campo "Versión" en :ref:`About` casi siempre incluye un número de parche que indica el nivel al que el sistema operativo ha sido parchado contra vulnerabilidades conocidas. Si presiona en esta entrada, se le proveerá un resumen de qué vulnerabilidades fueron tratadas en cada nivel del parche. En el ejemplo mostrado en la :numref:`Figura %s: Viendo los Parches al Sistema Operativo <update15>`, el sistema está corriendo "10.1-RELEASE-p20" o nivel de parche 20. La mayoría de los niveles de parche tienen asocuado un Aviso de Seguridad (SA). Más información sobre cada aviso está disponible en la `Página de Avisos de Seguridad de FreeBSD <https://www.freebsd.org/security/advisories.html>`_.

source: The "System" menu of Update Manager provides one option:
es: El menú "Sistema" del Administrador de Actualizaciones proporciona una opción:

source: **Branches:** users who wish to test upcoming versions can switch software branches and update to that software branch. In the example shown in :numref:`Figure %s: Switching Branches <branch1>`, this system is currently running the 10.1* branch and the upcoming 11.0 branch is available for selection.
es: **Ramas:** los usuarios que quieran probar nuevas versiones pueden cambiar las ramas del software y actualizar a la misma. En el ejemplo mostrado en la :numref:`Figura %s: Cambiando Ramas <branch1>`, este sistema actualmente está corriendo la rama 10.1* y la próxima rama 11.0 está disponible.

source: Updates can still be initiated manually using either a GUI or a command-line application. The rest of this section demonstrates how to manually update using either the GUI or the command-line method.
es: Las actualizaciones pueden ser iniciadas manualmente usando ya sea una aplicación gráfica o de línea de comandos. El resto de esta sección demuestra como actualizar manualmente usando ya sea el método gráfico o el de línea de comandos.

source: Manual Updates (GUI Method)
es: Actualizaciones Manuales (Método Gráfico)

source: Beginning in version 10.1.1, the automatic updater will automatically keep your system up-to-date. You will know that an update has completed when the pop-up menu, shown in :numref:`Figure %s: Managing the Reboot After Update <update9>`, indicates that a reboot is needed to complete the update process. The automatic updater will only update what it has been configured to update. If you would like to double-check or change what gets updated, start Update Manager, enter your password, and use the drop-down menu in the "Configure Automatic Updates" screen shown in :numref:`Figure %s: Configuring What to Update <update11a>`.
es: Comenzando con la versión 10.1.1, el actualizador automático mantendrá actualizado su sistema. Usted sabrá que una actualización se ha completado cuando el menú emergente, mostrado en la :numref:`Figura %s: Administrando el Reinicio después de la Actualización <update9>`, indique que un reinicio es necesario para completar el proceso de actualización. El actualizador automático solo actualizará para lo que está configurado. Si quiere revisar o cambiar lo que se actualiza, inicie el Administrador de Actualizaciones, ingrese su contraseña, y use el menú desplegable en la pantalla "Configurar Actualizaciones Automáticas" mostrada en la :numref:`Figura %s: Configurando Qué Actualizar <update11a>`.

source: Due to its schedule, the automatic updater will never check for new updates more than once in a 24 hour period. To manually check for updates, right-click the Update Manager in system tray and click "Check for Updates". Alternatively, start Update Manager. If any updates are available, an "Updates Available" tab will appear, as seen in the example in :numref:`Figure %s: Updates are Available <update12a>`. If no updates are available, of if the system is currently updating, this tab will not appear.
es: Debido a su programación, el actualizador automático nunca revisará por nuevas actualizaciones más de una vez en un periodo de 24 horas. Para revisar actualizaciones manualmente, haga clic derecho en el Administrador de Actualizaciones en la bandeja del sistema y presione la pestaña "Revisar Actualizaciones". Alternativamente, inicie el Administrador de Actualizaciones. Si hay actualizaciones disponibles, una pestaña de "Actualizaciones Disponibles" aparecerá, como se muestra en el ejemplo de la :numref:`Figura %s: Actualizaciones Disponibles <update12a>`. Si no hay actualizaciones disponibles, o si el sistema se encuentra actualizando, esta pestaña no aparecerá.

source: In this example, a security update is available. Click the "Start Updates" button to manually start the update. When prompted, reboot so that the system can boot into the newly patched operating system.
es: En este ejemplo, una actualización de seguridad se encuentra disponible. Presione el botón "Comenzar Actualizaciones" para manualmente comenzar la actualización. Cuando se le indique, reinicie para que el sistema pueda arrancar dentro del recién parchado sistema operativo.

source: When package updates are available a "View Package Updates" box can be clicked to see which packages will be upgraded.
es: Cuando están disponibles actualizaciones de paquetes, la casilla "Ver Actualizaciones de Paquetes" puede ser seleccionada para ver cuáles paquetes serán actualizados.

source: how often package updates are available depends upon the "Repository Settings" set in :menuselection:`AppCafe® --> Configure`. The default setting of "Production" will only provide package updates every 3 months whereas a setting of "Edge" will provide package updates as soon as a new version is available. If you need application stability, stay on "Production". If you can handle some application breakage in favor of having the latest software, change to "Edge". Also, if you select "Security" or "Nothing" in the "Configure Automatic Updates" tab of Update Manager, packages will only get updated with the next software release which happens every 3 months.
es: qué tan seguido hay disponibles actualizaciones de paquetes dependerá de las "Configuraciones del Repositorio" en :menuselection:`AppCafe® --> Configuración`. La configuración predeterminada de "Producción" solamente proporcionará actualizaciones a paquetes cada 3 meses mientras que la configuración de "Edge" proporcionará actualizaciones a paquetes tan pronto como una nueva versión esté disponible. Si necesita estabilidad en la aplicación, manténgase en "Producción". Si puede permitir algunas caídas o fallos en la aplicación en favor de contar con la última versión, cambie a "Edge". También, si selecciona "Seguridad" o "Nada" en la pestaña "Configurar Actualizaciones Automáticas" del Administrador de Actualizaciones, los paquetes solamente se actualizarán con la siguiente liberación de software, la cual sucede cada 3 meses.

source: updates will update **all** installed software. If you have placed a lock on a package using :command:`pkg` or an older version of AppCafe®, Update Manager will fail and will generate a message in the log indicating that the failure is due to a locked package. If you prefer to lock certain applications against being updated, select "Security" or "Nothing" in the "Configure Automatic Updates" tab of Update Manager and manually update software as needed using :command:`pkg`.
es: Las actualizaciones actualizarán **todo** el software instalado. Si ha colocado un candado en un paquete usando :command:`pkg` o con una versión anterior de AppCafe®, el Administrador de Actualizaciones fallará y generará un mensaje en el log, indicando que la falla se debe a un paquete bloqueado. Si prefiere bloquear ciertas aplicaciones para que no sean actualizadas, seleccione "Seguridad" o "Nada" en la pestaña "Configurar Actualizaciones Automáticas en el Administrador de Actualizaciones y actualice manualmente el software necesario usando :command:`pkg`.

source: Manual Updates (CLI Method)
es: Actualizaciones Manuales (Método CLI)

source: TrueOS® users, or those who prefer to use a command-line utility, can use :command:`pc-updatemanager` to manually apply updates. If you type :command:`pc-updatemanager`, it will show its available options::
es: Los usuarios de TrueOS®, o los que prefieran usar la utilería de línea de comando, pueden usar :command:`pc-updatemanager` para aplicar manualmente las actualizaciones. Si escribe :command:`pc-updatemanager`, mostrará sus opciones disponibles:

source: To determine if any system updates are available, type the following command::
es: Para determinar si hay actualizaciones del sistema disponibles, ingrese el siguiente comando:

source: If any updates are available, follow the instructions to install the update::
es: Si cualquier actualización está disponible, siga las instrucciones para instalar la actualización:

source: If no updates are available, the **check** command will indicate "Your system is up to date!".
es: Si no hay actualizaciones disponibles, el comando **check** indicará "Su sistema está al día!".

source: To determine if package updates are available, use this command::
es: Para determinar si hay actualizaciones disponibles para paquetes, use este comando:

source: In this example, newer versions are available. If no updates were available, the output would have instead said "All packages are up to date!".
es: En este ejemplo, existen versiones nuevas disponibles. Si no hubiera actualizaciones, la salida entonces diría "Todos los paquetes están al día!".

source: If updates are available, you can install them with this command::
es: Si las actualizaciones están disponibles, puede instalarlas con este comando:

source: While the package output has been snipped from this example due to the amount of packages to be upgraded, the update process will download the latest versions of the packages which need updating, displaying the download progress for each file. Once the downloads are complete, it will create a new boot environment and display the installation process for each file within the boot environment. The last step of the update process is to extract the desktop (or server) overlay and upgrade GRUB and then to return the prompt. Once the update is complete, reboot to boot into the updated version of the system.
es: Mientras que la salida del paquete ha sido cortada de este ejemplo debido a la cantidad de paquetes por ser actualizados, el proceso de actualización descargará las últimas versiones de los paquetes que necesitan actualizaciones, mostrando el progreso de la descarga para cada archivo. Una vez que las descargas se han completado, se creará un nuevo entorno de arranque y mostrará el proceso de instalación para cada archivo dentro del entorno de arranque. El último paso del proceso de actualización es extraer la capa de escritorio (o servidor) y actualizar GRUB y después regresar el indicador de comandos. Una vez que la actualización se ha completado, reinicie para arrancar dentro de la versión actualizada del sistema.

source: Upgrading from 9.x to 10.x
es: Actualizando de 9.x a 10.x

source: PC-BSD® 10.x has switched to 64-bit and ZFS-only. This means that you can **not** upgrade a system that is either 32-bit or formatted with UFS. If the hardware supports 64-bit, you will need to backup your important data to another system or external drive and then perform a new installation. The new installation will perform a format of the selected disk(s) with ZFS.
es: PC-BSD® 10.x ha cambiado a 64-bits y solo ZFS. Esto significa que usted **no** puede actualizar un sistema que sea de 32-bits o formateado con UFS. Si el hardware soporta 64-bits, necesitará respaldar sus datos importantes a otro sistema o disco externo y después realizar una nueva instalación. La nueva instalación realizará un formateo de el/los disco(s) seleccionado(s) con ZFS.

source: The boot loader and default ZFS layout has changed to support :ref:`Boot Manager` and ZFS snapshot management with :ref:`Life Preserver`. For this reason, 9.x users should backup their important data to another system or external drive and then perform a new installation which will create the required ZFS layout.
es: El gestor de arranque y diseño predeterminado de ZFS ha cambiado para dar soporte al :ref:`Gestor de Arranque` y la administración de snapshots de ZFS con :ref:`Life Preserver`. Por esta razón, los usuarios de 9.x deberían respaldar sus datos importantes a otro sistema o disco externo y realizar una nueva instalación que creará el diseño ZFS requerido.

source: Upgrading from 10.x to |version|
es: Actualizando desde 10.x a |version|

source: Upgrading from any 10.x version to |version| is the same as applying any package update. This means that the update to |version| will either appear in Update Manager as a package update, for both "Edge" and "Production" users, or in the listing of :command:`pc-updatemanager pkgcheck`.
es: Actualizar desde cualquier versión 10.x a |version| es lo mismo que aplicar cualquier actualización de paquetes. Esto significa que la actualización a |version| aparecerá ya sea en el Administrador de Actualizaciones como una actualización de paquetes, para los usuarios de "Edge" y "Producción", o en el listado de :command:`pc-updatemanager pkgcheck`.

source: a fresh install, rather than an update, is only required if you wish to take advantage of any of the following features: UEFI boot (on a current non-UEFI installation), full disk encryption, or the `improved encryption key generation provided by GELIv7 <https://github.com/freebsd/freebsd/commit/38de8ef1dd0e468ff1e3ec1c431f465e270beba3>`_. This means that you will have to backup your data to an external drive or another system, perform the new install, then restore your data from the backup.
es: Una instalación nueva, más que una actualización, se requiere solamente si quiere tomar ventaja de cualquiera de las siguientes características: arranque UEFI (en una instalación actual no UEFI), encriptación completa del disco, o la `generación de llaves de encriptación mejorada proporcionada por GELIv7 <https://github.com/freebsd/freebsd/commit/38de8ef1dd0e468ff1e3ec1c431f465e270beba3>`_. Esto significa que usted tendrá que respaldar sus datos a un disco externo u otro sistema, realizar la nueva instalación, y luego restaurar sus datos desde el respaldo.

source: Create a Local Package Mirror
es: Crear un Mirror Local de Paquetes
