Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/using.po
Languages: es

source: Using PC-BSD®
es: Usando PC-BSD®

source: This section discusses how to perform common tasks that were not discussed in the :ref:`Control Panel` section.
es: Esta sección trata sobre cómo realizar tareas comunes que no se trataron en la sección :ref:`Panel de Control`.

source: Java and Flash
es: Java y Flash

source: PC-BSD® installs and configures the Adobe Flash player (version 11) plugin for you. This means that flash should "just work" when browsing the web. You will find several web browsers in the Web Browsers category of :ref:`AppCafe®`, including Firefox, Opera, and Chromium.
es: PC-BSD® instala y configura el plugin de Adobe Flash player (versión 11) para usted. Esto significa que flash debería "simplemente funcionar" cuando navegue por la web. Encontrará varios navegadores web en la categoría de Navegadores Web de :ref:`AppCafe®`, incluyendo Firefox, Opera y Chromium.

source: If Adobe Flash does not seem to be working, running the following command as your regular user account should fix the problem::
es: Si Adobe Flash parece no funcionar, ejecutando el siguiente comando con su cuenta de usuario regular debería arreglar el problema::

source: The Adobe Flash Player preferences icon in :ref:`Control Panel` can be used to modify how websites interact with your browser using Adobe Flash. Many of the same configurations can be done via right-click within an active flash object in a web browser.
es: El icono de preferencias de Adobe Flash Player en :ref:`Panel de Control` se puede usar para modificar cómo interactúan los sitios web con su navegador usando Adobe Flash. Muchas de las mismas configuraciones se pueden llevar a cabo haciendo clic derecho en el objeto flash activo en un navegador web.

source: To access the utility shown in :numref:`Figure %s: Flash Player Configuration Utility <flash>`, use :menuselection:`Control Panel --> Adobe Flash Player preferences` or type :command:`flash-player-properties`.
es: Para accesar la utilería mostrada en la :numref:`Figura %s: Utilería de Configuración de Flash Player <flash>`, use :menuselection:`Panel de Control --> Preferencias de Adobe Flash Player` o ingrese :command:`flash-player-properties`.

source: The options available in each tab and when to use them are described at the Adobe website:
es: Las opciones disponibles en cada pestaña y cuándo usarlas están descritas en el sitio web de Adobe:

source: `Storage <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7fff.html>`_ describes private browsing support and the privacy issues associated with local storage of flash information.
es: `Almacenamiento <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7fff.html>`_ describe el soporte de navegación en modo incógnito y los problemas de privacidad asociados con el almacenamiento local de la información de flash.

source: `Camera and Mic <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff8.html>`_ controls how websites can use your computer's camera and microphone.
es: `Cámara y Micrófono <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff8.html>`_ controla cómo lo sitios web pueden usar la cámara y el micrófono de su equipo.

source: `Playback <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff5.html>`_ describes how to configure peer-assisted networking to improve bandwidth.
es: `Playback <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff5.html>`_ describe cómo configurar las conexiones a redes asistidas por pares para mejorar el ancho de banda.

source: `Advanced <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff0.html>`_ controls how Flash Player handles browsing data, updates, trusted locations, and protected content.
es: `Avanzado <http://help.adobe.com/en_US/FlashPlayer/LSM/WS6aa5ec234ff3f285139dc56112e3786b68c-7ff0.html>`_ controla cómo maneja Flash Player la búsqueda de datos, actualizaciones, sitios confiables, y contenidos protegidos.

source: Installing Custom Fonts
es: Instalando Fuentes Personalizadas

source: If you have a collection of fonts that you have downloaded or purchased, you can configure your PC-BSD® system to also use these fonts. Which utility you use depends upon which window manager you have logged into.
es: Si tiene una colección de fuentes que haya descargado o comprado, puede configurar su sistema PC-BSD® para que también use esas fuentes. La utilería que utilice depende de a qué gestor de ventanas se haya conectado.

source: To install custom fonts within KDE, go to :menuselection:`System Settings --> Font Management`. In :numref:`Figure %s: Using KDE's Font Installer to Install Custom Fonts <font1>`, "All Fonts" is currently selected under the "Group" column, showing all of the fonts installed on this system.
es: Para instalar fuentes personalizadas en KDE, vaya a :menuselection:`Configuraciones del Sistema --> Administración de Fuentes`. En la :numref:`Figura %s: Usando el Instalador de Fuentes de KDE para Instalar Fuentes Personalizadas <font1>`, "Todas las Fuentes" está actualmente seleccionado bajo la columna "Grupo", mostrando todas las fuentes instaladas en este sistema.

source: To install your fonts, highlight "Personal Fonts" under the "Group" column, then click the "+Add" button. This will allow you to browse to the font you wish to add. You can add multiple fonts in the same directory by holding down the :kbd:`Ctrl` key while making your selection. Click the "Open" button, which will install the font for you. When it is finished, a pop-up message will indicate that you will need to restart any open applications for the font change to take affect. Your newly installed font(s) should now show up in the "Personal Fonts" section in the "Group" column and be available to the applications you use.
es: Para instalar sus fuentes seleccione "Fuentes Personales" en la columna "Grupo", después haga clic en el botón "+Añadir". Esto le permitirá buscar la fuente que desee añadir. Puede añadir múltiples fuentes en el mismo directorio manteniendo presionada la tecla :kbd:`Ctrl` mientras que hace su selección. Haga clic en el botón "Abrir", el cual instalará las fuentes para usted. Cuando finalice, un mensaje emergente le indicará que necesitará reiniciar cualquier aplicación abierta para que el cambio de fuente tenga efecto. Su(s) fuente(s) recientemente instalada(s) debería ahora aparecer en la sección "Fuentes Personales" en la columna "Grupo" y estar disponible para usarla por la aplicación.

source: To install custom fonts within GNOME, go to :menuselection:`Activities --> Files`. Navigate to the location of the font that you would like to install and either double-click the font name or select "Font Viewer" from the icon's right-click menu. This will open the font in Font Viewer, allowing you to view it. If you like the font, click the "Install Font" button to make it available to your applications. In the example shown in :numref:`Figure %s: Using Files to Install a Custom Font <font2>`, the user is installing the BlackFlag font.
es: Para instalar fuentes personalizadas en GNOME, vaya a :menuselection:`Actividades --> Archivos`. Vaya a la localización de la fuente que quiera instalar y haga doble clic en el nombre de la fuente o seleccione "Visor de Fuentes" desde el menú de clic derecho del icono. Esto abrirá la fuente en el Visor de Fuentes, permitiéndole visualizarla. Si le gusta la fuente, presione el botón "Instalar Fuente" para hacerla disponible a sus aplicaciones. En el ejemplo mostrado en la :numref:`Figura %s: Usando Archivos para Instalar una Fuente Personalizada <font2>`, el usuario está instalando la fuente BlackFlag.

source: To install custom fonts within XFCE, use :menuselection:`Applications --> System --> Thunar File Manager`. Once you browse to the location of the font and double- or right-click it, you will see the same Font Viewer used by GNOME.
es: Para instalar fuentes personalizadas en XFCE use :menuselection:`Aplicaciones --> Sistema --> Administrador de Archivos Thunar`. Una vez que busque la ubicación de la fuente y presione o haga clic derecho en ella, verá el mismo Visor de Fuentes usado por GNOME.

source: If you prefer to install fonts from the command line, become the superuser and copy the downloaded font to the :file:`/usr/local/share/fonts/` directory. Then, refresh the fonts cache::
es: Si prefiere instalar fuentes desde la línea de comandos, conéctese como administrador y copie la fuente descargada en el directorio :file:`/usr/local/share/fonts/`. Después, actualice el cache de fuentes::

source: If you install your web browser using AppCafe®, you should be able to play most media formats, including YouTube videos, Internet radio, and many trailer and movie sites.
es: Si instala su navegador web usando AppCafe®, debería ser capaz de reproducir la mayoría de los formatos multimedia, incluyendo videos de Youtube, radio por Internet, y muchos sitios de trailers y películas.

source: if you happen to come across a file that you can not play in a web browser or media player, it is probably because it is in a proprietary format that requires a licensing fee or restricts distribution of the codec that is required to play that media format.
es: Si se encuentra con un archivo que no puede reproducir en el navegador web o en el reproductor multimedia, es probable que sea un formato propietario que requiere el pago de una licencia o restringe la distribución del codec que se requiere para reproducir ese formato multimedia.

source: AppCafe® contains several dozen applications for playing and editing multimedia. It includes these popular applications (click the links to view screenshots):
es: AppCafe® contiene varias docenas de aplicaciones para reproducir y editar archivos multimedia. Incluye estas aplicaciones conocidas (presione los enlaces para ver las capturas de pantalla):

source: `aTunes <http://www.atunes.org/?page_id=5>`_: full-featured audio player and manager that can play mp3, ogg, wma, wav, flac, mp4 and radio streaming, allowing users to easily edit tags, organize music and rip audio CDs.
es: `aTunes <http://www.atunes.org/?page_id=5>`_: reproductor y administrador de audio lleno de funciones que puede reproducir mp3, ogg, wma, wav, flac, mp4 y streaming de radio, permitiendo a los usuarios editar fácilmente etiquetas, organizar la música y copiar CDs de audio.

source: `DeaDBeeF <http://deadbeef.sourceforge.net/screenshots.html>`_: music player that supports most audio formats.
es: `DeaDBeeF <http://deadbeef.sourceforge.net/screenshots.html>`_: reproductor de música que soporta la mayoría de los formatos de audio.

source: `Decibel <http://decibel.silent-blade.org/index.php?n=Main.Screenshots>`_: audio player built around a highly modular structure that lets the user disable completely the features he does not need. Able to play CDs directly.
es: `Decibel <http://decibel.silent-blade.org/index.php?n=Main.Screenshots>`_: reproductor de audio hecho en torno a una estructura modular que le permite al usuario deshabilitar completamente las características que no necesite. Es capaz de reproducir CDs directamente.

source: `gtkpod <http://www.gtkpod.org/index.php?title=Screenshots>`_: graphical user interface for the Apple iPod.
es: `gtkpod <http://www.gtkpod.org/index.php?title=Screenshots>`_: interfaz gráfica para el iPod de Apple.

source: `Miro <http://www.getmiro.com/download/screenshots/>`_: HD video player that can play almost any video file and offers over 6,000 free Internet TV shows and video podcasts.
es: `Miro <http://www.getmiro.com/download/screenshots/>`_: reproductor de vídeo HD que puede reproducir casi cualquier archivo de vídeo y ofrece mas de 6,000 programas gratis de TV por Internet y podcasts de vídeo.

source: `SMPlayer <http://smplayer.sourceforge.net/>`_: universal media player that can handle any media format and play audio CDs, DVDs, (S)VCDs, TV/radio cards, YouTube™ and SHOUTcast™ streams. This is the default player used by :ref:`Mount Tray`.
es: `SMPlayer <http://smplayer.sourceforge.net/>`_: reproductor universal de medios que puede manejar cualquier formato y reproducir CDs de audio, DVDs, (S)VCDs, tarjetas de TV/radio, YouTube™y streams SHOUTcast™. Éste es el reproductor predeterminado usado en la :ref:`Bandeja de Montaje`.

source: If you have never used Kodi before, take some time to skim through the `Kodi Wiki Manual <http://kodi.wiki/>`_. The `Turn PC-BSD into a home theater forum post <https://forums.pcbsd.org/thread-19799.html>`_ contains a quick how-to for configuring Kodi.
es: Si nunca ha usado Kodi antes, tómese algo de tiempo para revisar el `Manual Wiki de Kodi <http://kodi.wiki/>`_. El `Post sobre convertir PC-BSD en un home theater <https://forums.pcbsd.org/thread-19799.html>`_ contiene una guía rápida para configurar kodi.

source: `Plex Home Theater <https://plex.tv/>`_ is a centralized media playback system. The central Plex Media Server streams media to many Plex player Apps which are used to view your media library and watch shows.
es: `Plex Home Theater <https://plex.tv/>`_ es un sistema de reproducción multimedia centralizado. El Servidor central Plex Media transmite archivos de medios a muchas Aplicaciones Plex reproductoras que se emplean para ver sus bibliotecas multimeda y ver programas.

source: Once installed, an entry for "Plex Home Theater" will also be added to the login manager so that you can login directly to the home theater instead of a desktop.
es: Una vez instalado, una entrada para "Plex Home Theater" también se añadirá al administrador de acceso de manera que pueda accesar directamente al home theater en vez de al escritorio.

source: The first time you run or log into Plex Home Theater, a wizard will check your audio settings and sign into your Plex account. If you do not have a Plex account yet, create one at `plex.tv <https://plex.tv/>`_. The wizard will give you a PIN code and an URL to enter the code. Once you enter the PIN, the wizard will connect and sign you in. You can now search for and watch media. To exit Plex, click the "<" then "Quit".
es: La primera vez que ejecute o accese a Plex Home Theater, un asistente comprobará sus configuraciones de audio y lo conectará a su cuenta Plex. Si todavía no tiene una cuenta Plex, cree una en `plex.tv <https://plex.tv/>`_. El asistente le dará un código PIN y una dirección URL para introducir el código. Una vez que introduzca el PIN, el asistente le conectará y le autenticará. Ahora podrá buscar y ver archivos multimedia. Para salir de Plex, presione "<" y después en "Salir".

source: Files and File Sharing
es: Archivos y Compartición de Archivos

source: **Table 9.4a: Available File Managers**
es: **Tabla 9.4a: Administradores de Archivos Disponibles**

source: File Manager
es: Administrador de Archivos

source: Screenshots
es: Capturas de Pantalla

source: When working with files on your PC-BSD® system, save your own files to your home directory. Since most of the files outside of your home directory are used by the operating system and applications, you should not delete or modify any files outside of your home directory, unless you know what you are doing.
es: Cuando trabaje con archivos en su sistema PC-BSD®, guarde sus propios archivos en su directorio personal. Puesto que la mayor parte de los archivos que están fuera de su directorio personal son usados por el sistema operativo y por las aplicaciones, usted no debería borrar o modificar archivos que estén fuera de su directorio personal, a no ser que sepa lo que está haciendo.

source: Table 9.4b summarizes the directory structure found on a PC-BSD® system. :command:`man hier` explains this directory structure in more detail.
es: La Tabla 9.4b resume la estructura de los directorios que hay en un sistema PC-BSD®. El comando :command:`man hier` explica esta estructura de los directorios con más detalle.

source: **Table 9.4b: PC-BSD Directory Structure**
es: **Tabla 9.4b: Estructura de los Directorios de PC-BSD**

source: Directory
es: Directorio

source: Contents
es: Contenidos

source: pronounced as "root" and represents the beginning of the directory structure
es: Pronunciado como "raíz" y representa el comienzo de la estructura de directorios

source: applications (binaries) that were installed with the operating system
es: Aplicaciones (binarios) que se instalaron con el sistema operativo

source: stores the startup code, including kernel modules (such as hardware drivers)
es: Almacena el código de arranque, incluyendo los módulos del kernel (tales como controladores de hardware)

source: Linux software compatibility files
es: Archivos de compatibilidad de software Linux

source: files which are used by the operating system to access devices
es: Archivos que se han usado por el sistema operativo para accesar a los dispositivos

source: operating system configuration files
es: Archivos de configuración del sistema operativo

source: the :file:`xorg.conf` configuration file
es: El archivo de configuración :file:`xorg.conf`

source: operating system startup scripts
es: Scripts de inicio del sistema operativo

source: subdirectories for each user account; each user should store their files in their own home directory
es: Subdirectorios para cada cuenta de usuario; cada usuario debería almacenar sus archivos en su propio directorio personal

source: operating system libraries needed for applications
es: Librerías del sistema operativo necesarias para las aplicaciones

source: operating system libraries and binaries
es: Librerías y binarios del sistema operativo

source: mount point for storage media such as DVDs and USB drives
es: Punto de montaje para los medios de almacenamiento tales como DVDs y memorias USB

source: another mount point
es: Otro punto de montaje

source: the proc filesystem required by some Linux applications
es: El sistema de archivos proc requerido por algunas aplicaciones Linux

source: necessary programs for emergency recovery
es: Programas necesarios para una recuperación de emergencia

source: administrative account's home directory
es: El directorio personal de la cuenta del administrador

source: operating system applications; typically only the superuser can run these applications
es: Aplicaciones del sistema operativo; típicamente sólo el administrador puede ejecutar estas aplicaciones

source: temporary file storage; files stored here may disappear when the system reboots
es: Almacén temporal de archivos; los archivos almacenados aquí pueden desaparecer cuando el sistema se reinicie

source: contains most of the command line programs available to users
es: Contiene la mayoría de los programas que se inician desde la línea de comandos, disponibles para los usuarios

source: contains the binaries, libraries, startup scripts, documentation, and configuration files used by applications installed from ports or packages
es: Contiene los binarios, librerías, scripts de inicio, documentación, y archivos de configuración usados por las aplicaciones instaladas desde los ports o paquetes

source: system wide fonts for graphical applications
es: Fuentes del sistema para las aplicaciones gráficas

source: system wide icons
es: Iconos del sistema

source: location of system ports tree (if installed)
es: Localización del árbol de ports del sistema (si está instalado)

source: system documentation and man pages
es: Documentación del sistema y páginas del manual

source: command line programs for the superuser
es: Programas en línea de comandos para el administrador

source: location of system source code (if installed)
es: Localización del código fuente del sistema (si está instalado)

source: files that change (vary), such as log files and print jobs
es: Archivos que cambian (varían), tales como los archivos de log y los trabajos de impresión

source: PC-BSD® provides built-in support for accessing Windows shares, meaning you only have to decide which utility you prefer to access existing Windows shares on your network. If a desktop is installed, you do not have to be logged into that desktop in order to use that utility.
es: PC-BSD® proporciona soporte integrado para acceder a recursos compartidos Windows, lo que significa que sólo tiene que decidir qué utilería prefiere para accesar a recursos compartidos Windows existentes en su red. Si hay un escritorio instalado, no tiene que estar conectado al escritorio para usar esta utilería.

source: **Table 9.4c: Utilities that Support Windows Shares**
es: **Tabla 9.4c: Utilerías que Soportan Recursos Compartidos Windows**

source: **Utility**
es: **Utilería**

source: **How to Access Existing Shares**
es: **Cómo Accesar a Recursos Compartidos Existentes**

source: in the left frame, click on :menuselection:`Network --> Samba Shares`, then the Workgroup name; if the network requires a username and password to browse for shares, set this in :menuselection:`Control Panel --> System Settings --> Sharing` while in KDE or type :command:`systemsettings` and click "Sharing" while in another desktop
es: En el marco izquierdo, presione en :menuselection:`Red --> Recursos Compartidos Samba`, después el nombre del Grupo de Trabajo; si la red requiere un nombre de usuario y una contraseña para buscar recursos compartidos, establezca esto en :menuselection:`Panel de Control --> Configuraciones del Sistema --> Recursos Compartidos` mientras esté en KDE o escriba :command:`systemsettings` y presione "Compartir" mientras esté en otro escritorio

source: in the location bar, type *smb:/*
es: En la barra de direcciones, escriba *smb:/*

source: click on :menuselection:`Go --> Connect to server --> SMB`; input the NETBIOS name of server, name of share, name of domain (or workgroup), and the share's username and password
es: Presione en :menuselection:`Ir --> Conectar al servidor --> SMB`; introduzca el nombre NETBIOS del servidor, el nombre del recurso compartido, nombre del dominio (o grupo de trabajo), y el nombre de usuario y contraseña del recurso compartido.

source: click on :menuselection:`Browse Network --> Windows Network`
es: Presione en :menuselection:`Examinar Red --> Red de Windows`

source: in the left frame, click on :menuselection:`Network --> Windows Network`
es: En el marco izquierdo, presione en :menuselection:`Red --> Red de Windows`

source: Windows Emulation
es: Emulación de Windows

source: Wine can be installed during installation or from :ref:`AppCafe®`. Once installed, it can be started by clicking the entry for "Wine Configuration" from the desktop's application menu or by typing :command:`winecfg` at the command line. The initial Wine configuration menu shown in :numref:`Figure %s: Wine Configuration Menu <wine1>`.
es: Wine puede instalarse durante la instalación o desde :ref:`AppCafe®`. Una vez instalado, se puede iniciar presionando la entrada para la "Configuración de Wine" desde el menú de aplicaciones del escritorio o ingresando :command:`winecfg` en la línea de comandos. El menú inicial de la configuración de Wine mostrado en la :numref:`Figura %s: Menú de Configuración de Wine <wine1>`.
