Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/using.po
Languages: es

source: Click the "Add application" button to browse to the application's installer file. By default, the contents of your hard drive will be listed under "drive_c". If the installer is on a CD/DVD, use the drop-down menu to browse to your :menuselection:`home directory --> *.wine --> dosdevices` folder. The contents of the CD/DVD should be listed under *d:*. If they are not, the most likely reason is that your CD/DVD was not automatically mounted by the desktop. To mount the media, type the following as the superuser::
es: Presione el botón "Añadir Aplicación" para buscar el archivo de instalación de la aplicación. Por defecto, el contenido de su disco duro se listará bajo "drive_c". Si el instalador está en un CD/DVD, use el menú desplegable para ir a su :menuselection:`directorio personal --> *.wine --> dosdevices`. EL contenido del CD/DVD debería estar listado bajo *d:*. Si no está allí, la razón más probable es que su CD/DVD no se haya montado automáticamente por el escritorio. Para montar el dispositivo, escriba lo siguiente como administrador:

source: You should hear the media spin and be able to select the installer file. Once selected, press "Apply" then "OK" to exit the configuration utility.
es: Debería escuchar el medio girar y ser capaz de seleccionar el archivo de instalación. Una vez seleccionado, presione "Aplicar" y después "OK" para salir de la utilería de configuración.

source: To install the application, click the Winefile desktop icon or type :command:`winefile` to see the screen shown in :numref:`Figure %s: Installing the Application Using winefile <wine2>`.
es: Para instalar la aplicación, presione el icono de escritorio Winefile o ingrese :command:`winefile` para ver la pantalla mostrada en la :numref:`Figura %s: Instalando la Aplicación Usando winefile <wine2>`.

source: Click the button representing the drive containing the installer and double-click on the installation file (e.g. :file:`setup.exe`). The installer should launch and you can proceed to install the application as you would on a Windows system.
es: Presione el botón que representa el disco que contiene el instalador y presione en el archivo de instalación (por ejemplo :file:`setup.exe`). El instalador debería iniciarse y usted podrá proceder a instalar la aplicación como lo haría en un sistema Windows.

source: if you had to manually mount the CD/DVD, you will need to unmount it before it will eject. As the superuser, use the command :command:`umount /mnt`.
es: Si ha tenido que montar manualmente el CD/DVD, necesitará desmontarlo antes de expulsarlo. Como administrador, use el comando :command:`umount /mnt`.

source: Once the installation is complete, browse to the application's location. :numref:`Figure %s: Running the Installed Application <wine3>` shows an example of running Internet Explorer within :command:`winefile`.
es: Una vez que la instalación se ha completado, busque la localización de la aplicación. :numref:`Figura %s: Iniciando la Aplicación Instalada <wine3>` muestra un ejemplo de cómo iniciar Internet Explorer con :command:`winefile`.

source: Running Steam
es: Ejecutando Steam

source: Remote Desktop
es: Escritorio Remoto

source: Occasionally it is useful to allow connections between desktop sessions running on different computers. This can be handy when troubleshooting a problem since both users will be able to see the error on the problematic system and either user can take control of the mouse and keyboard in order to fix the problem. Typically this is a temporary situation as providing access to one's computer allows a remote user the ability to both view and modify its settings.
es: Algunas veces es necesario permitir conexiones entre sesiones de escritorio corriendo en diferentes computadoras. Esto puede ser útil cuando hay que solucionar un problema ya que ambos usuarios serán capaces de ver el error en el sistema problemático y cualquier usuario puede tomar control del ratón y teclado para solucionar el problema. Esto es típicamente una situación temporal ya que permitir acceso a nuestro equipo otorga a un usuario remoto la capacidad tanto de ver como de modificar sus configuraciones.

source: If the other computer you are connecting to is a Mac, Linux, or BSD system, you will have to first install either `xrdp <http://www.xrdp.org/>`_ or a VNC server on the other system. Depending upon the operating system, either software may or may not already be installed. If it is not, check the software repository for the operating system or use a web search to find out how to install and configure one of these applications on that operating system. If you are connecting to another PC-BSD® system, use :ref:`AppCafe®`, check the box "Search all available PBI and packages", and search for "rdp" or "vnc".
es: Si el otro ordenador al que se está conectando es un Mac, Linux o sistema BSD, tendrá primero que instalar o bien `xrdp <http://www.xrdp.org/>`_ o un servidor VNC en el otro sistema. Dependiendo del sistema operativo, cualquier software puede, o no, estar ya instalado. Si no lo está, compruebe el repositorio de software para el sistema operativo o haga una búsqueda en la web para averiguar cómo instalar y configurar una de estas aplicaciones en ese sistema operativo. Si se está conectando a otro sistema PC-BSD®, use :ref:`AppCafe®`, seleccione el recuadro "Buscar todos los PBI y paquetes disponibles", y busque "rdp" o "vnc".

source: If there is a firewall on either system or a network firewall between the two systems, check that it allows connections to the TCP port required by the type of connection that you will be using:
es: Si hay un cortafuegos en cualquier sistema o un cortafuegos de red entre los dos sistemas, compruebe que permite la conexión al puerto TCP requerido por el tipo de conexión que usted estará usando:

source: **RDP:** uses port 3389
es: **RDP:** usa el puerto 3389

source: **VNC:** uses port 5900 (for the first connection, 5901 for the second connection, etc.)
es: **VNC:** usa el puerto 5900 (para la primera conexión, 5901 para la segunda conexión, etc.)

source: If you need to manually add a firewall rule, it is best to only allow the IP address of the computer that will be connecting. You should immediately remove or disable this firewall rule after the connection is finished so that other computers do not try to connect to the computer. Since your PC-BSD® system is considered to be the client and will be initiating the connection, you do not have to modify the firewall on the PC-BSD® system.
es: Si necesita añadir manualmente una regla al cortafuegos, es mejor permitir solo la dirección IP del equipo que se estará conectando. Debería eliminar inmediatamente o deshabilitar esta regla del cortafuegos cuando la conexión haya terminado, para que otros equipos no intenten conectarse a la computadora. Ya que su sistema PC-BSD® se considera como un cliente e iniciará la conexión, no tiene qué modificar el cortafuegos en el sistema PC-BSD®.

source: Connecting with KRDC
es: Conectándose con KRDC

source: KRDC can be used to initiate a connection request. This application can be installed using :ref:`AppCafe®` Check the "Search all available PBI and packages" box within the "App Search" tab to install this package.
es: KRDC se puede usar para iniciar una petición de conexión. Esta aplicación se puede instalar usando :ref:`AppCafe®`. Seleccione el recuadro "Buscar todos los PBI y paquetes disponibles" en la pestaña "Buscar Aplicaciones" para instalar este paquete.

source: To launch this application, go to :menuselection:`Applications --> Internet --> Remote Desktop Client` within KDE or type :command:`krdc` at the command line within any desktop. If you click :kbd:`F1` while in KRDC you can access the `Remote Connection Desktop Handbook <https://docs.kde.org/stable4/en/kdenetwork/krdc/index.html>`_ to learn more about how to use this application.
es: Para iniciar esta aplicación, vaya a :menuselection:`Aplicaciones --> Internet --> Cliente de Escritorio Remoto` en KDE o escriba :command:`krdc` en la línea de comandos en cualquier escritorio. Si presiona :kbd:`F1` mientras está en KRDC puede accesar al `Manual de Conexión a Escritorio Remoto <https://docs.kde.org/stable4/en/kdenetwork/krdc/index.html>`_ para saber más acerca de cómo usar esta aplicación.

source: :numref:`Figure %s: Creating a Connection Using KRDC <krdc1>` shows the initial KRDC screen which allows you to specify which system you wish to connect to.
es: La :numref:`Figura %s: Creando una Conexión Usando KRDC <krdc1>` muestra la pantalla inicial de KRDC que le permite especificar a qué sistema se quiere conectar.

source: Use the drop-down menu to indicate whether the remote system is using RDP or VNC for the connection. Then type in the IP address of the system you wish to connect to. If you are connecting to a VNC system, the IP address needs to be followed by a colon and a number indicating the number of the session. Typically, the number will be 1 unless the VNC server is hosting multiple simultaneous connections. Once you press enter, the connection will be initiated and, if it is an RDP connection, you will see the screen shown in :numref:`Figure %s: Settings for the RDP Connection <krdc2>`.
es: Use el menú desplegable para indicar si el sistema remoto está usando RDP o VNC para la conexión. Luego ingrese la dirección IP del sistema al que se quiere conectar. Si se está conectando a un sistema VNC, la dirección IP necesita ir seguida por dos puntos y un número indicando el número de la sesión. Típicamente, el número será 1 a menos que el servidor VNC esté siendo el anfitrión de múltiples conexiones simultáneas. Una vez que presione intro, la conexión será iniciada y, si es una conexión RDP, verá la pantalla mostrada en la :numref:`Figura %s: Configuraciones para la Conexión RDP <krdc2>`.

source: Here is a quick overview of the settings:
es: Aquí hay un breve resumen de las configuraciones:

source: **Desktop resolution:** since the contents of the screen are sent over the network, select the lowest resolution that still allows you to see what is happening on the other system. If you have a very fast network connection, you can choose a higher resolution; if you find that the other system is very slow to refresh its screen, try choosing a lower resolution.
es: **Resolución del escritorio:** puesto que los contenidos de la pantalla se envían por la red, seleccione la menor resolución que le permita ver lo que esta pasando en el otro sistema. Si tiene una conexión de red muy rápida, puede elegir una resolución mayor; si encuentra que el otro sistema es muy lento para refrescar la pantalla, pruebe eligiendo una resolución menor.

source: **Color depth:** choose the lowest color depth that allows you to see the other system; you can choose a higher color depth if the network connection is fast.
es: **Profundidad de color:** elija la menor profundidad de color que le permita ver el otro sistema; pude escoger una mayor profundidad de color si la conexión de red es rápida.

source: **Keyboard layout:** this drop-down menu allows you to select the desired keyboard layout.
es: **Diseño del teclado:** este menú desplegable le permite seleccionar el diseño de teclado que desee.

source: **Sound:** this drop-down menu allows you to choose whether any sounds heard during the connection are produced on this system, the remote system, or to disable sound during the connection.
es: **Sonido:** este menú desplegable le permite elegir si cualquier sonido escuchado durante la conexión es producido por este sistema, el sistema remoto, o deshabilitar el sonido durante la conexión.

source: **Performance:** select the option that best matches the network speed to the remote host. Choices are "Modem", "Broadband", or "LAN".
es: **Rendimiento:** seleccione la opción que mejor se ajuste a la velocidad de red del sistema remoto. Las opciones son "Modem", "Banda Ancha" o "LAN".

source: **RemoteFX:** check this box if the remote system supports RemoteFX and hardware acceleration is desired.
es: **RemoteFX:** seleccione esta casilla si el sistema remoto soporta RemoteFX y si desea aceleración por hardware.

source: **Share Media:** specifies a mount point for data to be shared between the systems.
es: **Compartir Medios:** especifica un punto de montaje para los datos que se compartirán entre sistemas.

source: **Console login:** if you are connecting to a Unix-like system, you can check this box if you wish to have access to the other system's command line console.
es: **Acceso por consola:** si se está conectando a un sistema tipo Unix, puede seleccionar esta casilla si desea tener acceso a la línea de comandos del otro sistema.

source: **Extra options:** allows you to specify `rdesktop switches <http://linux.die.net/man/1/rdesktop>`_ that are not covered by the other options in this screen.
es: **Opciones extra:** le permite especificar `modificadores de rdesktop <http://linux.die.net/man/1/rdesktop>`_ que no están cubiertos por las otras opciones en esta pantalla.

source: **Show this dialog again for this host:** if you plan on using the same settings every time you connect to this computer, you can uncheck this box. If you need to change the settings at a later time, you can right-click the connection (which will appear in a list as a past connection) and choose "Settings" from the right-click menu.
es: **Mostrar este diálogo otra vez para este sistema:** si planea usar las mismas configuraciones cada vez que se conecte a esta computadora, puede desmarcar esta casilla. Si necesita cambiar las configuraciones más tarde, puede presionar botón derecho en la conexión (que aparecerá en una lista como una conexión anterior) y elegir "Configuración" desde el menú del botón derecho.

source: **Remember password:** `KWallet <https://utils.kde.org/projects/kwalletmanager/>`_ is KDE's password storage system. If this box stays checked, you will only need to input the password the first time you make this connection as it will be saved for you. If this is the first time you have stored a password using KWallet, it will prompt you for some information to set up your wallet.
es: **Recordar contraseña:** `KWallet <https://utils.kde.org/projects/kwalletmanager/>`_ es el sistema de almacenamiento de contraseñas de KDE. Si esta casilla permanece seleccionada, sólo necesitará introducir la contraseña la primera vez que establezca esta conexión ya que la contraseña se guardará. Si esta es la primera vez que ha almacenado una contraseña mediante KWallet, se le pedirá cierta información para configurar su cartera de contraseñas.

source: If it is a VNC connection, you will be able to choose your connection type (speed), screen resolution, and have the option to remember the password.
es: Si es una conexión VNC, podrá elegir su tipo de conexión (velocidad), resolución de pantalla, y tendrá la opción de recordar la contraseña.

source: Once you press "OK", the connection should be initiated and you will receive pop-up messages asking for a username then a password; the details you provide must match a user account on the system you are connecting to. Once your authentication details are confirmed, you should see the desktop of the other system. If you move your mouse, it will move on the other desktop as well. Click the "View Only" button in the top toolbar whenever you wish to disable this mouse behavior. When you are finished your session, you can click the "Disconnect" button in the top toolbar.
es: Una vez que presione "OK" la conexión debería iniciarse y usted recibirá un mensaje emergente preguntándole un nombre de usuario y luego una contraseña; los detalles que proporcione deben coincidir con una cuenta de usuario del sistema al que se está conectando. Una vez que se han confirmado los detalles de autenticación, debería ver el escritorio del otro sistema. Si mueve el ratón, se moverá también en el otro sistema. Presione el botón "Sólo Ver" en la barra de herramientas superior siempre que desee deshabilitar este comportamiento del ratón. Cuando termine su sesión, puede presionar el botón "Desconectar" en la barra de herramientas superior.

source: if the connection fails, check on the remote computer that either the RDP software is enabled or that the VNC server is listening for connections. Also double-check that a firewall is not preventing the connection.
es: Si la conexión falla, compruebe en el equipo remoto que el software RDP está habilitado o que el servidor VNC está escuchando por conexiones. También compruebe que un cortafuegos no esté evitando la conexión.

source: Connecting with VNC
es: Conectándose con VNC

source: If you prefer to use VNC for the connection, use :ref:`AppCafe®` to install a VNC client such as TightVNC. Before using the VNC client, ensure that the VNC server is installed and running on the remote desktop.
es: Si prefiere usar VNC para la conexión, use :ref:`AppCafe®` para instalar un cliente VNC, como TightVNC. Antes de usar el cliente VNC, asegúrese que el servidor VNC está instalado y corriendo en el escritorio remoto.

source: Once TightVNC is installed, type :command:`vncviewer` to start the VNC client. A small window will appear, allowing you to type in the IP address of the remote system in the format *IP_ADDRESS:5801*. Change the *5801* if the VNC server is listening on a different port.
es: Una vez que esté instalado TightVNC, escriba :command:`vncviewer` para iniciar el cliente VNC. Una pequeña ventana aparecerá, permitiéndole escribir la dirección IP del sistema remoto en el formato *IP_ADDRESS:5801*. Cambie el *5801* si el servidor VNC está escuchando en un puerto diferente.

source: Using Desktop Sharing
es: Compartir Escritorio

source: If you wish another user to connect to your computer, the KDE Desktop Sharing application can be used to generate a connection invitation The :command:`krfb` application can be installed using :ref:`AppCafe®`. Check the "Search all available PBI and packages" box within "App Search" to search for this application.
es: Si desea que otro usuario se conecte a su equipo, se puede usar la aplicación de Compartir Escritorio de KDE para generar una invitación de conexión. La aplicación :command:`krfb` se puede instalar usando :ref:`AppCafe®`. Seleccione el recuadro "Buscar todos los PBI y paquetes disponibles" en "Buscar Aplicaciones" para buscar la aplicación.

source: To launch this application within KDE, go to :menuselection:`Applications --> Internet --> Desktop Sharing` or type :command:`krfb` from the command prompt of any desktop. If you press :kbd:`F1` while in this application, it will open the `Desktop Sharing Handbook <https://docs.kde.org/stable4/en/kdenetwork/krfb/index.html>`_ where you can learn more about using this utility. :numref:`Figure %s: Initiating a Connection Request Using krfb <krfb1>` shows the initial screen for this application.
es: Para lanzar esta aplicación en KDE, vaya a :menuselection:`Aplicaciones --> Internet --> Compartir Escritorio` o ingrese :command:`krfb` desde el indicador de comandos de cualquier escritorio. Si presiona :kbd:`F1` dentro de esta aplicación, se abrirá el `Manual para Compartir el Escritorio <https://docs.kde.org/stable4/en/kdenetwork/krfb/index.html>`_ donde puede aprender más sobre el uso de esta utilería. La :numref:`Figura %s: Iniciando una Petición de Conexión Usando krfb <krfb1>` muestra la pantalla inicial para esta aplicación.

source: To share your desktop, check the box "Enable Desktop Sharing". This will activate the "Connection Details" portion of this screen. If you click the blue icon next to the "Address", a pop-up menu will indicate that this is just a hint and that the remote user should use the IP address for your computer. If you wish, you can click the icon next to the "Password". This will activate that field so that you can change the generated password to the one you want to use for the session. Be sure to reclick the icon to save the new password.
es: Para compartir su escritorio, seleccione la casilla "Habilitar Compartir Escritorio". Esto activará la porción de "Detalles de la Conexión" de esta pantalla. Si presiona el icono azul junto a la "Dirección", un menú emergente le indicará que esto es sólo una pista y que el usuario remoto debería usar la dirección IP de su equipo. Si lo desea, puede presionar el icono junto a la "Contraseña". Esto activará ese campo para que pueda cambiar la contraseña generada por aquella que quiera usar para la sesión. Asegúrese de volver a presionar el icono para guardar la nueva contraseña.

source: while you can check the "Enable Unattended Access" checkbox, it is **not recommended** to do so. If you give another user the unattended password (which is set by clicking the "Change Unattended Password"), they can connect to your system without your knowledge. The default, which occurs when the "Enable Unattended Access" is **un** checked, is for a pop-up message to appear on your screen whenever a remote user attempts to connect and for the desktop to remain inaccessible until you accept the remote connection.
es: Mientras que usted puede seleccionar la casilla "Habilitar el Acceso sin Supervisión", **no está recomendado** hacerlo. Si da a otro usuario la contraseña sin supervisión (la cual se establece presionando "Cambiar la Contraseña sin Supervisión"), pueden conectarse a su sistema sin que usted se de cuenta. Por defecto, lo que ocurre cuando "Habilitar el Acceso sin Supervisión" está **desmarcado**, es que aparece un mensaje emergente en su pantalla siempre que un usuario remoto intenta conectarse y el escritorio permanecerá inaccesible hasta que usted acepte la conexión remota.

source: Once you have checked the box to "Enable Desktop Sharing", contact the other person to let them know the password and IP address so that they can connect. The most secure way to convey the invitation information is through an alternate communications channel such as a phone call. Ideally, you are speaking to the other person as they connect so that you can walk them through the problem you are experiencing and they can let you know what they are doing to your system as you watch them do it.
es: Una vez que haya seleccionado la casilla "Habilitar Compartir Escritorio", contacte a la otra persona para hacerle saber su contraseña y la dirección IP de manera que pueda conectarse. La forma más segura para transmitir la información de la invitación es a través de canales alternativos tales como una llamada de teléfono. Idealmente, estará hablando con la otra persona cuando se conecte de manera que le pueda guiar por el problema que usted está experimentando y le puedan hacer saber lo que están haciendo con su sistema mientras usted los ve hacerlo.

source: The other person should input the IP address and password into their VNC client in order to start the connection. You will know when they try to connect as a pop-up message will appear on your screen similar to :numref:`Figure %s: The Other User is Trying to Connect Using the Invitation <krfb2>`.
es: La otra persona debería ingresar la dirección IP y la contraseña en su cliente VNC para iniciar la conexión. Usted sabrá cuándo intentarán conectarse ya que un mensaje emergente aparecerá en su pantalla similar a la :numref:`Figura %s: El Otro Usuario Trata de Conectarse Usando la Invitación <krfb2>`.
