Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/using.po
Languages: es

source: In this example, a computer with an IP address of 192.168.1.111 is trying to connect. Buttons are provided to either accept or refuse the connection. You can also check or uncheck the box to "allow remote user to control keyboard and mouse". If you accept the connection, the other user will be prompted to input the invitation password. Once the password is accepted, they will see your desktop.
es: En este ejemplo, un equipo con un dirección IP de 192.168.1.111 está tratando de conectarse. Se proporcionan botones para aceptar o rechazar la conexión. También puede seleccionar o desmarcar la casilla "permitir a un usuario remoto controlar el ratón y el teclado". Si acepta la conexión, se le pedirá al otro usuario que introduzca la contraseña de la invitación. Una vez que se acepte la contraseña, podrán ver su escritorio.

source: your desktop will continue to be shared as long as the "Enable Desktop Sharing" checkbox is checked, even if you close this utility. **Always remember** to uncheck this box when your session is finished in order to prevent unwanted connections.
es: Su escritorio continuará compartido tanto tiempo como la casilla "Habilitar Compartir Escritorio" esté seleccionada, incluso si usted cierra esta utilería. **Recuerde siempre** desmarcar esta casilla cuando su sesión esté terminada para prevenir conexiones no deseadas.

source: Thin Client
es: Cliente Ligero

source: PC-BSD® provides a Thin Client script which can be used to easily create a PXE Boot Desktop Server, to support thin clients, and a PXE Boot Install Server, for creating a central server which systems can connect to in order to be installed with PC-BSD®.
es: PC-BSD® proporciona un script de Cliente Ligero que se puede usar para crear fácilmente un Servidor de Escritorio de Arranque PXE, para soportar clientes ligeros, y un Servidor de Instalación de Arranque PXE, para crear un servidor central al que se puedan conectar sus sistemas para ser instalados con PC-BSD®.

source: This section demonstrates how to configure and use both the PXE Boot Desktop Server and the PXE Boot Install Server.
es: Esta sección muestra cómo configurar y utilizar tanto el Servidor de Escritorio de Arranque PXE y el Servidor de Instalación de Arranque PXE.

source: PXE Boot Desktop Server
es: Servidor de Escritorio de Arranque PXE

source: To prepare your PC-BSD® system for a PXE Boot Desktop Server configuration, perform these tasks first:
es: Para preparar su sistema PC-BSD® para la configuración del Servidor de Escritorio de Arranque PXE, realice primero las siguientes tareas:

source: If the diskless clients will require Internet access, install two network cards where one NIC is connected to the Internet and the other is connected to a private LAN from which the thin clients can PXE boot from.
es: Si los clientes sin disco van a requerir conexión a Internet, instale dos tarjetas de red donde una NIC se conectará a Internet y la otra se conectará a una LAN privada desde la que los clientes ligeros puede arrancar PXE.

source: The PC-BSD® system should have lots of RAM installed, especially if multiple clients will be connecting.
es: El sistema PC-BSD® debería tener mucha RAM instalada, sobre todo si se conectarán muchos clientes ligeros.

source: To configure the PC-BSD® system as a PXE Boot Desktop Server, run the following script as the superuser::
es: Para configurar el sistema PC-BSD® como un Servidor de Escritorio de Arranque PXE, ejecute el siguiente script como administrador::

source: If you wish to have the PC-BSD® system act as the DHCP server, type **d**. If the network already has a configured DHCP server, type **e**. The following example will install the DHCP server on the PC-BSD® system. After making your selection, press enter to continue::
es: Si desea tener el sistema PC-BSD® actuando como un servidor DHCP, escriba **d**. Si la red ya tiene un sistema DHCP configurado, escriba **e**. El siguiente ejemplo instalará el servidor DHCP en el sistema PC-BSD®. Tras hacer su selección, presione intro para continuar::

source: If your intent is to install a PXE Boot Desktop Server, input **r** and press enter. If you previously typed **d** and a DHCP server is not already installed, it will be installed for you. Once the DHCP server is installed, the tools needed in the PXE environment will be installed and messages will indicate the progress. Once everything is installed, you will see this message::
es: Si su intención es instalar el Servidor de Escritorio de Arranque PXE, introduzca **r** y presione intro. Si previamente presionó **d** y no está ya instalado un servidor DHCP, éste se instalará para usted. Una vez que el servidor DHCP esté instalado, las herramientas necesarias en el entorno PXE se instalarán y mensajes le indicarán el progreso. Una vez que todo esté instalado, verá este mensaje::

source: Input the FreeBSD device name of the interface that is attached to the local network containing the diskless workstations. This interface will run the DHCP server and should not be connected to a network with another DHCP server running. In the example shown here, the user has input the *em0* interface. If you are unsure of the device name, type :command:`ifconfig` from another terminal.
es: Introduzca el nombre del dispositivo FreeBSD de la interfaz que está conectada a la red local que contiene las estaciones de trabajo sin disco. Esta interfaz ejecutará el servidor DHCP y no debería estar conectada a una red con otro servidor DHCP corriendo. En el ejemplo mostrado aquí, el usuario ha introducido la interfaz *em0*. Si no está seguro del nombre del dispositivo escriba :command:`ifconfig` desde otra terminal.

source: The script will now configure the specified interface and start the required services::
es: El script configurará ahora la interfaz especificada e iniciará los servicios requeridos::

source: Before rebooting, you may wish to customize the installation.
es: Antes de reiniciar, puede personalizar la instalación.

source: The installation creates a chroot directory that contains a small PXE image that is used by clients to launch Xorg and connect to the PXE Boot Desktop Server. You can access this chroot by typing this command as the superuser::
es: La instalación crea un directorio chroot que contiene una imagen PXE pequeña que es usada por los clientes para iniciar Xorg y conectarse al Servidor de Escritorio de Arranque PXE. Puede accesar a este chroot escribiendo este comando como administrador::

source: Running :command:`pkg info` within the chroot will show which X components and drivers are available. Should you need to install additional video drivers, use :command:`pkg install` within the chroot. When you are finished using the chroot, type :command:`exit` to leave it.
es: Al ejecutar :command:`pkg info` dentro del chroot se mostrarán los componentes y controladores de X que están disponibles. En caso de que necesite instalar controladores de video adicionales, use :command:`pkg install` dentro del chroot. Cuando haya terminado de utilizar chroot, escriba :command:`exit` para salir de él.

source: The thin client script installs and configures the following services:
es: El script de cliente ligero instala y configura los siguientes servicios:

source: **NFS:** the Network File System is a protocol for sharing files on a network. It has been configured to allow clients on the network attached to the interface that you specified to connect to the thin client server. Its configuration file is located in :file:`/etc/exports`.
es: **NFS:** el Sistema de Archivos de Red (Network File System) es un protocolo para compartir archivos en una red. Se ha configurado para permitir a clientes en la red conectados a la interfaz que usted especificó, conectarse al servidor de clientes ligeros. Su archivo de configuración está ubicado en :file:`/etc/exports`.

source: **TFTP:** the Trivial File Transfer Protocol is a light-weight version of FTP used to transfer configuration or boot files between machines. The PXE network cards on the diskless computers will use TFTP to receive their configuration information. This service was enabled in :file:`/etc/inetd.conf` with a home directory of :file:`/usr/home/thinclient`.
es: **TFT:** el Protocolo de Transferencia de Archivos Trivial (Trivial File Transfer Protocol) es una versión ligera de FTP usado para transferir archivos de configuración o de arranque entre máquinas. Las tarjetas de red PXE en las computadoras sin disco utilizarán TFTP para recibir su información de configuración. Este servicio se habilitó en :file:`/etc/inetd.conf` con un directorio personal de :file:`/usr/home/thinclient`.

source: **DHCP:** the Dynamic Host Configuration Protocol is used to configure IP addressing info on the diskless workstations. If you selected to install a DHCP server, it will be configured to assign addresses for the network attached to the interface that you specified. Its configuration file is located in :file:`/usr/local/etc/dhcpd.conf`.
es: **DHCP:** el Protocolo de Configuración Dinámica del Host (Dynamic Host Configuration Protocol) se usa para configurar la información de la dirección IP en las estaciones de trabajo sin disco. Si usted seleccionó instalar un servidor DHCP, será configurado para asignar direcciones para la red conectada a la interfaz que usted especificó. Su archivo de configuración está ubicado en :file:`/usr/local/etc/dhcpd.conf`.

source: The thin client script also creates the *pxeboot* user with the default password *thinclient*. This username and password is used to save the working Xorg configuration files for each of the diskless computers. It is highly recommended that you change this password right away by running this command as the superuser::
es: El script de cliente ligero también crea un usuario *pxeboot* con la contraseña predeterminada *thinclient*. Este nombre de usuario y contraseña es usado para guardar los archivos funcionales de configuración de Xorg para cada uno de los equipos sin disco. Es altamente recomendable que cambie esta contraseña inmediatamente ejecutando este comando como administrador::

source: You will also need to create the users that will connect to the system. You can do so using or by typing :command:`adduser` at the command line and following the prompts.
es: También necesitará crear los usuarios que se conectarán al sistema. Puede hacerlo usando o escribiendo :command:`adduser` en la línea de comandos y siguiendo las instrucciones.

source: After a successful installation and reboot of the PXE Boot Desktop Server, the DHCP service will be running on the NIC you specified. Make sure that this NIC and a PXE capable client are connected to the same hub or switch. When you boot up the client, PXE should automatically obtain an IP address and begin to load PC-BSD®. If it does not, review the boot order settings in the BIOS on the client to make sure that PXE is listed first.
es: Tras una instalación exitosa y el reinicio del Servidor de Escritorio de Arranque PXE, el servidor DHCP estará ejecutándose en la NIC que usted especificó. Asegúrese que esta NIC y un cliente con capacidad PXE están conectados al mismo concentrador o switch. Cuando inicie el cliente, PXE debería obtener automáticamente una dirección IP y empezará a cargar PC-BSD®. Si no lo hace, revise el orden de arranque en la BIOS del cliente para asegurarse de que PXE se lista en primer lugar.

source: After the boot process has finished, the client will be brought to this prompt::
es: Después de que haya terminado el proceso de arranque, el cliente será llevado a este indicador de comandos::

source: If you wait 10 seconds, this message will timeout, and the client will bring up X in 1024x768 mode. If this is not the resolution that you wish to use, type "Y" at the prompt and hit enter to bring up the Xorg Configuration screen. In this menu, you will be able to setup your own custom :file:`xorg.conf` file, auto-detect settings, and test the new configuration. When finished, choose "Save working config" to send this configuration to the PXE Boot Desktop Server. This will prompt for the password of the pxeboot user. Once authenticated, the file will be saved by the client's MAC address in :file:`/home/pxeboot/mnt/xorg-config/<mac>.conf`. The next time you boot the client, it will automatically use the saved :file:`xorg.conf` file and bring the system to the PC-BSD® login screen.
es: Si espera 10 segundos, este mensaje desaparecerá, y el cliente cargará X en modo 1024x768. Si ésta no es la resolución que desea emplear, escriba "Y" a la pregunta y presione aceptar para mostrar la pantalla de Configuración de Xorg. En este menú podrá configurar su propio archivo personal :file:`xorg.conf`, detectar automáticamente los ajustes, y probar la nueva configuración. Cuando haya terminado elija "Guardar la configuración funcional" para enviar esta configuración al Servidor de Escritorio de Arranque PXE. Se le pedirá la contraseña del usuario pxeboot. Una vez autenticado, el archivo se guardará por la dirección MAC del cliente en :file:`/home/pxeboot/mnt/xorg-config/<mac>.conf`. La próxima vez que inicie el cliente, éste usará automáticamente el archivo :file:`xorg.conf` guardado y cargará en el sistema la pantalla de acceso de PC-BSD®.

source: in order for the login to succeed, the user account must already exist on the PXE Boot Desktop Server.
es: Para que el acceso tenga éxito, la cuenta de usuario debe existir en el Servidor de Escritorio de Arranque PXE.

source: The client's boot environment is located in :file:`/home/pxeboot`. This is mounted read-only during the PXE boot process to allow the client to bootup and create an XDCMP connection to the server.
es: El entorno de arranque del cliente esta ubicado en :file:`/home/pxeboot`. Este está montado en modo de solo lectura durante el proceso de arranque PXE para permitir al cliente arrancar y crear una conexión XDCMP con el servidor.

source: Once logged in to the PXE Boot Desktop Server, using PC-BSD® will be the same as if you had installed PC-BSD® on the client system. You will be able to use to install software and to save and use the files in your home directory.
es: Una vez conectado al Servidor de Escritorio de Arranque PXE, usar PC-BSD® será lo mismo que si hubiera instalado PC-BSD® en el sistema cliente. Podrá usarlo para instalar software, y guardar y usar los archivos en su directorio personal.

source: Use the **-remove** option if you wish to uninstall the PXE Boot Desktop Server::
es: Utilice la opción **-remove** si desea desinstalar el Servidor de Escritorio de Arranque PXE::

source: This will remove the PXE environment from the system. If you are finished using the PXE boot services, you can stop them using these commands::
es: Esto eliminará el entorno PXE del sistema. Si ha terminado de usar los servicios de arranque PXE, puede pararlos usando estos comandos::

source: and prevent them from restarting by removing these lines from :file:`/etc/rc.conf`::
es: Y les impide reiniciarse mediante la eliminación de estas líneas de :file:`/etc/rc.conf`::

source: Your interface name and IP address may differ from those in the example. The *dhcpd* and *portmap* lines will not exist if you did not install a DHCP server.
es: El nombre de su interfaz y dirección IP pueden ser diferentes de los del ejemplo. Las líneas *dhcpd* y *portmap* no existirán si no instala un servidor DHCP.

source: PXE Boot Install Server
es: Servidor de Instalación de Arranque PXE

source: A PC-BSD® PXE Boot Install Server can be used to install PC-BSD®, FreeBSD, or TrueOS® onto computers who connect to the server using PXE. The installations can be interactive or fully automated. The PXE Boot Install Server supports multiple, concurrent installations with the only limiting factor being the server's disk I/O and the network's bandwidth.
es: Un Servidor de Instalación de Arranque PXE de PC-BSD® se puede usar para instalar PC-BSD®, FreeBSD, o TrueOS® en equipos que se conecten al servidor usando PXE. Las instalaciones pueden ser interactivas o completamente automatizadas. El Servidor de Instalación de Arranque PXE soporta múltiples, y concurrentes instalaciones siendo el único factor limitante las I/O de disco del servidor y el ancho de banda de la red.

source: The installation of the PXE Boot Install Server starts the same way, except this time you select **i** when prompted::
es: La instalación del Servidor de Instalación de Arranque PXE comienza de la misma forma, excepto que esta vez usted selecciona **i** cuando se le pregunte::

source: Once the environment is downloaded and configured, you will be asked if you would like to install the web interface::
es: Una vez que el entorno se ha descargado y configurado, se le preguntará si desea instalar la interfaz web::

source: You will then be prompted to input the interface to be used by the server and then the services will be started::
es: Se le solicitará después que introduzca la interfaz que se empleará por el servidor y después se iniciarán los servicios::

source: Once the PXE Boot Install Server is installed, try to PXE boot a client which is connected to the same network. If the client boots successfully, you will see the installation screen shown in :numref:`Figure %s: PXE Boot Installation Menu <pxe1>`.
es: Una vez que el Servidor de Instalación de Arranque PXE está instalado, intente arrancar mediante PXE un cliente que esté conectado a la misma red. Si el cliente inicia satisfactoriamente, verá la pantalla de instalación mostrada en la :numref:`Figura %s: Menú de Instalación de Arranque PXE <pxe1>`.

source: By default, selecting "install" from the boot menu will use the :file:`/usr/home/thinclient/installscripts/pc-sysinstall.example` script which installs a basic FreeBSD system. In addition to starting an installation, this menu provides an emergency shell prompt. This can be useful if you have a system which can no longer boot and you wish to either access the disk's contents or attempt to repair the installation.
es: Por defecto, seleccionando "instalar" en el menú de arranque usará el script :file:`/usr/home/thinclient/installscripts/pc-sysinstall.example` el cual instalará un sistema FreeBSD básico. Además de comenzar una instalación, este menú proporciona un consola de emergencia. Esta puede ser útil si tiene un sistema que ya no puede arrancar y usted desea acceder a los contenidos del disco o intentar reparar la instalación.

source: Any scripts that you create and place in the :file:`/usr/home/thinclient/installscripts/` directory will be selectable as an installation option within the PXE client boot menu. Tables 5.5a and 5.5b in summarize the available configuration options when creating an installation script. Alternately, every time you install PC-BSD, the installation script is automatically saved to :file:`/root/pc-sysinstall.cfg`. This means that if you wish to repeat an installation, you simply need to copy that file to the :file:`/usr/home/thinclient/installscripts/` directory on the PXE Boot Install Server.
es: Cualquier script que cree y coloque en el directorio :file:`/usr/home/thinclient/installscripts/` será elegible como una opción de instalación en el menú del cliente de arranque PXE. Alternativamente, cada vez que instale PC-BSD, el script de instalación se guarda automáticamente en :file:`/root/pc-sysinstall.cfg`. Esto significa que si desea repetir una instalación, sólo necesita copiar ese archivo en el directorio :file:`/usr/home/thinclient/installscripts/` en el Servidor de Instalación de Arranque PXE.

source: The PXE Boot Install Server also supports completely unattended installations. To perform fully-automated installations over the PXE interface, create a configuration script named :file:`/usr/home/thinclient/installscripts/unattended.cfg`. When a PXE client first boots, it checks for the existence of the :file:`unattended.cfg` file, and if found, it will automatically use it for installation. Some caution should be taken when using this method since simply plugging a PXE boot client into the wrong LAN cable could cause it to be re-installed.
es: El Servidor de Instalación de Arranque PXE también soporta completamente instalaciones sin supervisión. Para realizar instalaciones totalmente automatizadas a través de una interfaz PXE, cree un script de configuración llamado :file:`/usr/home/thinclient/installscripts/unattended.cfg`. Cuando el cliente PXE se inicia, comprueba primero si existe un archivo :file:`unattended.cfg` y, si lo encuentra, lo usará automáticamente para la instalación. Deben tenerse algunas precauciones cuando emplee este método ya que sólo conectar un cliente de arranque PXE en un cable LAN incorrecto podría provocar que fuese reinstalado.

source: Security
es: Seguridad

source: Your PC-BSD® system is secure by default. This section provides an overview of the built-in security features and additional resources should you like to learn more about increasing the security of your system beyond its current level.
es: Su sistema PC-BSD® es seguro por defecto. Esta sección proporciona un resumen de las características de seguridad integradas y recursos adicionales si quiere saber más acerca de aumentar la seguridad de su sistema más allá del nivel actual.

source: The security features built into PC-BSD® include:
es: Las características de seguridad incorporadas en PC-BSD® incluyen:

source: **Naturally immune to viruses and other malware:** most viruses are written to exploit Windows systems and do not understand the binaries or paths found on a PC-BSD® system. Antivirus software is still available in the Security section of :ref:`AppCafe®` as this can be useful if you send or forward email attachments to users running other operating systems.
es: **Inmunidad natural a virus y otro software malicioso:** la mayoría de los virus están escritos para infectar sistemas Windows y no comprenden los binarios o rutas que hay en un sistema PC-BSD®. Software antivirus sigue disponible en la sección de Seguridad de :ref:`AppCafe®` lo que puede ser útil si usted envía o reenvía adjuntos de correo a usuarios que ejecutan otros sistemas operativos.

source: **Potential for serious damage is limited:** file and directory ownership and permissions along with separate user and group functions mean that as an ordinary user any program executed will only be granted the abilities and access of that user. A user that is not a member of the *wheel* group can not switch to administrative access and can not enter or list the contents of a directory that has not been set for universal access.
es: **El potencial de daños serios es limitado:** la propiedad y permisos de archivos y directorios junto con funciones separadas de usuarios y grupos implicando que como un usuario ordinario, cualquier programa ejecutado solo se le otorgarán las capacidades y accesos que tenga dicho usuario. Un usuario que no es miembro del grupo *wheel* no podrá cambiar a un acceso en modo administrativo y no podrá entrar o listar el contenido de un directorio que no se haya configurado para tener un acceso universal.
