Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook/*/using.po
Languages: es

source: **Built-in firewall:** the default firewall ruleset allows you to access the Internet and the shares available on your network but does not allow any inbound connections to your computer. In addition, `Fail2ban <http://www.fail2ban.org/wiki/index.php/Main_Page>`_ is installed. This service can be configured to identify possible break-in attempts and to respond with an action such as creating a firewall rule to ban the intruder. Instructions for configuring fail2ban can be found on the `fail2ban wiki <http://www.fail2ban.org/wiki/index.php/MANUAL_0_8#Usage>`_.
es: **Cortafuegos integrado:** el conjunto de reglas predeterminadas del cortafuegos le permiten acceder a Internet y a los recursos compartidos disponibles en su red pero no permiten ninguna conexión entrante a su equipo. Además, está instalado `Fail2ban <http://www.fail2ban.org/wiki/index.php/Main_Page>`_ . Este servicio se puede configurar para identificar posibles intentos de intrusión y responder con una acción tal como la creación de una regla para prohibir al intruso. Las instrucciones para la configuración de fail2ban se pueden encontrar en el `wiki de fail2ban <http://www.fail2ban.org/wiki/index.php/MANUAL_0_8#Usage>`_.

source: **Very few services are enabled by default:** you can easily view which services are started at boot time using :ref:`Service Manager` or by reading through :file:`/etc/rc.conf`. You can disable the services that you do not use by disabling that service in :ref:`Service Manager` or by commenting out that line with a *#* in :file:`/etc/rc.conf`.
es: **Muy pocos servicios están habilitados por defecto:** usted puede ver fácilmente qué servicios son iniciados durante el arranque usando el :ref:`Administrador de Servicios` o leyendo el archivo :file:`/etc/rc.conf`. Puede deshabilitar los servicios que no use deshabilitando ese servicio en el :ref:`Administrador de Servicios` o comentando una línea con un *#* en :file:`/etc/rc.conf`.

source: **SSH is disabled by default:** and can only be enabled by the superuser. This setting prevents bots and other users from trying to access your system. If you do need to use SSH, add the line *sshd_enable=YES* to :file:`/etc/rc.conf`. You can then start the service by typing :command:`service sshd start`. You will need to add a firewall rule using :ref:`Firewall Manager` to allow SSH connections over TCP port 22.
es: **SSH está deshabilitado por defecto.** y sólo puede ser habilitado por el administrador. Este ajuste previene que los bots y otros usuarios puedan conectarse a su sistema. Si realmente necesita usar SSH, añada la línea *sshd_enable=YES* a :file:`/etc/rc.conf`. Después puede iniciar el servicio escribiendo :command:`service sshd start`. Necesitará añadir una regla de cortafuegos mediante el :ref:`Administrador del Cortafuegos` para permitir conexiones SSH a través del puerto TCP 22.

source: **SSH root logins are disabled by default:** if you enable SSH, you must login as a regular user and use :command:`su` or :command:`sudo` when you need to perform administrative actions. You should not change this default as this prevents an unwanted user from having complete access to your system.
es: **Las conexiones SSH del administrador están deshabilitadas por defecto:** si usted habilita SSH, debe conectarse como un usuario regular y usar :command:`su` o :command:`sudo` cuando necesite realizar acciones administrativas. No debería cambiar este comportamiento por defecto ya que se evita que un usuario no deseado tenga acceso completo a su sistema.

source: **sudo is installed:** and configured to allow users in the *wheel* group permission to run an administrative command after typing their password. By default, the first user you create during installation is added to the *wheel* group. You can use :ref:`User Manager` to add other users to this group. You can change the default :command:`sudo` configuration using the :command:`visudo` command as the superuser.
es: **sudo está instalado:** y configurado para dar a los usuarios del grupo *wheel* el permiso para ejecutar un comando administrativo tras escribir su contraseña. Por defecto, el primer usuario que cree durante la instalación se añade al grupo *wheel*. Puede utilizar el :ref:`Administrador de Usuarios` para añadir otros usuarios a este grupo. Como administrador puede cambiar la configuración predeterminada de :command:`sudo` empleando el comando :command:`visudo`.

source: **Automatic notification of security advisories:** :ref:`Update Manager` will automatically notify you if an update is available as the result of a `security advisory <http://www.freebsd.org/security/advisories.html>`_ that affects PC-BSD®. This allows you to keep your operating system fully patched with just the click of a mouse.
es: **Notificación automática de avisos de seguridad:** el :ref:`Administrador de Actualizaciones` le notificará automáticamente si hay disponible una actualización como resultado de un `aviso de seguridad <http://www.freebsd.org/security/advisories.html>`_ que afecte a PC-BSD®. Esto le permite mantener su sistema operativo completamente parchado con solo un clic del ratón.

source: PC-BSD® packages are built with `LibreSSL <http://www.libressl.org/>`_ which has fewer vulnerabilities than OpenSSL.
es: Los paquetes de PC-BSD® se construyen con `LibreSSL <http://www.libressl.org/>`_ que tiene menos vulnerabilidades que OpenSSL.

source: :ref:`PersonaCrypt` allows a user to use a removable, encrypted device as their home directory.
es: :ref:`PersonaCrypt` permite a un usuario utilizar un dispositivo extraíble y encriptado como su directorio personal.

source: Logging into a stealth session creates an encrypted zvol as a temporary home directory for that login session. When the user logs out of a stealth session, the zvol is destroyed, along with the contents of the temporary home directory.
es: Accesando a una sesión sigilosa crea un zvol encriptado como directorio personal temporal para esa sesión. Cuando el usuario se desconecta de la sesión sigilosa, se destruye el zvol, junto con el contenido del directorio personal temporal.

source: :ref:`Tor Mode` can be used to anonymously access Internet sites as this mode automatically forwards all Internet traffic through the `Tor Project's <https://www.torproject.org/>`_ transparent proxy service.
es: El :ref:`Modo Tor` puede usarse para acceder de forma anónima a sitios de Internet, ya que este modo envía automáticamente todo el tráfico de Internet a través del servicio de proxy transparente del `Proyecto Tor <https://www.torproject.org/>`_.

source: If you would like to learn more about security on FreeBSD/PC-BSD® systems, :command:`man security` is a good place to start. These resources provide more information about security on FreeBSD-based operating systems:
es: Si quiere saber más sobre la seguridad de los sistemas FreeBSD/PC-BSD®, :command:`man security` es un buen lugar donde empezar. Estos recursos proporcionan más información sobre seguridad en los sistemas basados en FreeBSD:

source: `FreeBSD Security Information <http://www.freebsd.org/security/>`_
es: `Información de Seguridad de FreeBSD <http://www.freebsd.org/security/>`_

source: `Security Section of FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/security.html>`_
es: `Sección sobre Seguridad del Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/security.html>`_

source: `Hardening FreeBSD <http://www.bsdguides.org/2005/hardening-freebsd/>`_
es: `Asegurando FreeBSD <http://www.bsdguides.org/2005/hardening-freebsd/>`_

source: Tor Mode
es: Modo Tor

source: Tor mode uses `Tor <https://www.torproject.org/>`_, `socat <http://www.dest-unreach.org/socat/>`_, and a built-in script which automatically creates the necessary firewall rules to enable and disable tor mode at the user's request. While in tor mode, the firewall will redirect all outgoing port 80 (HTTP), 443 (HTTPS), and DNS traffic through the Tor transparent proxy network.
es: El modo Tor emplea `Tor <https://www.torproject.org/>`_, `socat <http://www.dest-unreach.org/socat/>`_, y un script integrado que crea automáticamente las reglas de cortafuegos necesarias para habilitar y deshabilitar el modo Tor cuando lo solicite el usuario. Mientras está en modo Tor, el cortafuegos redireccionará toda salida al puerto 80 (HTTP), 443 (HTTPS), y el tráfico DNS a través de la red del proxy transparente Tor.

source: To start tor mode, right-click Update Manager and check the "Routing through Tor" box. The pop-up message shown in :numref:`Figure %s: Enabling Tor Mode <tor1>` will appear.
es: Para iniciar el modo tor, presione botón derecho en el Administrador de Actualizaciones y seleccione la casilla "Direccionando a través de Tor". El mensaje emergente mostrado en la :numref:`Figura %s: Habilitando el Modo Tor <tor1>` aparecerá.

source: If you have never used the Tor network before, it is recommended to read the link for the Tor FAQ. Click "Yes" to enable tor mode and enter your password when prompted so that the firewall rules can be updated for you.
es: Si nunca antes ha usado la red Tor, es recomendable leer el enlace de las FAQ de Tor. Presione en "Sí" para habilitar el modo Tor e introducir la contraseña cuando se le pida para que las reglas del cortafuegos se puedan actualizar para usted.

source: While in tor mode, a small onion will be added to the Update Manager icon and, if you hover over the icon, it will say "(Routing through Tor)". You can also verify that you are connected to the Tor network by right-clicking Update Manager and clicking "Check Tor connection". It will take a moment or so, but a pop-up message should indicate that the connection to `<https://check.torproject.org/>`_ succeeded.
es: Mientras esté en modo Tor, se añadirá una pequeña cebolla al icono del Administrador de Actualizaciones y, si pasa el ratón sobre el icono, aparecerá "(Direccionando a través de Tor)". Usted también puede verificar que está conectado a la red de Tor haciendo clic derecho en el Administrador de Actualizaciones y presionando "Comprobar la conexión Tor". Tomará un momento, pero un mensaje emergente debería indicarle que la conexión a `<https://check.torproject.org/>`_ tuvo éxito.

source: the system will remain in tor mode, even after a reboot, until you disable it. To disable tor mode, right-click Update Manager and uncheck the "Routing through Tor" box. Now when you "Check Tor connection", it should indicate that you are not using Tor.
es: El sistema permanecerá en modo Tor, incluso tras un reinicio, hasta que lo deshabilite. Para deshabilitar el modo Tor, haga clic derecho en el Administrador de Actualizaciones y desmarque la casilla "Direccionando a través de Tor". Ahora, cuando "Compruebe la Conexión Tor", debería indicar que no está usando Tor.

source: To enable and disable tor mode from the command line or on a desktop that does not provide a system tray, use the following commands:
es: Para habilitar y deshabilitar el modo Tor desde la línea de comando o desde un escritorio que no proporcione una bandeja del sistema, use los siguientes comandos:

source: :command:`sudo enable-tor-mode` enables tor mode.
es: :command:`sudo enable-tor-mode` habilita el modo Tor.

source: :command:`sudo disable-tor-mode` disables tor mode.
es: :command:`sudo disable-tor-mode` deshabilita el modo Tor.

source: Accessibility
es: Accesibilidad

source: The GNOME and KDE desktop environments provide accessibility features to assist users with vision and mobility impairments. In PC-BSD®, these desktops can be installed either during installation or afterwards using :ref:`AppCafe®`.
es: Los entornos de escritorio GNOME y KDE proporcionan características de accesibilidad para asistir a usuarios con discapacidades de visión y movilidad. En PC-BSD®, estos escritorios se pueden instalar bien durante la instalación o posteriormente usando :ref:`AppCafe®`.

source: This section provides an overview of the features provided by each desktop and additional references to these features.
es: Esta sección proporciona un resumen de las características que aporta cada escritorio y referencias adicionales a ellas.

source: GNOME Universal Access
es: Acceso Universal de GNOME

source: GNOME3 provides a "Universal Access" utility for configuring the desktop for accessibility. To open this utility, open "Activities" and search for "Universal Access". This will open the screen shown in :numref:`Figure %s: Universal Access Screen <access1>`.
es: GNOME3 proporciona una utilería de "Acceso Universal" para configurar el escritorio para accesibilidad. Para abrir esta utilería, abra "Actividades" y busque "Acceso Universal". Esto abrirá la pantalla mostrada en la :numref:`Figura %s: Pantalla de Acceso Universal <access1>`.

source: The "Seeing" section of this screen has options for assisting users with low vision.
es: La sección "Vista" de esta pantalla tiene opciones para ayudar a usuarios con visión reducida.

source: Click "Off" in the "Hearing" section to open a pop-up screen used to enable visual alerts, either to the window title of the current window or the entire screen. The pop-up screen provides a "Test flash" button for testing the settings.
es: Presione "Apagar" en la sección "Escuchar" para abrir una pantalla emergente que se usa para habilitar las alertas visuales, bien en el título de la ventana actual o en la pantalla completa. La pantalla emergente proporciona un botón "Flash de prueba" para comprobar los ajustes.

source: If you click "Off" next to "Typing Assist (AccessX)" in the "Typing" section, it will open the screen shown in :numref:`Figure %s: Keyboard and Key Options <access2>`. "Sticky Keys", "Slow Keys", and "Bounce Keys" can be enabled in this screen to assist users with mobility impairments.
es: Si presiona "Apagar" junto a "Asistencia al Teclear (AccessX)" en la sección "Tecleando", abrirá la pantalla mostrada en la :numref:`Figura %s: Teclado y Opciones de Teclas <access2>`. "Teclas Sticky", "Teclas Lentas", y "Teclas de Rebote" pueden ser habilitadas en esta pantalla para asistir a usuarios con impedimentos de movilidad.

source: If you click the "Off" next to "Click Assist" in the "Pointing and Clicking" section, you can configure a simulated secondary click and a hover click.
es: Si presiona "Apagar" junto a "Asistencia al Pulsar" en la sección "Señalando y Pulsando", puede configurar un clic de ratón secundario y un clic por superposición simulados.

source: More information about the options provided by Universal Access can be found at the `GNOME Universal page <https://help.gnome.org/users/gnome-help/3.16/a11y.html.en>`_.
es: Más información sobre las opciones proporcionadas por el Acceso Universal se pueden encontrar el la `página de GNOME Universal <https://help.gnome.org/users/gnome-help/3.16/a11y.html.en>`_.

source: KDE Accessibility Tools
es: Herramientas de Accesibilidad de KDE

source: To install the KDE accessibility tools, use :ref:`AppCafe®`. Check the "Search all available PBI and packages" in "App Search" and search for the "kdeaccessibility" package.
es: Para instalar las herramientas de accesibilidad de KDE, use :ref:`AppCafe®`. Seleccione "Buscar todos los PBI y paquetes" en "Búsqueda de Aplicaciones" y busque el paquete "kdeaccessibility".

source: The KDE-Accessibility component installs the following software:
es: El componente de accesibilidad de KDE instala el software siguiente:

source: `KMag <https://docs.kde.org/stable4/en/kdeaccessibility/kmag/index.html>`_: a screen magnifier. In KDE, this application is in :menuselection:`Applications --> Utilities --> Screen Magnifier` or you can type :command:`kmag` from the command line. Drag the magnifier window over the text you wish to magnify or click its "Settings" button to view the shortcuts for its various modes. Click :kbd:`F1` while the application is open to access the Kmagnifier Handbook.
es: `KMag <https://docs.kde.org/stable4/en/kdeaccessibility/kmag/index.html>`_: una lupa de pantalla. En KDE, esta aplicación está en :menuselection:`Aplicaciones --> Utilerías --> Lupa de Pantalla` o puede escribir :command:`kmag` en la línea de comandos. Arrastre la ventana de la lupa sobre el texto que quiera magnificar o presione el botón de "Configuraciones" para ver los accesos directos a sus diferentes modos. Presione :kbd:`F1` mientras la aplicación está abierta para accesar al Manual de Kmagnifier.

source: `KMouseTool <https://docs.kde.org/stable4/en/kdeaccessibility/kmousetool/>`_: clicks the mouse whenever the mouse cursor pauses briefly. It can also drag the mouse, although this takes a bit more practice. To start this utility in KDE, click :menuselection:`Applications --> Utilities --> Automatic Mouse Click` or type :command:`kmousetool` from the command line. In the screen shown in :numref:`Figure %s: Configuring KMouseTool <access3>`, check the settings you wish to use, click the "Apply" button, then click the "Start" button. If you quit this screen, it will be added to the system tray and will continue to run until you launch its icon and click the "Stop" button.
es: `KMouseTool <https://docs.kde.org/stable4/en/kdeaccessibility/kmousetool/>`_: presiona el ratón cada vez que el cursor se pausa brevemente. También puede arrastrar el ratón, aunque esto toma un poco más de práctica. Para iniciar esta utilería en KDE, presione :menuselection:`Aplicaciones --> Utilerías --> Clic Automático del Ratón` o ingrese :command:`kmousetool` desde la línea de comandos. En la pantalla mostrada en la :numref:`Figura %s: Configurando KMouseTool <access3>`, revise las configuraciones que quiera usar, presione el botón "Aplicar", y presione el botón "Iniciar". Si sale de esta pantalla, se añadirá a la bandeja del sistema y continuará corriendo hasta que lance su icono y presione el botón "Parar".

source: `KMouth <https://docs.kde.org/stable4/en/kdeaccessibility/kmouth/index.html>`_: enables persons that cannot speak to speak through their computer. It keeps a history of spoken sentences from which the user can select to be re-spoken. To start this program, click :menuselection:`Applications --> Utilities --> Speech Synthesizer Frontend` or type :command:`kmouth` from the command line. The first time you run this application, a configuration wizard will prompt you to set the command to use for speaking texts (such as :file:`/usr/local/bin/espeak`) and the character encoding.
es: `KMouth <https://docs.kde.org/stable4/en/kdeaccessibility/kmouth/index.html>`_: habilita a personas que no pueden hablar a que lo puedan hacer a través de su equipo. Guarda un historial de frases habladas de las cuales el usuario puede seleccionar para decirlas de nuevo. Para iniciar este programa, presione en :menuselection:`Aplicaciones --> Utilerías --> Sintetizador de Voz` o escriba :command:`kmouth` en la línea de comandos. La primera vez que ejecute esta aplicación, un asistente de configuración le pedirá que establezca el comando que se usará para los textos hablados (tal como :file:`/usr/local/bin/espeak`) y la codificación de los caracteres.
