Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/advanced.po
Languages: es

source: **zimport** this option will display the names of available ZFS pools. Type the name of an available pool and it will import it then display the available boot environments (BEs). Type the name of the desired BE and this option will mount it then offer to open a chroot shell so that you can view its contents and manipulate files as needed in order to perform maintenance on that boot environment. When you are finished, type :command:`exit` to leave the boot environment and return to the screen shown in :numref:`Figure %s: System Utilities Menu <util1>`.
es: **zimport** esta opción desplegará los nombres de los pools ZFS disponibles. Ingrese el nombre de algún pool disponible y se importará y mostrará los entornos de arranque (BEs) disponibles. Ingrese el nombre del BE deseado y esta opción lo montará y le ofrecerá abrir una consola chroot para que pueda ver su contenido y manipular archivos como vaya necesitando para realizar un mantenimiento en ese entorno de arranque. Cuando termine, ingrese :command:`exit` para dejar el entorno de arranque y regresar a la pantalla mostrada en la :numref:`Figura %s: Menú de Utilerías del Sistema <util1>`.

source: **fixgrub:** this option can be used to restamp the GRUB boot loader should the installed system no longer boot. When this option is selected, it will first show the available ZFS pools and prompt you to input the name of the pool to import.
es: **fixgrub:** esta opción se puede usar para reinstalar el gestor de arranque GRUB en caso de que el sistema instalado ya no arranque. Cuando se selecciona esta opción, primero mostrará los pools ZFS disponibles y le pedirá que ingrese el nombre del pool a importar.

source: **exit:** this option will return you to the main menu seen in :numref:`Figure %s: Text Installation Menu <text1>`.
es: **exit:** esta opción lo regresará al menú principal mostrado en la :numref:`Figura %s: Menú de la Instalación en Modo Texto <text1>`.

source: Install a Server
es: Instalando un Servidor

source: The :ref:`System Selection Screen` of the PC-BSD® installer can be used to install TrueOS®, a FreeBSD-based server operating system, rather than a PC-BSD® desktop operating system.
es: La :ref:`Pantalla de Selección de Sistema` del instalador PC-BSD® se puede usar para instalar TrueOS®, un sistema operativo servidor basado en FreeBSD, en vez de un sistema operativo PC-BSD® de escritorio.

source: TrueOS® adds the following to a vanilla installation of FreeBSD: :command:`iocage` for jail management and the command line versions of most of the :ref:`Control Panel` utilities. You will find those utilities in :file:`/usr/local/bin/pc-*`. It also installs the software mentioned in `the RUN_DEPENDS= section of this file <https://github.com/pcbsd/freebsd-ports/blob/master/misc/trueos-base/Makefile>`_.
es: TrueOS® añade lo siguiente a su instalación básica de FreeBSD: :command:`iocage` para la administración de jaulas y las versiones de línea de comandos de la mayoría de las utilerías del :ref:`Panel de Control`. Encontrará esas utilerías en :file:`/usr/local/bin/pc-*`. También instala el software mencionado en `la sección RUN_DEPENDS= de este archivo <https://github.com/pcbsd/freebsd-ports/blob/master/misc/trueos-base/Makefile>`_.

source: For a server installation, using the PC-BSD® installer rather than the FreeBSD installer offers several benefits:
es: Para la instalación de un servidor, emplear el instalador de PC-BSD® en vez del instalador de FreeBSD ofrece algunas ventajas:

source: the ability to easily configure ZFS during installation
es: La capacidad de configurar fácilmente ZFS durante la instalación

source: the ability to configure multiple boot environments
es: La capacidad de configurar múltiples entornos de arranque

source: a wizard (described in this section) is provided during installation to configure the server for first use
es: Se proporciona un asistente (descrito en esta sección) durante la instalación para configurar el servidor para su primer uso

source: this section describes how to install a command-line only server using the PC-BSD® graphical installer. Alternately, you can also install a server :ref:`Using the TrueOS® CD` or :ref:`Using the Text Installer`.
es: Esta sección describe como instalar un servidor sólo en línea de comandos usando el instalador gráfico de PC-BSD®. Alternativamente, también se puede instalar una servidor :ref:`Usando el CD de TrueOS®` o :ref:`Usando el Instalador en Modo Texto`.

source: To perform a server installation, start the PC-BSD® installer as usual. When you get to the :ref:`System Selection Screen` of the installer, select "Server (TrueOS)", as shown in :numref:`Figure %s: Selecting to Install TrueOS® <server1>`.
es: Para realizar una instalación de servidor, comience como siempre con el instalador de PC-BSD®. Cuando llegue a la :ref:`Pantalla de Selección del Sistema` del instalador, seleccione "Server (TrueOS)", como se muestra en la :numref:`Figura %s: Seleccionando la Instalación de TrueOS® <server1>`.

source: Click "Next" to start the "Server Setup Wizard" then click "Next" again to see the screen shown in :numref:`Figure %s: Set the Root Password <server2>`.
es: Presione "Siguiente" para iniciar el "Asistente de Configuración de Servidor" y presione "Siguiente" nuevamente para ver la pantalla mostrada en la :numref:`Figura %s: Estableciendo la Contraseña de Administrador <server2>`.

source: Input and confirm the root password then click "Next" to proceed to the screen shown in :numref:`Figure %s: Create the Primary User Account <server3>`.
es: Ingrese y confirme la contraseña de administrador y presione "Siguiente" para proceder a la pantalla mostrada en la :numref:`Figura %s: Creando la Cuenta De Usuario Primario <server3>`.

source: For security reasons, you should not login as the *root* user. For this reason, the wizard requires you to create a primary user account that will be used to login to the server. This account will automatically be added to the *wheel* group, allowing that user to :command:`su` to the root account when administrative access is required.
es: Por razones de seguridad, no debería conectarse como *administrador*. Por esta razón el asistente solicita crear una cuenta primaria de usuario que se usará para conectarse al servidor. Esta cuenta se añadirá automáticamente al grupo *wheel*, permitiendo a ese usuario conectarse a través de :command:`su` a la cuenta del administrador cuando se requiera.

source: This screen contains the following fields:
es: Esta pantalla contiene los siguientes campos:

source: **Name:** can contain capital letters and spaces.
es: **Nombre:** puede contener letras mayúculas y espacios.

source: **Username:** the name used when logging in. Can not contain spaces and is case sensitive (e.g. *Kris* is a different username than *kris*).
es: **Nombre de usuario:** el nombre empleado cuando ingrese. No puede contener espacios y es sensible a mayúsculas (por ejemplo, *Kris* es un usuario diferente a *kris*).

source: **Password:** the password used when logging in. You must type it twice in order to confirm it.
es: **Contraseña:** la contraseña empleada cuando se accede. Debe escribirla dos veces para confirmarla.

source: **Default shell:** use the drop-down menu to select the **csh**, **tcsh**, **sh**, or **bash** login shell.
es: **Consola predeterminada:** use el menú desplegable para seleccionar la consola de acceso **csh**, **tcsh**, **sh**, o **bash**.

source: When finished, click "Next" to proceed to the screen shown in :numref:`Figure %s: Set the Hostname <server4>`.
es: Cuando termine, presione "Siguiente" para proceder a la pantalla mostrada en la :numref:`Figura %s: Estableciendo el Nombre de Equipo <server4>`.

source: Input the system's hostname. If you will be using :command:`ssh` to connect to the system, check the box "Enable remote SSH login". Click "Next" to proceed to the network configuration screen shown in :numref:`Figure %s: Configure the Network <server5>`.
es: Ingrese el nombre del equipo. Si estará usando :command:`ssh` para conectarse al sistema, marque la casilla "Habilitar conexiones remotas SSH". Presione "Siguiente" para proceder a la pantalla de configuración de red mostrada en la :numref:`Figura %s: Configurando la Red <server5>`.

source: Use the "Network Interface" drop-down menu to select from the following:
es: Use el menú desplegable "Interfaz de Red" para seleccionar lo siguiente:

source: **AUTO-DHCP-SLAAC:** (default) will configure every active interface for DHCP and for both IPv4 and IPv6
es: **AUTO-DHCP-SLAAC:** (predeterminado) configurará todas las interfaces activas para DHCP y para ambos, IPv4 y IPv6.

source: **AUTO-DHCP:** will configure every active interface for DHCP and for IPv4
es: **AUTO-DHCP:** configurará todas las interfaces activas para DHCP y para IPv4

source: **IPv6-SLAAC:** will configure every active interface for DHCP and for IPv6
es: **IPv6-SLAAC:** configurará todas las interfaces para DHCP y para IPv6

source: Alternately, select the device name for the interface that you wish to manually configure and input the IPv4 and/or IPv6 addressing information. When finished, click "Next" to proceed to the screen shown in :numref:`Figure %s: Configure Remote Access to AppCafe <server6>`.
es: Alternativamente, seleccione el nombre de dispositivo para la interfaz que quiera configurar manualmente e ingrese la información de las direcciones IPv4 y/o IPv6. Cuando termine, presione "Siguiente" para proceder a la pantalla mostrada en la :numref:`Figura %s: Configurando el Acceso Remoto a AppCafe <server6>`.

source: If you would like to manage installed software or jails from your phone or a remote system, check the box "Enable AppCafe Remote". If you only plan to use :ref:`AppCafe®` from the system you are installing, click "Next" to instead continue to the next screen.
es: Si desea administrar el software instalado o jaulas desde un teléfono o desde un sistema remoto, seleccione la casilla "Habilitar AppCafe Remote". Si solo planea usar :ref:`AppCafe®` desde el sistema que se está instalando, presione "Siguiente" para continuar a la siguiente pantalla.

source: If you check the box to configure remote access, input a username and password and select the port number to use when accessing AppCafe® from another device. When finished, click "Next" to access the screen shown in :numref:`Figure %s: Install Ports <server7>`.
es: Si marca la casilla para configurar el acceso remoto, ingrese un nombre de usuario y contraseña y seleccione el número de puerto a usar cuando accese a AppCafe® desde otro dispositivo. Cuando termine, presione "Siguiente" para accesar a la pantalla mostrada en la :numref:`Figura %s: Instalando Ports <server7>`.

source: If you wish to install the FreeBSD ports collection, check the "Install ports tree" box then click "Finish" to exit the wizard and access the summary screen shown in :numref:`Figure %s: Review Installation Summary <install5>`.
es: Si quiere instalar la colección de ports de FreeBSD, marque la casilla "Instalar el árbol de ports" y presione "Terminar" para salir del asistente y accesar la pantalla de resumen mostrada en la :numref:`Figura %s: Revisando el Resumen de la Instalación <install5>`.

source: Click "Customize" if you wish to proceed to the screen in order to configure the system's disk(s).
es: Presione "Personalizar" si desea ir a la pantalla para configurar el(los) disco(s) del sistema.

source: If you wish to save the finished configuration to re-use it at a later time, insert a FAT-formatted USB stick and click "Save Config to USB".
es: Si desea guardar la configuración terminada para reutilizarla más tarde, inserte un dispositivo USB formateado con FAT y presione en "Guardar la Configuración al USB".

source: Once you are ready to start the installation, click "Next". A pop-up menu will ask if you would like to start the installation now.
es: Una vez que esté listo para empezar la instalación, presione en "Siguiente". Surgirá un menú que preguntará si quiere comenzar ya con la instalación.

source: Once the system is installed, it will boot to a command-line login prompt. Login using the primary user account that was configured during installation. You can now configure and use the server as you would any other FreeBSD server installation. The `FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/>`_ is an excellent reference for performing common FreeBSD server tasks.
es: Una vez instalado el sistema, arrancará en un indicador de comandos. Acceda empleando la cuenta primaria de usuario que se configuró durante la instalación. Ahora puede configurar y usar el servidor como lo haría en cualquier instalación de servidor de FreeBSD. El `Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/>`_ es una referencia excelente para realizar tareas comunes en un servidor FreeBSD.

source: Using the TrueOS® CD
es: Usando el CD de TrueOS®

source: PC-BSD® provides a CD-sized TrueOS® ISO which provides an ncurses installer for installing a command-line version of TrueOS®. If your intent is to only install servers and you do not need a graphical installer, this ISO is convenient to use and quick to download.
es: PC-BSD® tiene disponible una ISO de TrueOS® del tamaño de un CD, que proporciona un instalador ncurses para instalar una version de TrueOS® en línea de comandos. Si pretende instalar sólo servidores y no se necesita un instalador gráfico, esta ISO es apropiada para usar y rápida de descargar.

source: To start a server installation using the TrueOS® ISO, insert the prepared boot media. The initial boot menu, shown in :numref:`Figure %s: TrueOS® Boot Menu <cd1>`, indicates that this is a TrueOS® installation.
es: Para comenzar una instalación de servidor usando la ISO de TrueOS®, inserte el medio de arranque preparado. El menú de arranque inicial, mostrado en la :numref:`Figura %s: Menú de Arranque de TrueOS® <cd1>`, indica que esta es una instalación de TrueOS®.

source: The installer will finish booting and display the installation menu shown in :numref:`Figure %s: TrueOS® Installation Menu <cd2>`.
es: El instalador terminará de arrancar y desplegará el menú de instalación mostrado en la :numref:`Figura %s: Menú de Instalación de TrueOS® <cd2>`.

source: To begin the installation, press :kbd:`Enter`. The server installation will proceed as described in :ref:`Using the Text Installer`.
es: Para comenzar la instalación, presione :kbd:`Intro`. La instalación del servidor procederá como se describe en :ref:`Usando el Instalador en Modo Texto`.

source: The TrueOS® boot media can also be used to repair an existing installation, using the instructions in :ref:`Using the System Utilities Menu`.
es: El medio de arranque de TrueOS® puede usarse para reparar una instalación existente, siguiendo las instrucciones que hay en :ref:`Usando el Menú de Utilerías del Sistema`.

source: Dual Booting
es: Arranque Dual

source: A PC-BSD® installation assumes that you have an existing primary partition to install into. If your computer has only one disk and PC-BSD® will be the only operating system, it is fine to accept the default partitioning scheme. However, if you will be sharing PC-BSD® with other operating systems, be careful that PC-BSD® is installed into the correct partition or you may inadvertently overwrite an existing operating system.
es: Una instalación de PC-BSD® asume que usted tiene un partición primaria para instalarlo. Si su computadora tiene solo un disco y PC-BSD® será el único sistema operativo, está bien aceptar el esquema de particiones predeterminado. Pero, si estará compartiendo PC-BSD® con otros sistemas operativos, asegúrese de que PC-BSD® se instale en la partición correcta o usted podría inadvertidamente sobreescribir un sistema operativo existente.

source: If you wish to install multiple operating systems on your computer, you will need the following:
es: Si desea instalar múltiples sistemas operativos en el equipo, necesitará lo siguiente:

source: a partition for each operating system. Many operating systems, including PC-BSD®, can only be installed into a primary or GPT partition. This means that you will need to use partitioning software as described in :ref:`Creating Free Space`.
es: Una partición para cada sistema operativo. Muchos sistemas operativos, incluido PC-BSD®, pueden ser instalados sólo en una partición primaria o partición GPT. Esto significa que necesitará emplear software de particionado como se describe en :ref:`Creando Espacio Libre`.

source: a backup of any existing data. This backup should not be stored on your computer's hard drive but on another computer or on a removable media such as a USB drive or burnt onto a DVD media. If you are careful in your installation, everything should go fine. However, you will be glad that you made a backup should something go wrong.
es: Un respaldo de todos los datos existentes. Este respaldo no debería almacenarse en el disco duro de su equipo sino en otro equipo, o en un disposivo extraíble como un disco USB o grabado en un DVD. Si es cuidadoso durante la instalación, todo debería salir bien. Sin embargo, se alegrará de haber hecho un respaldo si algo fuera mal.

source: When installing PC-BSD® onto a computer that is to contain multiple operating systems, care must be taken to **select the correct partition** in the :ref:`Disk Selection Screen` of the installation. On a system containing multiple partitions, each partition will be listed. Highlight the partition that you wish to install into and **make sure that you do not select a partition that already contains an operating system or data that you wish to keep.**
es: Cuando se instala PC-BSD® en un equipo que va a contener múltiples sistemas operativos, hay que tener cuidado en **seleccionar la partición correcta** en la :ref:`Pantalla de Selección de Disco` de la instalación. En un sistema que contiene múltiples particiones, todas ellas aparecerán en una lista. Marque la partición en la que desea la instalación y **asegúrese de que no selecciona una partición que ya contiene un sistema operativo o datos que desea conservar.**

source: **make sure that you click the "Customize" button while in the "Disk Selection" screen.** If you just click "Next" without customizing the disk layout, the installer will overwrite the contents of the primary disk.
es: **Asegúrese de presionar en el botón de "Personalizar" cuando esté en la pantalla de "Selección de Disco".** Si sólo presiona en "Siguiente" sin personalizar el diseño del disco, el instalador sobreescribirá los contenidos del disco primario.

source: GRUB Boot Loader
es: Gestor de Arranque GRUB

source: PC-BSD® uses a customized version of the GRUB boot-loader to provide ZFS boot environment support, which is used as part of the system updating mechanism. PC-BSD® requires that its version of GRUB be installed as the primary boot-loader on the disk. **Using another boot-loader will break this critical functionality, and is strongly discouraged.**
es: PC-BSD® utiliza una versión personalizada del gestor de arranque GRUB para proporcionar soporte a los entornos de arranque ZFS, el cual se emplea como parte del proceso de actualización del sistema. PC-BSD® requiere que su versión de GRUB esté instalada en el disco como el cargador de arranque primario. **Empleando otro cargador de arranque romperá esta funcionalidad crítica, y es muy desaconsejado.**

source: The GRUB boot-loader is capable of dual-booting most other systems, including Windows and Linux. In order to dual-boot PC-BSD® with other operating systems, you can add entries to the :file:`/usr/local/etc/grub.d/40_custom.dist` file, which will be preserved across upgrades. For more information on the syntax used, refer to the `GRUB Manual <http://www.gnu.org/software/grub/manual/grub.html>`_.
es: El gestor de arranque GRUB es capaz de arrancar también otros sistemas operativos, incluyendo Windows y Linux. Para un arranque dual de PC-BSD® con otros sistemas operativos, puede añadir las entradas al archivo :file:`/usr/local/etc/grub.d/40_custom.dist`, que se conservará durante las actualizaciones. Para más información acerca de la sintaxis empleada, dirigirse al `Manual de GRUB <http://www.gnu.org/software/grub/manual/grub.html>`_.

source: PC-BSD® will attempt to identify other installed operating systems to add to the GRUB menu automatically. If you have an operating system which is not detected, please open a new bug report on `bugs.pcbsd.org <https://bugs.pcbsd.org/>`_ with the following information:
es: PC-BSD® tratará de identificar otros sistema operativos instalados para añadirlos al menú GRUB de forma automática. Si tiene un sistema operativo que no se ha detectado, por favor abra un nuevo informe de error en `bugs.pcbsd.org <https://bugs.pcbsd.org/>`_ con la siguiente información:

source: name of the operating system
es: Nombre del sistema operativo

source: output of the :command:`gpart show` and :command:`glabel list` commands
es: Salida de los comandos :command:`gpart show` y :command:`glabel list`

source: any entries you added to :file:`/usr/local/etc/grub.d/40_custom`
es: Cualquier entrada que se haya añadido a :file:`/usr/local/etc/grub.d/40_custom`

source: Creating an Automated Installation
es: Creando una Instalación Automatizada

source: PC-BSD® provides a set of Bourne shell scripts that allow advanced users to create automatic or customized PC-BSD® installations. :command:`pc-sysinstall` is the name of the master script; it reads a customizable configuration file and uses dozens of backend scripts to perform the installation. You can read more about this utility by typing **man pc-sysinstall**.
es: PC-BSD® proporciona una serie de scripts del shell Bourne que permiten a los usuarios avanzados crear instalaciones automáticas o personalizadas de PC-BSD®. :command:`pc-sysinstall` es el nombre del script maestro; lee un archivo de configuración personalizable y emplea docenas de scripts en el backend para realizar la instalación. Puede leer más acerca de esta utilería escribiendo **man pc-sysinstall**.

source: Here is a quick overview of the components used by :command:`pc-sysinstall`:
es: Aquí tiene un vistazo rápido de los componentes empleados por :command:`pc-sysinstall`:

source: :file:`/usr/local/share/pc-sysinstall/backend/` contains the scripts used by the PC-BSD® installer. Scripts have been divided by function, such as :file:`functions-bsdlabel.sh` and :file:`functions-installcomponents.sh`. If you have ever wondered how the PC-BSD® installer works, read through these scripts. This directory also contains the :file:`parseconfig.sh` and :file:`startautoinstall.sh` scripts which :command:`pc-sysinstall` uses to parse the configuration file and begin the installation.
es: :file:`/usr/local/share/pc-sysinstall/backend/` contiene los scripts que emplea el instalador de PC-BSD®. Los scripts se han dividido por funciones, tales como :file:`functions-bsdlabel.sh` y :file:`functions-installcomponents.sh`. Si se ha preguntado alguna vez como funciona el instalador de PC-BSD® lea estos scripts. Este directorio también contiene los scripts :file:`parseconfig.sh` y :file:`startautoinstall.sh` los cuales son usados por :command:`pc-sysinstall` para parsear el archivo de configuración y empezar con la instalación.

source: :file:`/usr/local/share/pc-sysinstall/backend-query/` contains the scripts which are used by the installer to detect and configure hardware.
es: :file:`/usr/local/share/pc-sysinstall/backend-query/` contiene los scripts utilizados por el instalador para detectar y configurar el hardware.
