Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/advanced.po
Languages: es

source: :file:`/usr/local/share/pc-sysinstall/conf/` contains the configuration file :file:`pc-sysinstall.conf`. It also contains a file indicating which localizations are available (:file:`avail-langs`), an :file:`exclude-from-upgrade` file, and a :file:`licenses/` subdirectory containing text files of applicable licenses.
es: :file:`/usr/local/share/pc-sysinstall/conf/` contiene el archivo de configuración :file:`pc-sysinstall.conf`. También contiene un archivo que indica qué traducciones están disponibles (:file:`avail-langs`), un archivo :file:`exclude-from-upgrade` y un subdirectorio :file:`licenses/` que contiene los archivos de texto de las licencias aplicables.

source: :file:`/usr/local/share/pc-sysinstall/doc/` contains the help text that is seen if you run :command:`pc-sysinstall` without any arguments.
es: :file:`/usr/local/share/pc-sysinstall/doc/` contiene el texto de ayuda que aparecerá si ejecuta :command:`pc-sysinstall` sin ningún argumento.

source: :file:`/usr/local/share/pc-sysinstall/examples/` contains several example configuration files for different scenarios (e.g. :file:`upgrade`, :file:`fbsd-netinstall`). The :file:`README` file in this directory should be considered as mandatory reading before using :command:`pc-sysinstall`.
es: :file:`/usr/local/share/pc-sysinstall/examples/` contiene varios ejemplos de archivos de configuración para diferentes escenarios (por ejemplo :file:`upgrade`, :file:`fbsd-netinstall`). El archivo :file:`README` que hay en este directorio debería considerarse como de lectura obligatoria antes de usar :command:`pc-sysinstall`.

source: :file:`/usr/sbin/pc-sysinstall` this is the script that is used to perform a customized installation.
es: :file:`/usr/sbin/pc-sysinstall` este es el script que se usa para realizar una instalación personalizada.

source: This section discusses the steps needed to create a custom installation.
es: En esta sección se discuten los pasos necesarios para crear una instalación personalizada.

source: First, determine which variables you wish to customize. A list of possible variables can be found in :file:`/usr/local/share/pc-sysinstall/examples/README` and are summarized in Table 5.5a. Note that the Table is meant as a quick reference to determine which variables are available. The :file:`README` file contains more complete descriptions for each variable.
es: Primero, determine que variables desea personalizar. Una lista de posibles variables se puede encontrar en :file:`/usr/local/share/pc-sysinstall/examples/README` y están resumidas en la Tabla 5.5a. Adviértase que la Tabla tiene por objeto ser un referencia rápida para determinar qué variables están disponibles. El archivo :file:`README` contiene una descripción más completa para cada variable.

source: **Table 5.5a: Available Variables for Customizing a PC-BSD® Installation**
es: **Tabla 5.5a: Variables Disponibles para la Personalización de una Instalación PC-BSD®**

source: Options
es: Opciones

source: Description
es: Descripción

source: should be unique for the network
es: Debe ser único para la red

source: optional as installer will auto\-generate a hostname if empty
es: Opcional ya que el instalador auto\-generará un nombre del equipo si está vacío

source: "fresh", "upgrade", "extract", or "zfsrestore"
es: "fresh", "upgrade", "extract", o "zfsrestore"

source: sets the installation type
es: Establece el tipo de instalación

source: /path/to/location
es: /dirección/a/la_localización

source: used only when *installMode* is extract and should point to an already mounted location
es: Empleado cuando *installMode* es extract y debería apuntar a una localización ya montada

source: "yes" or "no"
es: "yes" o "no"

source: set to "no" for automated installs without user input
es: Establecer como "no" para instalaciones automatizadas sin la intervención del usuario

source: "AUTO-DHCP" or FreeBSD interface name
es: "AUTO DHCP" o nombre de la interfaz de FreeBSD

source: type of network connection to use during the installation
es: Tipo de conexión de red que se usará durante la instalación

source: IP address of interface used during installation
es: Dirección IP de la interfaz empleada durante la instalación

source: only use if *netDev* is set to an interface name
es: Usar sólo si *netDev* está establecido a un nombre de interfaz

source: subnet mask of interface
es: Máscara de subred de la interfaz

source: IP address of DNS server
es: Dirección IP del servidor DNS

source: IP address of default gateway
es: Dirección IP de la puerta de enlace predeterminada

source: AUTO-DHCP or FreeBSD interface name(s) (multiple allowed separated by spaces)
es: DHCP automático o nombre(s) de interfaz(ces) de FreeBSD (se permiten varios, separados por comillas)

source: type of network configuration to enable on the installed system; can set multiple interfaces
es: Tipo de configuración de red para habilitar en el sistema instalado; puede configurar varias interfaces

source: IP address of interface or "DHCP"
es: Dirección IP de la interfaz o "DHCP"

source: only use if *netSaveDev* is set to an interface name or a list of interface names (repeat for each interface)
es: Sólo usar si *netSaveDev* está configurado con un nombre de interfaz o a una lista de nombres de interfaces (repetir para cada interfaz)

source: IP address of DNS server (multiple allowed separated by spaces)
es: Dirección IP del servidor DNS (se permiten varias, separadas por espacios)

source: only use if *netSaveDev* is set to an interface name or a list of interface names (do not repeat for each interface)
es: Usar sólo si *netSaveDev* está establecido a un nombre de interfaz o a una lista de nombres de interfaces (no repetir para cada interfaz)

source: FreeBSD disk device name, (e.g. *ad0*)
es: Nombre del dispositivo de disco FreeBSD, (por ejemplo *ad0*)

source: see *README* for examples
es: Ver *README* para ejemplos

source: "all", "free", "s1", "s2", "s3", "s4", or "image"
es: "all", "free", "s1", "s2", "s3", "s4", o "image"

source: "MBR" or "GPT"
es: "MBR" o "GPT"

source: partition scheme type
es: Tipo de esquema de partición

source: FreeBSD disk device name (e.g. *ad1*)
es: Nombre del dispositivo de disco FreeBSD (por ejemplo *ad1*)

source: sets the target disk for the mirror (i.e. the second disk)
es: Establece el disco de destino para el mirror (por ejemplo el segundo disco)

source: "load", "prefer", "round-robin", or "split"
es: "load", "prefer", "round-robin", o "split"

source: defaults to "round-robin" if the *mirrorbal* method is not specified
es: Predeterminados para "round-robin" si el método *mirrorbal* no está especificado

source: "none", "bsd", or "GRUB"
es: "none", "bsd", o "GRUB"

source: when using "GRUB", include its package in *installPackages=*
es: Cuando se usa "GRUB", incluye su paquete en *installPackages=*

source: /path/to/image /mountpoint
es: /dirección/a/la_imagen /punto_de_montaje

source: will write specified image file
es: Escribirá el archivo de imagen especificado

source: this variable is mandatory and must be placed at the end of each *diskX* section; create a *diskX* section for each disk you wish to configure.
es: Esta variable es obligatoria y se debe colocar al final de cada sección *diskX*; cree una sección *diskX* para cada disco que desee configurar.

source: password value
es: Valor de la contraseña

source: at boot time, system will prompt for this password in order to mount the associated GELI encrypted partition
es: Durante el inicio, el sistema le solicitará su contraseña para montar la partición asociada encriptada con GELI

source: this variable is mandatory and must be placed at the end of disk's partitioning settings; see the *README* for examples on how to set the <File System Type> <Size> <Mountpoint> entries for each disk
es: Esta variable es obligatoria y se debe colocar al final de la configuración del particionado del disco; vea *README* para ejemplos de cómo establecer las entradas <File System Type> <Size> <Mountpoint> para cada disco

source: "dvd", "usb", "ftp", "rsync", or "image"
es: "dvd", "usb", "ftp", "rsync", o "image"

source: source to be used for installation
es: Medio que se usará para la instalación

source: /path/to/files
es: /dirección/a/los_archivos

source: location of directory containing installation files
es: Localización del directorio que contiene los archivos de instalación

source: "PCBSD" or "FreeBSD"
es: "PCBSD" o "FreeBSD"

source: determines whether this is a desktop or a server install
es: Determina si esto es una instalación de un escritorio o de un servidor

source: e.g. "fbsd-release.tbz"
es: Por ejemplo "fbsd-release.tbz"

source: only set if using a customized installer archive
es: Sólo configurar si se usa un archivo de instalación personalizado

source: "tar", "uzip", "split", or "dist"
es: "tar", "uzip", "split", o "dist"

source: the archive type on the installation media
es: El tipo de archivo en el medio de instalación

source: e.g. "base src kernel"
es: Por ejemplo "base src kernel"

source: list of FreeBSD distribution files to install when using *packageType=dist*
es: Lista de los archivos de la distribución FreeBSD que se instalarán cuando se usa *packageType=dist*

source: ftp://ftp_path
es: ftp://dirección_ftp

source: location of the installer archive when using *installMedium=ftp*
es: Localización del archivo del instalador cuando se usa *installMedium=ftp*

source: e.g. "life-preserver/back-2011-09-12T14_53_14"
es: Por ejemplo "life-preserver/back-2011-09-12T14_53_14"

source: location of the rsync data on the remote server when using *installMedium=rsync*
es: Ubicación de los datos de rsync en el servidor remoto cuando se usa *installMedium=rsync*

source: username
es: Nombre del usuario

source: set when using *installMedium=rsync*
es: Configurar cuando se use *installMedium=rsync*

source: IP address of rsync server
es: Dirección IP del servidor rsync

source: port number
es: Número del puerto

source: e.g. "amarok,firefox,ports"
es: Por ejemplo "amarok,firefox,ports"

source: components must exist in */PCBSD/pc-sysinstall/components/*; typically, *installPackages=* is used instead
es: Los componentes deben existir en */PCBSD/pc-sysinstall/components/*; típicamente se usa *installPackages=* en su lugar

source: e.g. "Xorg cabextract
es: Por ejemplo "Xorg cabextract"

source: list of traditional or pkg packages to install; requires *pkgExt=*
es: Lista de paquetes tradicionales o de pkg para instalar; requiere *pkgExt=*

source: ".txz" or ".tbz"
es: ".txz" o ".tbz"

source: specify the extension used by the type of package to be installed
es: Especifique la extension usada por el tipo de paquete que se instalará

source: specify if you wish to keep your existing user's desktop profile data during an upgrade
es: Especifique si desea mantener los datos del perfil de escritorio existente durante una actualización

source: password
es: Contraseña

source: set the root password of the installed system to the specified string
es: Establecer la contraseña del administrador del sistema instalado a la cadena especificada

source: encrypted string
es: Cadena encriptada

source: set root password to specified encrypted string
es: Establecer la contraseña del administrador a la cadena encriptada especificada

source: case sensitive value
es: Valor sensible a mayúsculas

source: create a separate block of user values for each user you wish to create
es: Crear un bloque separado de valores de usuario para cada usuario que desee crear

source: description
es: Descripción

source: description text can include spaces
es: El Texto de descripción puede incluir espacios

source: password of user
es: Contraseña del usuario

source: set user password to specified encrypted string
es: Establecer la contraseña del usuario a la cadena encriptada especificada

source: e.g. "/bin/csh"
es: Por ejemplo "/bin/csh"

source: path to default shell
es: Ruta al shell predeterminado

source: e.g. "/home/username"
es: Por ejemplo "/home/nombre_del_usuario"

source: path to home directory
es: Dirección al directorio personal

source: e.g. "wheel"
es: Por ejemplo "wheel"

source: default group
es: Grupo predeterminado

source: e.g. "wheel,operator"
es: Por ejemplo "wheel, operator"

source: comma separated (no spaces) list of additional groups
es: Lista de grupos adicionales separados por coma (sin espacios)

source: mandatory, must be last line in each user block
es: Obligatorio, debe ser la última línea en cada bloque de usuario

source: full path to command
es: Ruta completa al comando

source: run the specified command within chroot of the installed system, after the installation is complete
es: Corra el comando especificado con chroot del sistema instalado, luego de que la instalación se haya completado

source: full path to script
es: Ruta completa al script

source: runs specified script within chroot of the installed system, after the installation is complete
es: Corre el script especificado con chroot en el sistema instalado, luego de que la instalación se haya completado

source: runs a command outside the chroot
es: Ejecuta un comando fuera de chroot

source: e.g. "America/New_York"
es: Por ejemplo"America/Nueva_York"

source: location must exist in :file:`/usr/share/zoneinfo/`
es: La ubicación debe existir en :file:`/usr/share/zoneinfo/`

source: enable/disable NTP
es: Activar/desactivar NTP

source: e.g. "en"
es: Por ejemplo "en"

source: sets the system console and Desktop to the target language
es: Establece la consola del sistema y el Escritorio al idioma seleccionado

source: updates the system's Xorg config to set the keyboard layout
es: Actualiza la configuración de Xorg del sistema para establecer la distribución de teclado

source: e.g. "pc104"
es: Por ejemplo "pc104"

source: updates the system's Xorg config to set the keyboard model
es: Actualiza la configuración de Xorg del sistema para establecer el modelo del teclado

source: e.g. "intl"
es: Por ejemplo "intl"

source: updates the Xorg config to set the keyboard variant
es: Actualiza la configuración de Xorg para establecer la variante de teclado

source: user will be logged in automatically without entering a password
es: El usuario sera automáticamente autenticado sin ingresar una contraseña

source: hostname or IP address
es: Nombre del equipo o dirección IP

source: the address of the remote server when using *installMode=zfsrestore*
es: La dirección del servidor remoto cuando se usa *installMode=zfsrestore*

source: e.g "22"
es: Por ejemplo "22"

source: the SSH port number of the remote server when using *installMode=zfsrestore*
es: El numero de puerto SSH del servidor remoto cuando se usa *installMode=zfsrestore*

source: the username on the remote server when using *installMode=zfsrestore*
es: El nombre de usuario en el servidor remoto cuando se usa *installMode=zfsrestore*

source: e.g. "/root/id_rsa"
es: Por ejemplo "/root/id_rsa"

source: path to the SSH key file on the remote server when using *installMode=zfsrestore*
es: Ruta al archivo de clave SSH en el servidor remoto cuando se usa *installMode=zfsrestore*

source: e.g. ".lp-props-tank#backups#mybackup"
es: Por ejemplo ".lp-props-tank#backups#mybackup"

source: location of dataset properties file created by Life Preserver during replication when using *installMode=zfsrestore*
es: La ubicación del archivo de propiedades del dataset creado por Life Preserver durante la replicación cuando se usa *installMode=zfsrestore*

source: e.g. "tank/backups/mybackup"
es: Por ejemplo "tank/backups/mibackup"

source: location of remote dataset to restore from when using *installMode=zfsrestore*
es: Ubicación del dataset remoto desde el que restaurar cuando se usa *installMode=zfsrestore*

source: Next, create a customized configuration. One way to create a customized configuration file is to read through the configuration examples in :file:`/usr/local/share/pc-sysinstall/examples/` to find the one that most closely matches your needs. Copy that file to any location and customize it so that it includes the variables and values you would like to use in your installation.
es: Enseguida, cree una configuración personalizada. Una manera de crear un archivo de configuración personalizada es leer los ejemplos de configuración en :file:`/usr/local/share/pc-sysinstall/examples/` para encontrar el que mejor se ajuste a sus necesidades. Copie ese archivo a cualquier ubicación y modifíquelo de manera que incluya las variables y valores que le gustaría emplear en su instalación.

source: An alternate way to create this file is to start an installation, configure the system as desired, and save the configuration to a USB stick (with or without actually performing the installation). You can use that saved configuration file as-is or customize it to meet an installation's needs. This method may prove easier when performing complex disk layouts.
es: Una manera alternativa de crear este archivo es iniciar la instalación, configurar el sistema según se desee, y guardar la configuración a un dispositivo USB (sin llegar a realizar la instalación). Puede utilizar el archivo de configuración tal cual está o personalizarlo para cumplir con las necesidades de una instalación en particular. Este método puede resultar mas sencillo cuando se realizan configuraciónes complejas de disco.

source: If you wish to perform a fully-automated installation that does not prompt for any user input, you will also need to review :file:`/usr/local/share/pc-sysinstall/examples/pc-autoinstall.conf` and place a customized copy of that file into :file:`/boot/pc-autoinstall.conf` on your installation media.
es: Si desea realizar una instalación completamente automatizada que no le pida ningún tipo de información, necesitará también revisar :file:`/usr/local/share/pc-sysinstall/examples/pc-autoinstall.conf` y colocar una copia personalizada de ese archivo en :file:`/boot/pc-autoinstall.conf` en su medio de instalación.

source: Table 5.5b summarizes the additional variables that are available for fully automatic installations. More detailed descriptions can be found in the :file:`/usr/local/share/pc-sysinstall/examples/pc-autoinstall.conf` file. Note that the variables in this file use a different syntax than those in Table 5.6a in that the values follow a colon and a space rather than the equals sign.
es: La Tabla 5.5b resume las variables adicionales que están disponibles para instalaciones completamente automatizadas. Descripciones mas detalladas pueden encontrarse en el archivo :file:`/usr/local/share/pc-sysinstall/examples/pc-autoinstall.conf`. Note que las variables en este archivo utilizan una sintaxis distinta que las que se encuentran en la Tabla 5.6a en que los valores siguen a una coma y un espacio en lugar de a un signo de igual.

source: **Table 5.5b: Additional Variables for Automated Installations**
es: **Tabla 5.5b: Variables Adicionales para Instalaciones Automatizadas**

source: URL or /path/to/file
es: URL o /ruta/al/archivo

source: location of customized :file:`pc-sysinstall.conf`
es: Ubicación de :file:`pc-sysinstall.conf` personalizado

source: should be set to "yes", otherwise booting the wrong disk will result in a system wipe
es: Deberia estar establecido en "yes", de otro modo arrancar desde el disco incorrecto resultara en un borrado del sistema

source: e.g. :command:`shutdown -p now`
es: Por ejemplo :command:`shutdown -p now`

source: good idea to run a shutdown, but this can be any command/script you wish to execute post-install
es: Buena idea para apagar, pero esto puede ser cualquier comando/script que desee ejecutar tras la instalación

source: "dhcp-all" or <interface name> <IP address> <subnet mask>
es: "dhcp-all" o <interface name> <IP address> <subnet mask>

source: will attempt DHCP on all found NICs until the installation file can be fetched or will setup specified interface
es: Intentará el DHCP en todas las NICs encontradas hasta que el archivo de instalación pueda ser obtenido o configurará la interfaz especificada

source: IP address
es: Dirección IP

source: DNS server to use
es: Servidor DNS a utilizar

source: default gateway to use
es: Puerta de enlace predeterminada a utilizar

source: Finally, create a custom installation media or installation server. :command:`pc-sysinstall` supports the following installation methods:
es: Finalmente, cree un medio de instalación personalizado o un servidor de instalación. :command:`pc-sysinstall` soporta los siguientes métodos de instalación:

source: from a CD, DVD, or USB media
es: Desde un CD, DVD, o dispositivo USB

source: from an installation directory on an HTTP, FTP, SSH+rsync, or a :ref:`PXE Boot Install Server`
es: Desde un directorio de instalación a un HTTP, FTP, SSH+rsync o a un :ref:`Servidor de Instalación PXE Boot`

source: The easiest way to create a custom installation media is to modify an existing installation image. For example, if you have downloaded an ISO for the PC-BSD® version that you wish to customize, the superuser can access the contents of the ISO as follows::
es: La manera más fácil de crear un medio de instalación personalizado es modificar una imagen de instalación existente. Por ejemplo si ha descargado una ISO para la versión de PC-BSD® que desea personalizar, el administrador puede acceder a los contenidos de la ISO de la siguiente manera::

source: Make sure to :command:`cd` into a directory where you would like to copy the contents of the ISO. In the following examples, :file:`/tmp/custominstall/` was created for this purpose::
es: Asegúrese de hacer :command:`cd` dentro del directorio donde le gustaría copiar los contenidos de la ISO. En los siguientes ejemplos, :file:`/tmp/custominstall/` fue creado para este propósito::

source: Alternately, if you have inserted an installation CD or DVD, you can mount the media and copy its contents to your desired directory::
es: Alternativamente, si inserto un CD o DVD de instalación, puede montar el medio y copiar sus contenidos al directorio que prefiera::

source: If you are creating an automated installation, copy your customized :file:`pc-autoinstall.conf` to :file:`/tmp/custominstall/boot/`.
es: Si está creando una instalación automatizada, copie su :file:`pc-autoinstall.conf` personalizado a :file:`/tmp/custominstall/boot/`.

source: Copy your customized configuration file to :file:`/tmp/custominstall/`. Double-check that the "installMedium=" variable in your customized configuration file is set to the type of media that you will be installing from.
es: Copie su archivo de configuración personalizado a :file:`/tmp/custominstall/`. Asegurese de que la variable "installMedium=" en su archivo de configuración personalizado refleje el tipo de medio desde el cual vaya a realizarse la instalación.

source: You may also need to add some extra files if you set the following variables in your custom configuration file:
es: También puede necesitar añadir algunos archivos extra si establece las siguientes variables en su archivo de configuración personalizada:

source: **installComponents=** make sure that any extra components you wish to install exist in :file:`extras/PBI/` (if they end in the :file:`.pbi` extension) or :file:`extras/components/` (if they end in :file:`.tbz`)
es: **installComponents=** asegúrese de que cualquier componente extra que desee instalar existe en :file:`extras/PBI/` (si terminan con la extensión :file:`.pbi` ) o :file:`extras/components/` (si terminan en :file:`.tbz`)

source: **runCommand=** make sure the command exists in the specified path
es: **runCommand=** asegúrese de que existe el comando en la ruta especificada

source: **runScript=** make sure the script exists in the specified path
es: **runScript=** asegúrese de que el script existe en la ruta especificada
