Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/advanced.po
Languages: es

source: Advanced Installation Topics
es: Temas Avanzados de Instalación

source: The previous section discussed a default installation of PC-BSD®. This section covers the following advanced installation topics:
es: En la sección anterior se trató la instalación predeterminada de PC-BSD®. Esta sección cubre los siguientes temas avanzados de instalación:

source: :ref:`Using the Text Installer`
es: :ref:`Usando el Instalador en Modo Texto`

source: :ref:`Install a Server`
es: :ref:`Instalando un Servidor`

source: :ref:`Using the TrueOS® CD`
es: :ref:`Usando el CD de TrueOS®`

source: :ref:`Dual Booting`
es: :ref:`Arranque Dual`

source: :ref:`Creating an Automated Installation`
es: :ref:`Creando una Instalación Automatizada`

source: Using the Text Installer
es: Usando el Instalador en Modo Texto

source: If you prefer to perform an installation using an ncurses menu rather than a full graphical installer, select the option "Text Install/Emergency Console" from the PC-BSD® installer boot menu shown in Figure 3a. Once the installer finishes loading, you will see the screen shown in :numref:`Figure %s: Text Installation Menu <text1>`.
es: Si prefiere realizar una instalación usando un menú ncurses en vez del instalador completamente gráfico, seleccione la opción "Text Install/Emergency Console" del menú de arranque del instalador de PC-BSD®. Una vez que el instalador termine de cargar, verá la pantalla mostrada en la :numref:`Figura %s: Menú de la Instalación en Modo Texto <text1>`.

source: This initial menu provides the following options:
es: Este menú inicial proporciona las siguientes opciones:

source: **install:** continues the installation using the text-based installer.
es: **install:** continúa la instalación empleando el instalador en modo texto.

source: **xorg:** launches the graphical installer described in :ref:`Installing PC-BSD®`.
es: **xorg:** lanza el instalador gráfico descrito en :ref:`Instalando PC-BSD®`.

source: **vesa:** launches the graphical installer in VESA mode.
es: **vesa:** lanza el instalador gráfico en modo VESA.

source: **utility:** launches the menu described in :ref:`Using the System Utilities Menu`.
es: **utility:** lanza el menú descrito en :ref:`Usando el Menú de Utilerías del Sistema`.

source: **reboot:** exits the installer and reboots the system.
es: **reboot:** sale del instalador y reinicia el sistema.

source: Use the up/down arrows to highlight a menu item then press the :kbd:`spacebar` to select the highlighted item. When finished, press :kbd:`Enter` to save the selection and move on to the next screen.
es: Use las flechas arriba/abajo para marcar un elemento del menú y entonces presionar la :kbd:`barra espaciadora` para seleccionar el elemento marcado. Cuando haya terminado, presione :kbd:`Intro` para guardar la selección y avanzar a la siguiente pantalla.

source: If you keep the default selection of "install", the next screen will prompt to install a desktop or a server, as seen in :numref:`Figure %s: Select Desktop or Server <text2>`.
es: Si mantiene la selección predeterminada de "install", la siguiente pantalla le preguntará si instalará un escritorio o un servidor, como se muestra en la :numref:`Figura %s: Seleccionando Escritorio o Servidor <text2>`.

source: If you choose to install a desktop, the KDE and Fluxbox window managers will be installed and configured for you. After the installation is complete, the system will boot into the usual post-installation configuration screens.
es: Si elige instalar un escritorio, se instalarán y configurarán para usted los administradores de ventanas KDE y Fluxbox. Una vez que se ha completado la instalación, el sistema arrancará con las pantallas de configuración post-instalación habituales.

source: If you choose to install a server, neither X nor a window manager will be installed, resulting in a command-line only TrueOS® installation. Once the server installation is complete, the system will boot into a command prompt where you can enter the username and password that was created during the installation.
es: Si elige instalar un servidor, no se instalarán ni las X ni el administrador de ventanas, obteniendo una instalación de TrueOS® sólo con línea de comandos. Una vez se ha completado la instalación del servidor, el sistema arrancará en un indicador de comando donde puede escribir el nombre de usuario y la contraseña que se creó durante la instalación.

source: After making a selection and pressing enter, the next screen will display the available disks on the system. In the example shown in :numref:`Figure %s: Select Installation Disk <text3>`, one disk is available.
es: Después de hacer su selección y presionar Intro, la siguiente pantalla mostrará los discos disponibles en el sistema. En el ejemplo mostrado en la :numref:`Figura %s: Seleccionando el Disco de Instalación <text3>`, un disco está disponible.

source: Select the disk to install into and press :kbd:`Enter`. In the next screen, the installer will display all available primary or GPT partitions. In the example shown in :numref:`Figure %s: Select Partition <text4>`, there is only one partition and the installer has selected the default of installing to the entire disk. **If you have multiple partitions and disks, carefully select the disk and partition to install to.**
es: Seleccione el disco en donde realizará la instalación y presione :kbd:`Intro`. En la siguiente pantalla, el instalador mostrará todas las particiones primarias o GPT disponibles. En el ejemplo mostrado en la :numref:`Figura %s: Seleccionando la Partición <text4>`, solo hay una partición y el instalador ha seleccionado la opción predeterminada de instalar en el disco completo. **Si tiene múltiples particiones y discos, seleccione cuidadosamente el disco y la partición en donde vaya a realizar la instalación.**

source: The next screen, shown in :numref:`Figure %s: Select Disk Format <text5>`, is used to select the type of disk format. If the installation disk or partition is larger than 2 TB, *GPT* **must** be selected. Otherwise, selecting *GPT* should work for most modern hardware. When installing on older hardware, or if the newly installed system will not boot after selecting *GPT*, select *MBR* instead.
es: La siguiente pantalla, mostrada en la :numref:`Figura %s: Seleccionando el Formato del Disco <text5>`, es usada para seleccionar el tipo del formato del disco. Si el disco de instalación o partición es mayor que 2 TB, **debe** seleccionar *GPT*. De otra manera, seleccionar *GPT* debería funcionar para la mayor parte del hardware moderno. Cuando instale en hardware antiguo, o si el sistema instalado recientemente no arranca después de seleccionar *GPT*, seleccione entonces *MBR*.

source: The next screen, shown in :numref:`Figure %s: Select Boot Manager <text6>`, is used to select whether or not to use the GRUB boot manager.
es: La siguiente pantalla, mostrada en la :numref:`Figura %s: Seleccionando el Gesor de Arranque <text6>`, es usada para seleccionar si usa o no el gestor de arranque GRUB.

source: The default is to use *GRUB* as it is required to support boot environments. If you select *none*, no boot manager will be installed and boot environments will not be available.
es: Lo usual es usar *GRUB* ya que es necesario para soportar entornos de arranque. Si selecciona *ninguno*, ningún gestor de arranque se instalará y los entornos de arranque no estarán disponibles.

source: The next screen is shown in :numref:`Figure %s: Full Disk Encryption <text7>`.
es: La siguiente pantalla se muestra en la :numref:`Figura %s: Encriptación Completa del Disco <text7>`.

source: This screen provides the option to encrypt the selected disk(s) with the FreeBSD `GELI <https://www.freebsd.org/cgi/man.cgi?query=geli/qgit/>`_ framework. If you keep the default of *Yes* and press enter, you will be prompted to enter and confirm a passphrase. You will be prompted to enter this passphrase whenever you boot into PC-BSD®. This means that if someone else boots your computer, they will not be able to boot into PC-BSD® if they do not know your passphrase. **However, if you forget your passphrase, you will not be able to access PC-BSD® either.** For these reasons, it is important to choose a good passphrase that other users will not guess and which you will not forget. Passphrases are case-sensitive and can contain spaces. The passphrase should be memorable to you, such as a line from a song or piece of literature, but hard to guess in that people who know you should not be able to guess your favorite line from a song or piece of literature.
es: Esta pantalla proporciona la opción de encriptar el(los) disco(s) seleccionados con el diseño `GELI <https://www.freebsd.org/cgi/man.cgi?query=geli/qgit/>`_ de FreeBSD. Si mantiene la opción *Sí* predeterminada y presiona Intro, se le pedirá introducir y confirmar una contraseña. Se le pedirá teclear esta contraseña cada vez que inicie PC-BSD®. Esto significa que si cualquier otra persona arranca el sistema, no será capaz de iniciar PC-BSD® si no conoce la contraseña. **Sin embargo, si olvida la contraseña, tampoco podrá usted acceder a PC-BSD®.** Por estas razones, es importante elegir una buena contraseña que otros usuarios no puedan adivinar y que usted no pueda olvidar. Las contraseñas son sensibles a mayúsculas y pueden contener espacios. La contraseña debe ser fácil de recordar para usted, como una frase de una canción o una cita literaria, pero difícil de adivinar para aquellas personas que aún conociéndole no puedan adivinar esa frase de su canción o pieza literaria favorita.

source: be careful if you have changed your keyboard variant and layout. At this time, the GELI encryption framework only supports QWERTY passphrases, so do not use any characters not found on a QWERTY keyboard in your passphrase. **DO NOT** set a passphrase with accents or special characters which are not found on a US keyboard. This is a limitation in FreeBSD as the keymap is not loaded until after the passphrase is entered, meaning that such a passphrase will render that partition as inaccessible.
es: Tenga cuidado si usted ha cambiado la variante o el diseño del teclado. En este momento, el diseño de encriptación GELI sólo soporta contraseñas QWERTY, así que no se deben usar caracteres que no aparecen en teclados QWERTY en su contraseña. **NO** asigne una contraseña con acentos o caracteres especiales que no se encuentren en teclados norteamericanos (USA). Esta es una limitante en FreeBSD ya que el mapa del teclado no se carga hasta que la contraseña se haya introducido, lo que significa que tal contraseña hará inaccesible la partición.

source: If you choose to install a server in the screen shown in :numref:`Figure %s: Select Desktop or Server <text2>`, the installer will next prompt for the following information:
es: Si elige instalar un servidor en la pantalla mostrada en la :numref:`Figura %s: Seleccionando Escritorio o Servidor <text2>`, el instalador le pedirá entonces la siguiente información:

source: the *root* password
es: La contraseña del *administrador*

source: confirm the *root* password (enter the same value)
es: Confirmar la contraseña del *administrador* (introduzca la misma)

source: the username to use when logging into the server (as *root* logins are discouraged)
es: El nombre de usuario para iniciar la sesión en el servidor (se desaconseja el inicio de sesiones como *administrador*)

source: the password to use when logging into the server
es: La contraseña que se usará cuando se inicie la sesión en el servidor

source: confirm the password to use when logging into the server
es: Confirmar la contraseña que se empleará cuando se conecte al servidor

source: the real name for the user who logs into the server (can contain spaces)
es: El nombre real del usuario que se conecta al servidor (puede contener espacios)

source: the default shell for the user's login
es: El intérprete de comandos predeterminado para la sesión del usuario

source: the hostname for the server
es: El nombre de equipo para el servidor

source: whether or not you wish to enable networking. If you press "Yes", you can either select "auto" to enable DHCP on all interfaces or select an interface to statically configure. If you select an interface, you will be prompted to enter the IP address, subnet mask, IP address of the DNS server, and the IP address of the default gateway.
es: Si quiere o no quiere habilitar las conexiones de red. Si presiona "Sí", se puede seleccionar "auto" para habilitar DHCP en todas las interfaces o seleccionar una interfaz para configurarla estáticamente. Si selecciona una interfaz, se le solicitará introducir la dirección IP, máscara de subred, la dirección IP del servidor DNS, y la dirección IP de la puerta de enlace por defecto.

source: whether or not you want to enable SSH access to the server.
es: Si se desea o no habilitar el acceso SSH al servidor

source: For both a desktop and a server install, the next screen is shown in :numref:`Figure %s: Configure Remote Access to AppCafe <text8>`.
es: Para ambas, una instalación de escritorio o servidor, la siguiente pantalla se muestra en la :numref:`Figura %s: Configurara el Acceso Remoto a AppCafe <text8>`.

source: If you would like to manage installed software or jails from your phone or a remote system, press enter to select the default option of *Yes*. If you only plan to use :ref:`AppCafe®` from the system you are installing, arrow over to *No* instead.
es: Si desea administrar el software instalado o jaulas desde un teléfono o desde un sistema remoto, presione Intro para seleccionar la opción por defecto de *Sí*. Si sólo planea usar :ref:`AppCafe®` desde el sistema que se está instalando, seleccione *No* en su lugar.

source: The next screen, shown in :numref:`Figure %s: Review Installation Options <text9>`, provides the following options:
es: La siguiente pantalla, mostrada en la :numref:`Figura %s: Revisando las Opciones de la Instalación <text9>`, proporciona las siguientes opciones:

source: **install:** to start the installation, select this option and press enter.
es: **install:** para comenzar la instalación seleccione esta opción y presione Intro.

source: **wizard:** select this option to re-run the text installer and re-input your selections.
es: **wizard:** seleccione esta opción para volver a iniciar el instalador en modo texto y volver a introducir las selecciones.

source: **edit:** used to review, and possibly change any of the installation parameters.
es: **edit:** usado para revisar, y posiblemente cambiar cualquiera de los parámetros de instalación.

source: **hardware:** selecting this option will display a summary of the system's hardware. The example shown in :numref:`Figure %s: Hardware Summary <text10>` is from a system with a disabled sound card and no wireless card.
es: **hardware:** al seleccionar esta se mostrará un resumen del hardware del sistema. El ejemplo mostrado en la :numref:`Figura %s: Resumen del Hardware <text10>` es para un sistema con una tarjeta de sonido deshabilitada y sin tarjeta de red inalámbrica.

source: **quit:** select this option to return to the screen shown in :numref:`Figure %s: Text Installation Menu <text1>`.
es: **quit:** seleccione esta opción para regresar a la pantalla mostrada en la :numref:`Figura %s: Menú de la Instalación en Modo Texto <text1>`.

source: If you select "edit", the menu shown in :numref:`Figure %s: Edit Menu <text11>` will open.
es: Si seleccionó "edit", el menú mostrado en la :numref:`Figura %s: Menú de Edición <text11>` se abrirá.

source: This screen contains the following options:
es: Esta pantalla contiene las siguientes opciones:

source: **disk:** used to change the disk to install into. Selecting this option will re-open the screens shown in :numref:`Figure %s: Select Installation Disk <text3>` through :numref:`Figure %s: Full Disk Encryption <text7>`, and then return you back to this menu.
es: **disk:** usada para cambiar el disco de instalación. Seleccionando esta opción se reabrirán las pantallas mostradas en la :numref:`Figura %s: Seleccionando el Disco de Instalación <text3>` hasta la :numref:`Figura %s: Encripción Completa del Disco <text7>`, y después regresará a este menú.

source: **zpool:** select this option if the system contains multiple disks and you wish to change the disk layout to a mirror or RAIDZ. The allowable layouts for the number of available disks will be displayed so that you can select the desired layout.
es: **zpool:** seleccione esta opción si el sistema contiene múltiples discos y desea cambiar el diseño del disco a un mirror o RAIDZ. Los diseños permitidos para el número de discos disponibles se mostrarán de manera que se pueda seleccionar el diseño deseado.

source: **zfs:** used to modify the default ZFS layout. Selecting this option will open the screen shown in :numref:`Figure %s: ZFS Layout <text12>`. To edit the properties of an existing dataset, highlight the dataset's name and press enter. This will show the list of available ZFS properties for that dataset, as seen in the example shown in :numref:`Figure %s: ZFS Properties for a Dataset <text13>`. To change the value of a ZFS property, highlight it and press enter. The available values will vary, depending upon the selected property. If you wish to add additional datasets, select *add*. This will prompt for the full path of the mountpoint to create. For example, you could create a dataset named :file:`/usr/shares`. The dataset you create will be added to the bottom of the list. If you select the dataset and press enter, you can set its ZFS properties. Once you are finished customizing the ZFS layout, select *done*.
es: **zfs:** usada para modificar el diseño predeterminado de ZFS. Al seleccionar esta opción, se abrirá la pantalla mostrada en la :numref:`Figura %s: Diseño ZFS <text12>`. Para editar las propiedades de un dataset existente, seleccione el nombre del dataset y presione Intro. Esto mostrará la lista de propiedades de ZFS disponibles para ese dataset, como se muestra en el ejemplo mostrado en la :numref:`Figura %s: Propiedades ZFS para un Dataset <text13>`. Para cambiar el valor de una propiedad ZFS, selecciónela y presione Intro. Los valores disponibles variarán, dependiendo de la propiedad seleccionada. Si quiere añadir datasets adicionales, seleccione *añadir*. Esto le preguntará por la ruta completa del punto de montaje a crear. Por ejemplo, puede crear un dataset llamado :file:`/usr/shares`. El dataset que creó se añadirá al final de la lista. Si selecciona el dataset y presiona Intro, puede establecer sus propiedades ZFS. Una vez que ha terminado de personalizar el diseño ZFS, seleccione *terminado*.

source: while you can delete a dataset, the default datasets are needed for boot environments. For this reason, **it is not recommended to delete any default datasets.** ZFS options are described in `zfs(8) <http://www.freebsd.org/cgi/man.cgi?query=zfs>`_ and you should not change any options unless you are familiar with the ramifications of doing so.
es: Mientras que usted puede eliminar un dataset, los datasets predeterminados son necesarios para los entornos de arranque, **no se recomienda eliminar ningún conjunto de datos preestablecido.** Las opciones de ZFS se describen en `zfs(8) <http://www.freebsd.org/cgi/man.cgi?query=zfs>`_ y no debería cambiar ninguna opción a menos que esté familiarizado con las consecuencias de hacerlo.

source: **network:** used to configure networking. Selecting this option will prompt to enter a hostname, to select either automatic DHCP configuration on all interfaces or to specify the interface to configure, and whether or not to enable SSH.
es: **network:** empleado para configurar la conexión de red. Tras seleccionar esta opción se requerirá introducir un nombre de equipo, seleccionar también una configuración automática de DHCP en todas las interafaces o bien especificar la interfaz que se va a configurar, y si se habilitará o no SSH.

source: **packages:** used to install additional packages. The following package roles are available: "Devel", "FreeNAS", "Office", and "Server".
es: **packages:** usado para instalar paquetes adicionales. Están disponibles los siguientes tipos de roles de paquetes: "Desarrollo", "FreeNAS", "Oficina", y "Servidor".

source: **view:** if you select this option, a read-only copy of the ASCII text file containing the configuration script will be displayed.
es: **view:** si selecciona esta opción, una copia de sólo lectura del archivo de texto ASCII conteniendo el script de configuración se mostrará.

source: **edit:** if you select this option, the configuration script will open in the :command:`ee` editor, allowing you to make changes. The parameters supported by the installation script are described in .
es: **edit:** si se selecciona esta opción, el script de configuración se abrirá en el editor :command:`ee`, permitiéndole hacer cambios.

source: **back:** select this option to return you to the menu shown in :numref:`Figure %s: Review Installation Options <text9>`.
es: **back:** seleccione esta opción para regresar al menú mostrado en la :numref:`Figura %s: Revisando las Opciones de Instalación <text9>`.

source: Using the System Utilities Menu
es: Usando el Menú de Utilerías del Sistema

source: The text installer contains some handy tools for troubleshooting and fixing an existing PC-BSD® or TrueOS® installation.
es: El instalador en modo texto contiene algunas herramientas útiles para encontrar errores y reparar una instalación existente de PC-BSD® o TrueOS®.

source: If you click the *utility* option in the main menu of the text based installer shown in :numref:`Figure %s: Text Installation Menu <text1>`, it will open the screen shown in :numref:`Figure %s: System Utilities Menu <util1>`.
es: Si presiona en la opción *utility* en el menú principal del instalador basado en texto mostrado en la :numref:`Figura %s: Menú de la Instalación en Modo Texto <text1>`, se abrirá la pantalla mostrada en la :numref:`Figura %s: Menú de Utilerías del Sistema <util1>`.

source: This screen provides the following options:
es: Esta pantalla proporciona las siguientes opciones:

source: **shell:** this option is useful if you are troubleshooting a PC-BSD® system that no longer boots. It will open a shell with administrative access that includes the base FreeBSD utilities. Advanced users can use this shell to try to determine what the problem is, to create a backup or copy essential files to another system, or edit configuration files with an editor such as `ee <https://www.freebsd.org/cgi/man.cgi?query=ee>`_ or :command:`vi`. When you are finished using the shell, type :command:`exit` to return to the screen shown in :numref:`Figure %s: System Utilities Menu <util1>`.
es: **shell:** esta opción es útil si está arreglando un sistema PC-BSD® que ya no arranca. Abrirá una consola con acceso administrativo que incluye las utilerías base de FreeBSD. Los usuarios avanzados pueden usar esta consola para intentar determinar cuál es el problem, para crear un respaldo o copiar archivos esenciales a otro sistema, o editar archivos de configuración con un editor como `ee <https://www.freebsd.org/cgi/man.cgi?query=ee>`_ o :command:`vi`. Cuando termine de usar la consola, ingrese :command:`exit` para regresar a la pantalla mostrada en la :numref:`Figura %s: Menú de Utilerías del Sistema <util1>`.
