Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/advanced.po
Languages: es

source: **runExtCommand=** make sure the command exists in the specified path
es: **runExtCommand=** asegúrese de que el comando existe en la ruta especificada

source: If the installation media is a CD or DVD, you will need to create a bootable media that contains the files in your directory. To create a bootable ISO::
es: Si el medio de instalación es un CD o un DVD, necesitará crear un medio arrancable que contenga los archivos en su directorio. Para crear una ISO arrancable::

source: You can then use your favorite burning utility to burn the ISO to the media.
es: Puede usar sus utilerías de grabación favoritas para grabar una ISO al medio.

source: To begin an installation that requires user interaction::
es: Para comenzar una instalación que requiere la interacción del usuario::

source: To begin a fully automated installation, insert the installation media and reboot.
es: Para comenzar una instalación completamente automatizada, inserte el dispositivo de instalación y reinicie.

source: If you are using an HTTP, FTP, or SSH server as the installation media, untar or copy the required files to a directory on the server that is accessible to users. Be sure to configure the server so that the installation files are accessible to the systems that you wish to install. If you are using a PXE Boot Install server, follow the instructions at :ref:`PXE Boot Install Server`.
es: Si está usando un servidor HTTP, FTP o SSH como medio de instalación, descomprima o copie los archivos requeridos en un directorio que sea accesible por los usuarios. Asegúrese de configurar el servidor de manera que los archivos de instalación sean accesibles a los sistemas que desee instalar. Si está usando un servidor de instalación PXE Boot, siga las instrucciones en :ref:`Servidor de Instalación PXE Boot`.
