Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: In the "Extents" tab, click the "Add Extent" button. In the screen shown in :numref:`Figure %s: Configure the Extent <iscsi11>`, input an "Extent Name", in this case it is *pcbsd-backup*, and make sure that the zvol you created is selected in the "Device" drop-down menu. Click "OK" to create the extent.
es: En la pestaña "Extensiones", presione el botón "Añador Extensión". En la pantalla mostrada en la :numref:`Figura %s: Configurando la Extensión <iscsi11>`, ingrese un "Nombre de Extensión", en este caso es *pcbsd-backup*, y asegúrese que el zvol que ha creado está seleccionado en el menú desplegable "Dispositivo". Presione "OK" para crear la extensión.

source: Finish the iSCSI configuration by clicking the "Associated Targets" tab, then the "Add Target / Extent" button. In the screen shown in :numref:`Figure %s: Associate the Target With the Extent <iscsi12a>`, select the "Target" and the "Extent" that you created.
es: Termine la configuración de iSCSI presionando la pestaña "Destinos Asociados", luego el botón "Añadir Destino / Extensión". En la pantalla mostrada en la :numref:`Figura %s: Asociando el Destino con la Extensión <iscsi12a>`, seleccione el "Destino" y la "Extensión" que ha creado.

source: Next, go to :menuselection:`Services` and click the red "OFF" button next to the iSCSI service. Wait for it to turn to a blue "ON", indicating that the iSCSI service has started.
es: Después, vaya a :menuselection:`Servicios` y presione el botón rojo "APAGADO" junto al servicio iSCSI. Espere a que se convierta en "ENCENDIDO" de color azul, indicando que el servicio se ha iniciado.

source: To configure the stunnel service, open :menuselection:`Shell` and type the following::
es: Para configurar el servicio stunnel, abra :menuselection:`Consola` y escriba lo siguiente::

source: Next, create a file named :file:`/usr/local/etc/stunnel/stunnel.conf` with the following contents::
es: A continuación, cree un archivo llamado :file:`/usr/local/etc/stunnel/stunnel.conf` que contenga lo siguiente::

source: Make sure that the stunnel service starts using this command::
es: Asegúrese de que el servicio stunnel se inicie usando este comando::

source: to ensure that the stunnel service also starts whenever the FreeNAS® system reboots, use :menuselection:`System --> Tunables --> Add Tunable` to create a tunable with a "Variable" of *stunnel_enable*, a "Value" of *YES*, and a "Type" of *rc.conf*.
es: Para asegurarse de que el servicio stunnel también inicie cada que el sistema FreeNAS® se reinicie, use :menuselection:`Sistema --> Ajustadores --> Añadir Ajustador` para crear un ajustador, con una "Variable" de *stunnel_enable*, un "Valor" de *Sí* y un "Tipo" de *rc.conf*.

source: Finally, create a :file:`*.lps` file on the PC-BSD® system using a text editor. Edit the following example so that the IP address of the FreeNAS® system is in the "ihost" field, the "iuser" value matches the "User" in :menuselection:`Sharing --> Block (iSCSI) --> Authorized Access`, the "ipassword" value matches the "Secret" you set when you created the "Authorized Access", and the "itarget" value matches the "Target Name" in :menuselection:`Sharing --> Block (iSCSI) --> Targets`::
es: Finalmente, cree un archivo :file:`*.lps` en el sistema PC-BSD® usando un editor de texto. Edite el siguiente ejemplo de manera que la dirección IP del sistema FreeNAS® está en el campo "ihost", que el valor "iuser" coincida con "Usuario" en :menuselection:`Compartir --> Bloque (iSCSI) --> Acceso Autorizado`, que el valor "ipassword" coincida con el "Secreto" que usted estableció cuando creó el "Acceso Autorizado", y que el valor "itarget" coincida con el "Nombre del Destino" en :menuselection:`Compartir --> Bloque (iSCSI) --> Destinos`::

source: You are now ready to configure the PC-BSD® system using the instructions in :ref:`Configuring the System to Backup`.
es: Ahora está listo para configurar el sistema PC-BSD® usando las instrucciones en :ref:`Configurando el Sistema a Respaldar`.

source: Configuring the System to Backup
es: Configurando el Sistema a Respaldar

source: Once you have configured the backup system and the PC-BSD® system has a copy of the :file:`*.lps` file, open Life Preserver, go to :menuselection:`Configure --> Replication` and click the "iSCSI" button. This will start the "iSCSI Setup Wizard". Click "Next" to see the screen shown in Figure :numref:`Figure %s: Selecting the Configuration File <iscsi1>`.
es: Una vez que ha configurado el sistema de respaldos y el sistema PC-BSD® tiene una copia del archivo :file:`*.lps`, abra Life Preserver, vaya a :menuselection:`Configurar --> Replicación` y presione el botón "iSCSI". Esto iniciará el "Asistente de Configuración iSCSI". Presione "Siguiente" para ver la pantalla mostrada en la :numref:`Figura %s: Seleccionando el Archivo de Configuración <iscsi1>`.

source: Click the "Select" button to browse to the location of your saved :file:`.lps` file. Once selected, the "Host", "Target", "User", and "Password" fields will auto-populate with the settings from the configuration file. Click "Next" to see the screen shown in :numref:`Figure %s: Input the Encryption Key <iscsi2>`.
es: Presione el botón "Seleccionar" para buscar la localización de su archivo :file:`.lps` guardado. Una vez seleccionado, los campos "Anfitrión", "Destino", "Usuario", y "Contraseña" se llenarán automáticamente con los valores del archivo de configuración. Presione "Siguiente" para ver la pantalla mostrada en la :numref:`Figura %s: Ingresando la Llave de Encriptación <iscsi2>`.

source: This screen lets you configure the following:
es: Esta pantalla le permite configurar lo siguiente:

source: **Backup Schedule:** choices are "On New Snapshot", "Manually Started", "Daily", "Hourly", "Every 30 Minutes", or "Every 10 Minutes". If you select "Daily", another field will appear so that you can set the time.
es: **Programación de Respaldos.** las elecciones son "En Nuevo Snapshot", "Iniciado Manualmente", "Diario", "Cada Hora", "Cada 30 Minutos", o "Cada 10 Minutos". Si selecciona "Diario", otro campo aparecerá para que pueda establecer la hora.

source: **Re-use existing data on the host:** by default, this box is unchecked as the encryption key will be automatically generated for you and stored in :file:`/var/db/lpreserver/keys`. If you have previously configured an encrypted backup to this remote backup system and still have a copy of the encryption key for that system, check this box and use the browse button to add the key to the "GELI Encryption File" field.
es: **Reutilizar datos existentes en el anfitrión:** por defecto, esta casilla está desmarcada ya que la llave de encriptación se generará automáticamente para usted y se almacenará en :file:`/var/db/lpreserver/keys`. Si ha configurado previamente un respaldo encriptado en este sistema remoto de respaldos y todavía tiene una copia de la llave de encriptación para ese sistema, seleccione esta casilla y use el botón de búsqueda para añadir la llave al campo "Archivo de Encriptación GELI".

source: When finished, click "Next". A pop-up menu will ask if you are ready to enable off-site data storage. Click "Yes" to complete the configuration. This may take a few minutes. Once the connection to the remote system is established, you will see the screen shown in :numref:`Figure %s: Save the Key <iscsi3>`.
es: Cuando termine, presione "Siguiente". Un menú emergente le preguntará si está listo para habilitar el almacenamiento de datos fuera del sitio. Presione "Sí" para completar la configuración. Esto puede tomar unos minutos. Una vez que la conexión al sistema remoto se ha establecido, verá la pantalla mostrada en la :numref:`Figura %s: Guardando la Llave <iscsi3>`.

source: This screen creates the :file:`.lpiscsi` file that is needed when :ref:`Restoring the Operating System` from an encrypted backup. **It is VERY important that you remember the password that you set on this file and that you save this file on ANOTHER system or removable media. Without this file and the correct password, you will NOT be able to restore the system should there ever be a catastrophic failure.** This is an encrypted file which contains contains the :file:`.lps` file and a copy of the GELI key.
es: Esta pantalla crea el archivo :file:`.lpiscsi` que se necesita cuando vaya a :ref:`Restaurar el Sistema Operativo` desde una respaldo encriptado. **Es MUY importante que recuerde la contraseña que estableció para este archivo y que guarde este archivo en OTRO sistema o medio extraíble. Sin este archivo y la contraseña correcta, NO será capaz de restaurar el sistema si hubiera una falla catastrófica**. Éste es un archivo encriptado que contiene el archivo :file:`.lps` y una copia de la llave GELI.

source: Input and confirm a password that you will be able to remember and that other users should not be able to guess, then click "Create Key File". A pop-up message should indicate that the key file was successfully created in :file:`/usr/home`. You should **immediately** copy that file to another system or removable media, such as a USB stick. Click "Finish" to exit the wizard.
es: Introduzca y confirme la contraseña que será capaz de recordar y que otros usuarios no serán capaces de adivinar, después presione "Crear el Archivo Llave". Un mensaje emergente debería indicarle que el archivo llave se creó satisfactoriamente en :file:`/usr/home`. Usted debería copiar *inmediatamente* ese archivo a otro sistema o medio extraíble, como una memoria USB. Presione "Finalizar" para salir del asistente.

source: Restoring the Operating System
es: Restaurar el Sistema Operativo

source: If you have replicated the system's snapshots to a remote backup server, you can use a PC-BSD® installation media to perform an operating system restore or to clone another system. Start the installation as usual until you get to the screen shown in :numref:`Figure %s: Selecting to Restore/Clone From Backup <lpreserver15>`.
es: Si ha replicado los snapshots del sistema en un servidor de respaldos remotro, puede usar un medio de instalación de PC-BSD® para realizar una restauración del sistema operativo o para clonar otro sistema. Comience la instalación como es habitual hasta que llegue a la pantalla mostrada en la :numref:`Figura %s: Seleccionando Restaurar/Clonar desde un Respaldo <lpreserver15>`.

source: Before you can perform a restore, the network interface must be configured. Click the "network connectivity" icon (second from the left) in order to determine if the network connection was automatically detected. If it was not, refer to the instructions in :ref:`Network Configuration` and make sure that networking is working before continuing.
es: Antes de que pueda llevar a cabo una restauración, la interfaz de red debe estar configurada. Presione el icono "conectividad de red" (el segundo desde la izquierda) para determinar si la conexión de red se detectó automáticamente. Si no lo fue, consulte las instrucciones en :ref:`Configuración de Red` y asegúrese de que la red está funcionando antes de continuar.

source: If you are restoring from an encrypted backup, you will need to copy over the saved :file:`*.lpiscsi` file. If this file is stored on a USB stick, insert it now. If it is saved on a remote system, click the black terminal icon and click "shell" from the menu. You can then use :command:`scp` or :command:`sftp` to copy the file from the remote system. When finished, type :command:`exit` to exit the shell then use your arrow keys to select "exit" in the menu to exit the menu.
es: Si está restaurando desde un respaldo encriptado, necesitará copiar el archivo guardado :file:`*.lpiscsi`. Si este archivo está almacenado en una memoria USB, insértela ahora. Si está guardado en un sistema remoto, presione el icono de terminal negro y presione "Consola" desde el menú. Puede usar :command:`scp` o :command:`sftp` para copiar el archivo desde el sistema remoto. Cuando haya finalizado, escriba :command:`exit` para salir de la consola y luego use las teclas de flechas para seleccionar "salir" en el menú para salir del menú.

source: Once you are ready, click "Restore from Life-Preserver backup" and the "Next" button. This will start the Restore Wizard. Click "Next" to select the type of restore using the screen shown in :numref:`Figure %s: Restoring From an Encrypted Backup <lpreserver16>`.
es: Una vez que está listo, presione "Restaurar desde un respaldo de Life-Preserver" y el botón "Siguiente". Esto iniciará el Asistente de Restauración. Presione "Siguiente" para seleccionar el tipo de restauración usando la pantalla mostrada en la :numref:`Figura %s: Restaurando Desde un Respaldo Encriptado <lpreserver16>`.

source: If you configured an encrypted backup using the instructions in :ref:`Replicating Encrypted Backups`, click the "+" button in the "Encrypted iSCSI Restore" tab to browse to the location of the :file:`*.lpiscsi` file that you either copied over or which is on the inserted USB stick, enter the password to decrypt this file, and click "Next". A "Restore Summary" screen will indicate the name of the :file:`*.lpiscsi` file that the system will be restored from. Click "Finish". The restore wizard will provide a summary of which host it will restore from, the name of the user account associated with the replication, and the hostname of the target system. Click "Finish" and the installer will proceed to the :ref:`Disk Selection Screen`. At this point, you can click the "Customize" button to customize the disk options. However, in the screen shown in Figure 3.3h, the ZFS datasets will be greyed out as they will be recreated from the backup during the restore. Once you are finished with any customizations, click "Next" to perform the restore.
es: Si usted configuró un respaldo encriptado usando las instrucciones en :ref:`Replicando Respaldos Encriptados`, presione el botón "+" en la pestaña "Restauración iSCSI Encriptada" para buscar la localización del archivo :file:`*.lpiscsi` que usted copió o que está en una memoria USB insertada, ingrese la contraseña para desencriptar este archivo, y presione "Siguiente". Una pantalla de "Resumen de la Restauración" le indicará el nombre del archivo :file:`*.lpiscsi` desde el que el sistema será restaurado, el nombre de la cuenta de usuario asociada con la replicación, y el nombre del equipo del sistema destino. Presione "Terminar" y el instalador procederá a la :ref:`Pantalla de Selección de Disco`. En este punto, puede presionar el botón "Personalizar" para personalizar las opciones del disco. Una vez que termine con las personalizaciones, presione "Siguiente" para iniciar la restauración.

source: If you instead configured backups to a replication server using the instructions in :ref:`Scheduling a Backup`, click the "SSH Restore" tab. In the screen shown in :numref:`Figure %s: Input the Information for a SSH Restore <lpreserver20>`, input the IP address of the backup server and the name of the user account used to replicate the snapshots. If the server is listening on a non-standard SSH port, change the "SSH port" number. Then, click "Next" to select an authentication method in the screen shown in :numref:`Figure %s: Select the Authentication Method <lpreserver17>`.
es: Si usted, por otro lado, configuró los respaldos a un servidor de replicación usando las instrucciones en :ref:`Planificando un Respaldo`, presione la pestaña "Restauración SSH". En la pantalla mostrada en la :numref:`Figura %s: Ingresando la Información para una Restauración SSH <lpreserver20>`, ingrese la dirección IP del servidor de respaldos y el nombre de la cuenta de usuario usada para replicar los snapshots. Si el servidor está escuchando en un puerto SSH no estándar, cambie el número de "Puerto SSH". Entonces, presione "Siguiente" para seleccionar un método de autenticación en la pantalla mostrada en la :numref:`Figura %s: Seleccionando el Método de Autenticación <lpreserver17>`.

source: If you previously saved the SSH key to a USB stick, insert the stick then press "Next". Otherwise, change the selection to "Use password authentication" and press "Next". The next screen will either read the inserted USB key or prompt for the password, depending upon your selection. The wizard will then attempt a connection to the server.
es: Si guardó previamente la llave SSH en una memoria USB, insértela y después presione "Siguiente". De otra forma, cambie la selección para "Usar la contraseña de autenticación" y presione "Siguiente". La siguiente pantalla leerá la memoria USB insertada o bien le pedirá la contraseña, dependiendo de su selección. Después, el asistente tratará de conectarse al servidor.

source: Once the connection to the backup server succeeds, you will be able to select which host to restore. In the example shown in :numref:`Figure %s: Select the Host to Restore <lpreserver18>`, only one host has been backed up to the replication server.
es: Una vez que la conexión al servidor de respaldos fue exitosa, usted podrá seleccionar qué equipo restaurará. En el ejemplo mostrado en la :numref:`Figura %s: Seleccionando el Equipo a Restaurar <lpreserver18>`, solamente un equipo ha sido respaldado en el servidor de replicación.

source: After making your selection, click "Next". The restore wizard will provide a summary of which host it will restore from, the name of the user account associated with the replication, and the hostname of the target system. Click "Finish" and the installer will proceed to the :ref:`Disk Selection Screen`. At this point, you can click the "Customize" button to customize the disk options. However, in the screen shown in Figure 3.3h, the ZFS datasets will be greyed out as they will be recreated from the backup during the restore. Once you are finished with any customizations, click "Next" to perform the restore.
es: Después de hacer su selección, presione "Siguiente". El asistente de restauración le proveerá un resumen de cuál equipo realizará la restauración, el nombre de la cuenta de usuario asociada con la replicación, y el nombre de equipo del sistema destino. Presione "Terminar" y el instalador procederá a la :ref:`Pantalla de Selección de Disco`. En este punto, usted puede presionar el botón "Personalizar" para personalizar las opciones del disco. Una vez que ha terminado con cualquier personalización, presione "Siguiente" para iniciar la restauración.

source: Using the lpreserver CLI
es: Usando el CLI lpreserver

source: The :command:`lpreserver` command line utility can be used to manage snapshots and replication from the command line of a PC-BSD® or TrueOS® system. This command needs to be run as the superuser. To display its usage, type the command without any arguments::
es: La utilidad de línea de comandos :command:`lpreserver` se puede usar para administrar snapshots y replicaciones desde la línea de comandos de un sistema PC-BSD® o TrueOS®. Este comando necesita ser ejecutado en modo administrador. Para ver su uso, escriba el comando sin ningún argumento::

source: Each command has its own help text that describes its parameters and provides a usage example. For example, to receive help on how to use the :command:`lpreserver cronsnap` command, type::
es: Cada comando tiene su propio texto de ayuda que describe sus parámetros y proporciona un ejemplo de uso. Por ejemplo, para recibir ayuda sobre como usar el comando :command:`lpreserver cronsnap` escriba::

source: Table 8.19a shows the command line equivalents to the graphical options provided by the Life Preserver GUI. Note that some options are only available from the command line.
es: La Tabla 8.19a muestra los equivalentes en línea de comandos de las opciones gráficas proporcionadas por la GUI de Life Preserver. Note que algunas opciones sólo están disponibles desde la línea de comandos.

source: **Table 8.19a: Command Line and GUI Equivalents**
es: **Tabla 8.19a: Equivalencias entre la Línea de Comandos y la Interfaz Gráfica**

source: **Command Line**
es: **Línea de Comandos**

source: **GUI**
es: **Interfaz Gráfica**

source: :menuselection:`Configure --> Local Snapshots`
es: :menuselection:`Configurar --> Snapshots Locales`

source: schedule when snapshots occur and how long to keep them; the **stop** option can be used to disable snapshot creation
es: Programe cuándo se harán los snapshots y cuánto tiempo se guardarán; la opción **stop** se puede usar para deshabilitar la creación de snapshots

source: schedule a ZFS scrub
es: Programar un scrub ZFS

source: list Life Preserver options
es: Lista las opciones de Life Preserver

source: list which ZFS pools have a scheduled snapshot
es: Listar qué pools ZFS tienen un snapshot programado

source: Restore Data
es: Restaurar Datos

source: list snapshots of specified dataset
es: Listar snapshots de datasets específicos

source: :menuselection:`Snapshots --> New Snapshot`
es: :menuselection:`Snapshots --> Nuevo Snapshot`

source: create and replicate a new ZFS snapshot; by default, snapshots are recursive, meaning that a snapshot is taken of every dataset within a pool
es: Crear y replicar una nuevo snapshot ZFS; por defecto, los snapshots son recursivos, lo que significa que un snapshot se toma de cada dataset dentro de un pool.

source: :menuselection:`Configure --> Replication`
es: :menuselection:`Configurar --> Replicación`

source: used to list, add, and remove backup server; read the **help** for this command for examples
es: Usado para listar, añadir, o eliminar un servidor de respaldos; lea la **ayuda** de este comando para ejemplos

source: revert dataset to the specified snapshot version
es: Revertir el dataset a la versión especificada del snapshot

source: :menuselection:`Snapshots --> Delete Snapshot`
es: :menuselection:`Snapshots --> Eliminar Snapshot`

source: deletes specified snapshot; by default, all datasets within the snapshot are deleted
es: Elimina snapshots específicas; por defecto, todos los datasets dentro del snapshot son eliminados

source: configures Life Preserver options; read **help** for the list of configurable options
es: Configura las opciones de Life Preserver; lea la **ayuda** para la lista de opciones configurables

source: Status
es: Estado

source: lists the last snapshot name and replication status
es: Lista el nombre del último snapshot y estado de replicación

source: :menuselection:`Disks --> Attach Disk` and :menuselection:`Disks --> Detach Disk`
es: :menuselection:`Discos --> Conectar Disco` y :menuselection:`Discos --> Desconectar Disco`

source: used to attach/detach drives from the pool; read **help** for examples
es: Usado para conectar/desconectar discos del pool; lea la **ayuda** para ver ejemplos

source: Mirroring the System to a Local Disk
es: Haciendo una Copia del Sistema en un Disco Local
