Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: To create the user account, go to :menuselection:`Account --> Users --> Add User`. In the screen shown in :numref:`Figure %s: Creating a User in FreeNAS® <lpreserver12>`, input a "Username" that you will later configure Life Preserver to use. Under "Home Directory", use the browse button to browse to the location of the dataset that you made to store the backups. Input a "Full Name", then input and confirm a "Password". When finished, click the "OK" button to create the user.
es: Para crear la cuenta de usuario, vaya a :menuselection:`Cuentas --> Usuarios --> Añadir Usuario`. En la pantalla mostrada en la :numref:`Figura %s: Creando un Usuario en FreeNAS® <lpreserver12>`, ingrese un "Nombre de usuario" para el que luego configurará Life Preserver para usarlo. Bajo "Directorio Personal", use el botón de búsqueda para buscar la localización del dataset que hizo para guardar los backups. Ingrese un "Nombre Completo", y luego ingrese y confirme una "Contraseña". Cuando termine, presione el botón "OK" para crear el usuario.

source: Next, give the user permissions to the dataset by going to :menuselection:`Storage --> Volumes`, click the + next to the name of the volume, click the "+" next to the name of the dataset, then click "Change Permissions" for the expanded dataset. In the screen shown in :numref:`Figure %s: Setting Permissions in FreeNAS® <lpreserver13a>`, change the "Owner (user)"and "Owner (group)" to the user that you created. Click "Change" to save the change.
es: Enseguida, dele al usuario permisos en el dataset yendo a :menuselection:`Almacenamiento --> Volúmenes`, presione el + junto al nombre del volumen, presione el "+" junto al nombre del dataset, luego presione "Cambiar Permisos" para el dataset expandido. En la pantalla mostrada en la :numref:`Figura %s: Estableciendo Permisos en FreeNAS® <lpreserver13a>`, cambie el "Dueño(usuario)" y el "Dueño(grupo) al usuario que creó. Presione "Cambiar" para guardar los cambios.

source: Next, click on "Shell" and type the following command, replacing *dru* and *volume1/backups* with the name of the user, volume, and dataset that you created::
es: Enseguida, presione en "Consola" y escriba el siguiente comando, reemplazando *dru* y *volume1/respaldos* con el nombre del usuario, volumen, y del dataset creado::

source: Click the "x" in the upper right corner to close "Shell". Then, to enable the SSH service, go to :menuselection:`Services --> Control Services`, shown in :numref:`Figure %s: Start SSH in FreeNAS® <lpreserver14>`.
es: Presione la "x" en la esquina superior derecha para cerrar la "Consola". Después, habilite el servicio SSH, vaya a :menuselection:`Servicios --> Servicios de Control`, mostrado en la :numref:`Figura %s: Iniciando SSH en FreeNAS® <lpreserver14>`.

source: Click the red "OFF" button next to SSH to enable that service. Once it turns to a blue "ON", the FreeNAS® system is ready to be used as the backup server.
es: Presione el botón rojo de "APAGADO" junto a SSH para habilitar ese servicio. Una vez que se transforme en un "ENCENDIDO" de color azul, el sistema FreeNAS® está listo para ser usado como un servidor de respaldos.

source: To finish the configuration, open Life Preserver on the PC-BSD® system and click :menuselection:`Configure --> Replication`. In the screen shown in :numref:`Figure %s: Configuring Replication <lpreserver22>`, click the "+SSH" button. Life Preserver will scan the network for systems running SSHD and, if the scan is successful, a pop-up menu will show the hostnames of the available systems. If multiple systems are running SSH, use the drop-down menu to select the desired system and click "OK". If you instead receive an error message, check to see if there is a firewall between the PC-BSD® and the FreeNAS® system as this scan requires UDP port 5353 to be open on any firewalls running on or between the two systems.
es: Para terminar la configuración, abra Life Preserver en el sistema PC-BSD® y presione :menuselection:`Configurar --> Replicación`. En la pantalla mostrada en la :numref:`Figura %s: Configurando la Replicación <lpreserver22>`, presione el botón "+SSH". Life Preserver buscará en la red por sistemas corriendo SSHD y, si la búsqueda es exitosa, un menú emergente mostrará los nombres de equipo de los sistemas disponibles. Si muchos sistemas están corriendo SSH, use el menú desplegable para seleccionar el sistema deseado y presione "OK". Si al contrario, recibe un mensaje de error, revise para ver si hay algún cortafuegos entre los sistemas PC-BSD® y FreeNAS® ya que esta búsqueda requiere que el puerto UDP 5353 esté abierto en cualquier cortafuegos corriendo en o entre ambos sistemas.

source: Once the system is selected, its IP address will be added to the drop-down menu to the left of the "+SSH" button, the port number SSH is listening on will display in the "SSH Port" menu, and the rest of this screen will be activated. In the example shown in :numref:`Figure %s: Finishing the Configuration <lpreserver24>`, the IP address of the FreeNAS® system is 192.168.1.73.
es: Una vez que el sistema esté seleccionado, su dirección IP se añadirá al menú desplegable a la izquierda del botón "+SSH", el número de puerto SSH que está escuchando se desplegará en el menú "Puerto SSH", y el resto de esta pantalla será activado. En el ejemplo mostrado en la :numref:`Figura %s: Terminando la Configuración <lpreserver24>`, la dirección IP del sistema FreeNAS® es 192.168.1.73.

source: Input the name of the user and the name of the dataset you created on the FreeNAS® system. In this example, the "User Name" is *dru* and the "Remote Dataset" is *volume1/backups*. If desired, click the "Frequency" drop-down menu to configure the snapshots to either be replicated at the same time that they are created ("Sync with snapshots") or "Daily", "Hourly", every "30 Minutes", every "10 minutes", or only when you manually start the replication from :menuselection:`Snapshots --> Start Replication` ("Manual").
es: Introduzca el nombre del usuario y el nombre del dataset que creó en el sistema FreeNAS®. En este ejemplo, el "Nombre de Usuario" es *dru* y el "Dataset Remoto" es *volume1/backups*. Si lo desea, presione el menú desplegable "Frecuencia" para configurar que los snapshots sean, o bien replicados al mismo tiempo que son creados ("Sincronizar con los snapshots") o bien "Diario", "Cada Hora", cada "30 minutos", cada "10 minutos", o solo cuando usted inicie manualmente la replicación desde :menuselection:`Snapshots --> Iniciar Replicación` ("Manual").

source: When finished, click "Apply", Life Preserver will check that it can connect to the backup server and will prompt for the password of "User Name". A second pop-up message will remind you to save the SSH key to a USB stick (as described in :ref:`Life Preserver Options`) as this key is required for :ref:`Restoring the Operating System`.
es: Cuando termine, presione "Aplicar", Life Preserver comprobará si se puede conectar al servidor de respaldos y le pedirá la contraseña del "Nombre de Usuario". Un segundo mensaje emergente le recordará que guarde la llave SSH en una memoria USB (como se describió en :ref:`Opciones de Life Preserver`) ya que la llave se requiere para :ref:`Restaurar el Sistema Operativo`.

source: if you don't receive the pop-up message asking for the password, check that the firewall on the backup system, or a firewall within the network, is not preventing access to the port number listed in "SSH Port". Also, this pop-up only occurs once. If the password changes or you are not able to successfully login, use :menuselection:`Snapshots --> Reset Replication Password` to re-input the password.
es: Si no recibe el mensaje emergente pidiéndole la contraseña, compruebe que el cortafuegos en el sistema de respaldos, o un cortafuegos en la red, no esté impidiendo el acceso al número del puerto listado en "Puerto SSH". Además, este mensaje emergente aparece una sola vez. Si la contraseña cambia o no es capaz de conectarse con éxito, use :menuselection:`Snapshots --> Restablecer Contraseña de Replicación` para reintroducir la contraseña.

source: Once the SSH login is successful, Life Preserver will begin to replicate snapshots to the remote system at the configured "Frequency". Note that the first replication can take several hours to complete, depending upon the speed of the network. Subsequent replications will only contain changed data and will be much smaller. You can confirm that the snapshots have been received by clicking :menuselection:`Storage --> Snapshots` on the FreeNAS® system. This should provide a listing of the replicated datasets, allowing you to manage the replicated snapshots as described in `Snapshots <http://doc.freenas.org/9.3/freenas_storage.html#snapshots>`_.
es: Una vez que la conexión SSH es satisfactoria, Life Preserver comenzará a replicar los snapshots al sistema remoto con la "Frecuencia" configurada. Note que la primera replicación puede durar varias horas para completarse, dependiendo de la velocidad de la red. Las replicaciones posteriores sólo contendrán los datos que hayan cambiado y serán mucho más pequeñas. Usted puede confirmar que se han recibido los snapshots presionando en :menuselection:`Almacenamiento --> Snapshots` en el sistema FreeNAS®. Esto debería mostrar un listado de los datasets replicados, permitiéndole administrar los snapshots replicados como se describe en `Snapshots <http://doc.freenas.org/9.3/freenas_storage.html#snapshots>`_.

source: Life Preserver uses backend checks so that it is safe to keep making snapshots while a replication is in process. It will not prune any existing snapshots until the replication is finished and it will not start a second replication before the first replication finishes.
es: Life Preserver usa comprobaciones en segundo plano de manera que es seguro seguir haciendo snapshots mientras una replicación está en proceso. No eliminará ningún snapshot existente hasta que la replicación haya terminado y no comenzará una segunda replicación antes de que la primera replicación finalice.

source: Replicating Encrypted Backups
es: Replicando Respaldos Encriptados

source: The previous section demonstrated how to securely replicate snapshots to another system over SSH, which ensures that the data is encrypted while it is being transferred over the network. Life Preserver provides an alternate replication method which provides an extra measure of security by adding support for fully-encrypted backups using `stunnel <https://www.stunnel.org/index.html>`_ and GELI-backed iSCSI volumes. This means that the data stored on the remote side is encrypted and only accessible with the key file stored on the PC-BSD® system. The remote backup server must understand kernel iSCSI, meaning that it must be running FreeBSD, PC-BSD®/TrueOS®, or FreeNAS®. However, the remote system does not need to be formatted with ZFS.
es: La sección anterior demostró como replicar snapshots de forma segura en otro servidor mediante SSH, lo cual asegura que los datos están encriptados mientras se están transfiriendo a través de la red. Life Preserver proporciona un método de replicación alterno que aporta una medida extra de seguridad mediante la adición de soporte para respaldos totalmente encriptados usando `stunnel <https://www.stunnel.org/index.html>`_ y volúmenes iSCSI respaldados por GELI. Esto significa que los datos almacenados en el lado remoto están encriptados y son sólo accesibles con el archivo de la llave almacenado en el sistema PC-BSD®. El servidor remoto de respaldos debe entender iSCSI en el kernel, lo que implica que debe estar ejecutando FreeBSD, PC-BSD®/TrueOS®, o FreeNAS®. Sin embargo, el sistema remoto no necesita estar formateado con ZFS.

source: The backup system must meet the following requirements:
es: El sistema de respaldos debe cumplir los siguientes requerimientos:

source: It must be running FreeBSD 9.1 or higher, PC-BSD® or TrueOS® 10.1.2 or higher, or FreeNAS® 9.3
es: Debe estar ejecutando FreeBSD 9.1 o superior, PC-BSD® o TrueOS® 10.1.2 o superior, o FreeNAS® 9.3

source: If it is a FreeBSD system, the "security/stunnel" package must be installed. This software is already installed on PC-BSD®/TrueOS® 10.1.2 and on FreeNAS® 9.3 systems that have been updated to at least SU201504100216.
es: Si es un sistema FreeBSD, el paquete "security/stunnel" debe estar instalado. Este software está ya instalado en sistemas PC-BSD®/TrueOS® 10.1.2 y en FreeNAS® 9.3 que se han actualizado al menos a SU201504100216.

source: If it is a FreeBSD system, the `lpreserver-host-iscsi <https://raw.githubusercontent.com/pcbsd/pcbsd/master/src-sh/lpreserver/lpreserver-host-iscsi>`_ script must be downloaded. This file is already installed to :file:`/usr/local/bin/` on PC-BSD®/TrueOS® 10.1.2 systems. Refer to :ref:`Using FreeNAS® as the Backup System` for FreeNAS® instructions.
es: Si es un sistema FreeBSD, se debe descargar el script `lpreserver-host-iscsi <https://raw.githubusercontent.com/pcbsd/pcbsd/master/src-sh/lpreserver/lpreserver-host-iscsi>`_ . Este archivo está ya instalado en :file:`/usr/local/bin/` en sistemas PC-BSD®/TrueOS® 10.1.2. Consulte :ref:`Usando FreeNAS® como el Sistema de Respaldo` para instrucciones acerca de FreeNAS®.

source: Before you can backup the PC-BSD® system using this replication method, you must first create a Life Preserver configuration file ending in the :file:`.lps` extension on the remote system which will store the encrypted backups. To create this file on a FreeBSD 9.1 or higher system or on a PC-BSD®/TrueOS® 10.1.2 system, run the :command:`lpreserver-host-iscsi` script as the *root* user. Input the information that the script asks for as seen in the following example. Table 8.19b summarizes the various options that this script prompts for. ::
es: Antes de que pueda respaldar el sistema PC-BSD® usando este método de replicación, primero debe crear un archivo de configuración de Life Preserver que termine con la extensión :file:`.lps` en el sistema remoto, el cual almacenará los respaldos encriptados. Para crear este archivo en un sistema FreeBSD 9.1 o superior o en un sistema PC-BSD®/TrueOS® 10.1.2, ejecute como *administrador* el script :command:`lpreserver-host-iscsi`. Introduzca la información que pide el script como se muestra en el siguiente ejemplo. La Tabla 8.19b resume las distintas opciones por las que el script le preguntará.::

source: Once you input *y*, the script will configure the necessary services for startup, generate an RSA key, and prompt you for information to go into the digital certificate, as seen in this example::
es: Una vez que introduzca *y*, el script cofigurará los servicios necesarios para comenzar, generará un llave RSA, y le pedirá información que irá dentro del certificado digital, como se ve en este ejemplo::

source: **Table 8.19b: Configuration Options**
es: **Tabla 8.19b: Opciones de Configuración**

source: **Option**
es: **Opción**

source: **Description**
es: **Descripción**

source: target host name
es: Nombre del sistema destino

source: the IP address of the server which will hold the encrypted backups
es: La dirección IP del servidor que contendrá los respaldos encriptados

source: target name
es: Nombre del destino

source: can be anything, as long as it is does not already exist in :file:`/etc/ctl.conf`
es: Puede ser cualquier cosa, siempre que no exista ya en :file:`/etc/ctl.conf`

source: CHAP username
es: Nombre de usuario CHAP

source: must be between 8 and 12 characters
es: Debe ser entre 8 y 12 caracteres

source: CHAP password
es: Contraseña CHAP

source: must be between 12 and 16 characters
es: Debe ser entre 12 y 16 caracteres

source: ZVOL name
es: Nombre del ZVOL

source: in the format *poolname/something-useful*
es: En el formato *nombre-del-pool/algo-útil*

source: ZVOL size
es: Tamaño del ZVOL

source: **must be at least the same size as the pool to be backed up**
es: **Debe ser al menos del mismo tamaño que el pool a respaldar**

source: Once you have successfully created the :file:`.lps` file, copy it to the PC-BSD® system to be backed up. You are now ready to configure the PC-BSD® system using the instructions in :ref:`Configuring the System to Backup`.
es: Una vez que haya creado satisfactoriamente el archivo :file:`.lps`, cópielo al sistema PC-BSD® que se respaldará. Ahora está listo para configurar el sistema PC-BSD® usando las instrucciones en :ref:`Configurando el Sistema de Respaldos`.

source: Using FreeNAS® as the Backup System
es: Usando FreeNAS® como el Sistema de Respaldos.

source: To instead prepare a FreeNAS® 9.3 system to use as the backup target, first ensure that the system has been updated to the latest software update using :menuselection:`System -> Update`. Then, perform the following configuration steps.
es: Para, en vez de eso, preparar un sistema FreeNAS® 9.3 que se usará como el destino de los respaldos, asegúrese primero de que el sistema ha sido actualizado al software más reciente usando :menuselection:`Sistema -> Actualizar`. Después, realice los siguientes pasos de configuración.

source: Create a service account for the stunnel service by going to :menuselection:`Account --> Users --> Add User`. In the screen shown in :numref:`Figure %s: Create the Service Account <iscsi4>`, input the following values in these fields then press "OK" to create the account:
es: Cree una cuenta de servicio para el servicio de stunnel yendo a :menuselection:`Cuentas --> Usuarios --> Añadir Usuario`. En la pantalla mostrada en la :numref:`Figura %s: Creando la Cuenta de Servicio <iscsi4>`, ingrese los siguientes valores en estos campos y presione "OK" para crear la cuenta:

source: **User ID:** 341
es: **ID de Usuario:** 341

source: **Username:** stunnel
es: **Nombre de usuario:** stunnel

source: **Full Name:** stunnel service (or something useful to you)
es: **Nombre Completo:** servicio stunnel (o algo con significado para usted)

source: **Disable password login:** check this box
es: **Deshabilitar la contraseña de acceso:** seleccione esta casilla

source: Next, create a zvol using the tree menu. Go to :menuselection:`Storage --> Volumes --> click the plus to expand name of volume --> Create zvol`. In the example shown in :numref:`Figure %s: Create the zvol <iscsi5>`, a zvol of 50GB in size named "pcbsd-backup" is created on the volume named "volume1".
es: Enseguida, cree un zvol usando el menú de árbol. Vaya a :menuselection:`Almacenamiento --> Volúmenes --> presione el + para expandir el nombre del volumen --> Crear zvol`. En el ejemplo mostrado en la :numref:`Figure %s: Creando el zvol <iscsi5>`, un zvol de 50 GB de tamaño llamado "pcbsd-backup" es creado en el volumen llamado "volume1".

source: You are now ready to configure iSCSI. Go to :menuselection:`Sharing --> Block (iSCSI)`. In the "Target Global Configuration" screen shown in :numref:`Figure %s: Configure the IQN <iscsi6a>`, change the default "Base Name" to *iqn.2012-06.com.lpreserver* and click "Save".
es: Ahora está listo para configurar iSCSI. Vaya a :menuselection:`Compartir --> Bloque (iSCSI)`. En la pantalla "Configuración Global del Destino" mostrada en la :numref:`Figura %s: Configurando el IQN <iscsi6a>`, cambie el "Nombre Base" predeterminado por *iqn.2012-06.com.lpreserver* y presione "Guardar".

source: Click the "Portals" tab then the "Add Portal" button. Verify that the "IP Address" drop-down menu is set to *0.0.0.0* and that the "Port" field is set to *3260*, add a "Comment" if it is useful to you, then click "OK" to add the entry to the "Portals" tab. In the example shown in :numref:`Figure %s: Configure the Portal <iscsi7a>`, this is the first time iSCSI has been configured on this system, so it has a "Portal Group ID" of *1*. If you have already created other iSCSI targets, note the "Portal Group ID" you just created.
es: Presione la pestaña "Portales" y luego el botón "Añadir Portal". Verifique que el menú desplegable de la "Dirección IP" está establecido a *0.0.0.0* y que los campos de "Puerto" estén en *3260*, añada un "Comentario" si es útil para usted, entonces presione "OK" para añadir la entrada a la pestaña "Portales". En el ejemplo mostrado en la :numref:`Figura %s: Configurando el Portal <iscsi7a>`, esta es la primera vez que iSCSI ha sido configurado en este sistema, por lo que tiene un "ID del Grupo Portal" de *1*. Si ya ha creado antes otros destinos iSCSI, tome nota del "ID del Grupo Portal" que ha creado.

source: In the "Initiators" tab, click the "Add Initiator" button. Verify that both the "Initiators" and "Authorized network" fields are set to *ALL*, add a "Comment" if it is useful to you, and press "OK" to add an entry to the "Initiators" tab. Make note of the "Group ID" that is created. In the example shown in :numref:`Figure %s: Configure the Initiator <iscsi8>`, it is *1*.
es: En la pestaña "Iniciadores", presione el botón "Añadir Iniciador". Verifique que tanto los campos "Iniciadores" y "Red Autorizada" estén en *ALL*, añada un "Comentario" si es útil para usted, y presione "OK" para añadir una entrada a la pestaña "Iniciadores". Tome nota del "ID del Grupo" que es creado. En el ejemplo mostrado en la :numref:`Figura %s: Configurando el Iniciador <iscsi8>`, está en *1*.

source: In the "Authorized Access" tab, click the "Add Authorized Access" button. Input a value for the "User" that is between 8 and 12 characters and a value in the "Secret" and "Secret (Confirm)" fields that is between 12 and 16 characters, then press "OK". In the example shown in :numref:`Figure %s: Configure the Authorized Access <iscsi9>`, the "User" has a value of *mybackups*, the secret is *pcbsdbackups*, and the "Group ID" is *1*. Make note of the "Group ID" that is created for you.
es: En la pestaña "Acceso Autorizado", presione el botón "Añadir Acceso Autorizado". Ingrese un valor para el "Usuario" que esté entre 8 y 12 caracteres y un valor en los campos "Secreto" y "Secreto (Confirmar) que esté entre 12 y 16 caracteres, después presione "OK". En el ejemplo mostrado en la :numref:`Figura %s: Configurando el Acceso Autorizado <iscsi9>`, el "Usuario" tiene un valor de *mybackups*, el secreto es *pcbsdbackups*, y el "ID del Grupo" es *1*. Tome nota del "ID del Grupo" que usted ha creado.

source: In the "Targets" tab, click the "Add Target" button. In the screen shown in :numref:`Figure %s: Configure the Target <iscsi10a>`, use the following values in these fields:
es: En la pestaña "Destinos", presione el botón "Añadir Destino". En la pantalla mostrada en la :numref:`Figura %s: Configurando el Destino <iscsi10a>`, use los siguientes valores en esos campos:

source: **Target Name:** target0
es: **Nombre del Destino:** Destino0

source: **Portal Group ID:** select the portal group ID you created in the drop-down menu
es: **ID del Grupo Portal:** seleccione el ID del grupo portal que creó en el menú desplegable

source: **Initiator Group ID:** select the initiator group ID you created in the drop-down menu
es: **ID del Grupo Iniciador:** seleccione el ID del grupo iniciador que creó en el menú desplegable

source: **Auth Method:** select CHAP from the drop-down menu
es: **Método de Autenticación:** seleccione CHAP del menú desplegable

source: **Authentication Group number:** select "1" from the drop-down menu
es: **Número del Grupo Autentificación:** seleccione "1" en el menú desplegable
