Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: **Edit properties:** allows you modify the ZFS properties for the pool, as seen in the example shown in Figure :numref:`Figure %s: Editing the Pool's ZFS Properties <disk3>`. The available options depend upon the property being modified. The options which are read-only will have a red minus sign icon next to them. ZFS options are described in :command:`man zfs` and you should not change any options unless you are familiar with the ramifications of doing so.
es: **Editar propiedades:** le permite modificar las propiedades ZFS para el pool, como se muestra en el ejemplo en la :numref:`Figura %s: Editando las Propiedades ZFS del Pool <disk3>`. Las opciones disponibles dependen de la propiedad que se modifique. Las opciones que son de solo lectura tendrán un signo de menos rojo junto a ellas. Las opciones ZFS se describen en :command:`man zfs` y usted no debería cambiar ninguna opción a menos que esté familiarizado con las consecuencias de hacerlo.

source: When creating a new dataset or clone, the following options are available. Again, these options are described in :command:`man zfs` and you should not change any options unless you are familiar with the ramifications of doing so.
es: Cuando se crea un nuevo dataset o clon, las siguientes opciones están disponibles. Nuevamente, estas opciones están descritas en :command:`man zfs` y no debería cambiar ninguna opción a menos que esté familiarizado con las consecuencias de hacerlo.

source: **Name:** this field is pink as a reminder to type in the dataset name immediately after the trailing "/" of the displayed pool name.
es: **Nombre:** este campo está en rosa como un recordatorio para que escriba el nombre del dataset inmediatamente después de la barra "/" del nombre del pool mostrado.

source: **Prevent auto mount:** if the box is checked, the dataset will not be mounted at boot time and must instead be manually mounted as needed.
es: **Prevenir el montado automático:** si esta casilla está marcada, el dataset no se montará al momento del arranque y deberá entonces montarse manualmente cuando se necesite.

source: **Mountpoint:** choices are *none*, *legacy*, or *[path]*.
es: **Punto de Montaje:** las opciones son *ninguno*, *legado*, o *[ruta]*.

source: **Force UTF-8 only:** if checked, you will not be able to save any filenames that are not in the UTF-8 character code set.
es: **Forzar sólo UTF-8:** si está marcado, no será capaz de guardar ningún nombre de archivo que no esté en el conjunto del código de caracteres UTF-8.

source: **Unicode normalization:** if checked, indicate whether unicode normalization should occur when comparing filenames, and if so, which normalization algorithm to use. Choices are *none*, *formD*, or *formKCF*.
es: **Normalización Unicode:** si está marcado, indica si la normalización unicode debe darse cuando se comparen nombres de archivos, y si es así, qué algoritmo de normalización se debe usar. Las opciones son *ninguno*, *formD*, o *formKCF*.

source: **Copies:** if checked, indicates the number of copies (1 to 3) of data to store in the dataset. The copies are in addition to any redundancy and are stored on different disks when possible.
es: **Copias:** si está marcado, indica el número de copias (1 a 3) de datos para almacenar en el dataset. Las copias son adicionales a cualquier redundancia y están almacenadas en diferentes discos cuando sea posible.

source: **Deduplication:** enables deduplication. **Do not** enable this option if the system has less than the minimum recommended 5GB of RAM per TB of storage to be deduplicated.
es: **Deduplicación:** habilita la deduplicación. **No** habilite esta opción si el sistema tiene menos del mínimo recomendado de 5GB de memoria RAM por TB de almacenamiento que será deduplicado.

source: **Compression:** if checked and a compression algorithm is selected in the drop-down menu, data will automatically be compressed as it is written and uncompressed as it is read. The algorithm determines the amount and speed of compression, where typically increased compression results in decreased speed. The *lz4* algorithm is recommended as it provides very good compression at near real-time speed.
es: **Compresión:** si está marcado y un algoritmo de compresión está seleccionado en el menú desplegable, los datos serán comprimidos automáticamente a medida que se escriben y se descomprimirán a medida que se leen. El algoritmo determina la cantidad y velocidad de compresión, donde normalmente un aumento de la compresión resulta en una disminución de velocidad. El algoritmo *lz4* es recomendado ya que proporciona muy buena compresión a una velocidad casi de tiempo real.

source: To view the status of the ZFS pools and the disk(s) in the pool, click the "ZFS Pools" tab. In the example, shown in :numref:`Figure %s: Viewing the Status of the ZFS Pool <disk4>`, the ZFS pool named *tank1* was created from one disk. The state of "Online" indicates that the pool is healthy.
es: Para ver el estado de los pools ZFS y de los discos en el pool, presione la pestaña "Pools ZFS". En el ejemplo, mostrado en la :numref:`Figura %s: Viendo el Estado del Pool ZFS <disk4>`, el nombre del pool ZFS *tank1* fue creado desde un disco. El estado de "En Línea" indica que el pool está saludable.

source: If you right-click the pool name, the following options are available:
es: Si hace clic derecho en el nombre del pool, las siguientes opciones están disponibles:

source: **Create new pool:** use this option if additional disks are available and you would like to create another pool instead of adding them to the existing pool. This will open a screen that allows you to name the new pool, select which additional disks will go into it, and select how to configure the disks.
es: **Crear un nuevo pool:** use esta opción si hay disponibles discos adicionales y le gustaría crear otro pool en vez de añadirlos al pool existente. Esto abrirá una pantalla que le permitirá nombrar el nuevo pool, seleccionar qué discos adicionales irán en él, y seleccionar cómo configurar los discos.

source: **Rename pool:** will prompt you to input the new name for the pool.
es: **Renombrar pool:** le pedirá que introduzca el nombre nuevo para el pool.

source: **Destroy pool:** **do not select this option unless your intent is to destroy all of the data on the disks!**
es: **Destruir pool:** **no seleccione esta opción a menos que su intención sea destruir todos los datos en los discos!**

source: **Add devices:** depending upon the type of disk configuration, you may be able to extend the size of the pool by adding an equal number of disks.
es: **Añadir dispositivos:** dependiendo del tipo de configuración de disco, puede ser capaz de extender el tamaño del pool añadiendo un número igual de discos.

source: **Add log devices:** used to add an SSD or disk as a secondary ZIL.
es: **Añadir dispositivos de log:** usado para añadir un SSD o disco como un ZIL secundario.

source: **Add cache devices:** used to add an SSD or disk as an L2ARC.
es: **Añadir dispositivos caché:** usado para añadir un SSD o disco como un L2ARC.

source: **Add spare devices:** at this time, FreeBSD does not support hot spares.
es: **Añadir dipositivos de reserva:** hasta ahora, FreeBSD no soporta repuestos en caliente (hot spares).

source: **Scrub:** will start a ZFS scrub now. This option can be I/O intensive so it isn't recommended to do this while the system is in use.
es: **Scrub:** iniciará un scrub ZFS ahorna. Esta opción puede ser muy intensiva en recursos I/O de manera que no se recomienda que se haga mientras el sistema está en uso.

source: **Export pool:** this action should be performed if you will be physically moving the disks from one system to another.
es: **Exportar pool:** esta acción debería realizarse si va a mover físicamente los discos de un sistema a otro.

source: **Properties:** used to manage the default properties of the pool. Datasets inherit the default properties, unless a property is set to a different value on the dataset.
es: **Propiedades:** se utiliza para administrar las propiedades predeterminadas del pool. Los datasets heredan las propiedades predeterminadas, a menos que una propiedad se haya establecido a un valor diferente en el dataset.

source: If you right-click a disk entry, such as *ada0p2* in this example, the following options are available:
es: Si hace clic derecho en una entrada de disco, tal como *ada0p2* en este ejemplo, estarán disponibles las siguientes opciones:

source: **Attach (mirror) device:** if you wish to mirror additional disk(s), this option will open a screen which allows you to specify the disk(s) to add.
es: **Añadir dispositivo (mirror):** si desea hacer mirror con discos adicionales, esta opción abrirá una pantalla que le permitirá especificar el disco que se añadirá.

source: **Take offline:** if you need to replace a bad disk, select this option before physically removing the disk.
es: **Desconectar:** si necesita reemplazar un disco dañado, seleccione esta opción antes de extraer físicamente el disco.

source: An example of the "Disks" tab is seen in :numref:`Figure %s: Managing Disks <disk5>`.
es: Un ejemplo de la pestaña "Discos" se muestra en la :numref:`Figura %s: Administrando Discos <disk5>`.

source: This screen shows the size of each disk as well as its partitioning scheme. If an unformatted disk or free disk space is available, right-click the device to format it.
es: Esta pantalla muestra el tamaño de cada disco así como su esquema de particiones. Si un disco no formateado o con espacio libre está disponible, haga clic derecho en el dispositivo para formatearlo.

source: Display
es: Pantalla

source: :menuselection:`Control Panel --> Display` can be used to configure the system to run the display wizard the next time the system boots. This allows you to reconfigure your video driver and display settings.
es: :menuselection:`Panel de Control --> Pantalla` se puede usar para configurar el sistema para que arranque el asistente de pantalla la próxima vez que el sistema inicie. Esto le permite reconfigurar su controlador de video y las configuraciones de la pantalla.

source: if you have an NVIDIA card, double-check that "pcbsd-meta-nvidia" is installed in :ref:`AppCafe®` and install it if it is not. To check for this driver, search for "nvidia" in the "App Search" tab of AppCafe®.
es: Si tiene una tarjeta NVIDIA, asegúrese de que "pcbsd-meta-nvidia" está instalado en :ref:`AppCafe®` e instálelo si no es así. Para comprobar si está este controlador, busque "nvidia" en la pestaña "Búsqueda de Aplicaciones" de AppCafe®.

source: If you click this icon in Control Panel, you will receive the message shown in :numref:`Figure %s: Display Wizard Will Run at Next Boot <display2>`.
es: Si presiona este icono en el Panel de Control, recibirá el mensaje mostrado en la :numref:`Figura %s: El Asistente de Pantalla se Ejecutará en el Siguiente Inicio <display2>`.

source: Select "Yes" which will prompt for your password. You should then save your work and reboot the system.
es: Seleccione "Sí", lo cuál solicitará su contraseña. A continuación deberá guardar su trabajo y reiniciar el sistema.

source: Alternately, you can use the boot menu to start the display wizard. As soon as the system starts to boot, press the left :kbd:`Shift` button to access the GRUB boot menu. Unless you are dual booting or have configured boot environments, there will be one entry named "PC-BSD (default)" in the boot menu. Press :kbd:`Enter` and select "Run the Display Wizard" from the menu.
es: Alternativamente, puede utilizar el menú de arranque para iniciar el asistente de pantalla. Tan pronto como el sistema inicie el arranque, presione la tecla :kbd:`Mayúsculas` izquierda para acceder al menú de arranque de GRUB. A menos que tenga arranque dual o tenga configurados BEs, habrá una entrada denominada "PC-BSD (default)" en el menú de arranque. Presione :kbd:`Intro` y seleccione "Ejecutar el Asistente de Pantalla" en el menú.

source: Regardless of whether you started the Display Wizard from Control Panel or from the boot menu, it will finish booting the system and then prompt you to confirm the resolution if it finds an optimal one. To configure a different resolution, click "No" to access the display wizard, shown in :numref:`Figure %s: Display Settings Wizard <display3>`.
es: Sin importar desde donde inició el Asistente de Pantalla, si fue el Panel de Control o el menú de arranque, terminará de iniciar el sistema y le pedirá confirmar la resolución si encuentra una óptima. Para configurar una resolución diferente, presione "No" para accesar el asistente de pantalla, mostrado en la :numref:`Figura %s: Asistente de Configuraciones de Pantalla <display3>`.

source: This screen can be used to select the desired screen resolution, color depth, and video driver. If you select the "vesa" driver, it will always work but will provide sub-optimal performance. Click on the drop-down menu to select the driver that most closely matches your video card name.
es: Esta pantalla puede usarse para seleccionar la resolución de pantalla deseada, profundidad de color, y controlador de video. Si selecciona el controlador "vesa", siempre funcionará pero no proporcionará un rendimiento óptimo. Presione en el menú desplegable para seleccionar el controlador que más se parezca al nombre de su tarjeta gráfica.

source: You can also use the drop-down menus to change the screen resolution and color depth values. If the value you desire is not listed, it may be the selected driver does not support that resolution or depth.
es: También puede utilizar los menús desplegables para cambiar los valores de resolución de la pantalla y de profundidad de color. Si el valor deseado no está listado, puede ser que el controlador seleccionado no soporte esa resolución o profundidad.

source: Advanced users can select their monitor's horizontal sync and vertical refresh rate in the "Advanced" tab, seen in :numref:`Figure %s: Advanced Tab of Display Settings <display4>`.
es: Los usuarios avanzados pueden seleccionar la sincronización horizontal y el refresco vertical de su monitor en la pestaña "Avanzado", mostrada en la :numref:`Figura %s: Pestaña Avanzado de la Configuración de Pantalla <display4>`.

source: Use caution and refer to your monitor's documentation if you make any changes here. If you are not sure what you are doing, leave the default values as-is.
es: Sea cuidadoso y consulte la documentación de su monitor si hace algún cambio aquí. Si no está seguro de lo que está haciendo, deje los valores predeterminados como están.

source: If your computer is connected to two monitors, check the box "Enable Dual-Head support".
es: Si su equipo está conectado a dos monitores, marque la casilla "Habilitar soporte para Dual-Head".

source: When you are finished, click the "Apply" button for your settings to be tested. If anything goes wrong during testing, you should be taken back to the "Display Settings" screen so that you can try another setting. Once you are satisfied with the settings, click "Yes" when prompted to accept them.
es: Cuando termine, presione el botón "Aplicar" para que sus ajustes sean probados. Si algo va mal durante la prueba, debería volver a la pantalla de "Configuración de Pantalla" de manera que pueda probar otros ajustes. Una vez que esté satisfecho con los ajustes, presione "Sí" cuando se le pida aceptarlos.

source: Desktop Effects and Compositing
es: Efectos de Escritorio y Composición

source: To prevent problems with video cards that do not support them, desktop effects (used by KDE) and display compositing (used by XFCE) are disabled by default. You can change this default if your video card supports desktop effects.
es: Para evitar problemas con las tarjetas de video que no los soporten, los efectos de escritorio (usados por KDE) y la composición de pantalla (usada por XFCE) están deshabilitados por defecto. Puede cambiar esta configuración predeterminada si su tarjeta gráfica soporta efectos de escritorio.

source: To enable desktop effects while logged into KDE, click :menuselection:`Favorites --> System Settings --> Desktop Effects` to access the configuration screen shown in :numref:`Figure %s: Enabling Desktop Effects in KDE <display5>`. Check the box "Enable desktop effects at startup". You can use the "All Effects" tab to get more information about each possible effect and to enable the effects that interest you.
es: Para habilitar los efectos de escritorio mientras esté en KDE, presione :menuselection:`Favoritos --> Configuraciones del Sistema --> Efectos de Escritorio` para accesar la configuración de pantalla mostrada en la :numref:`Figura %s: Habilitando los Efectos de Escritorio en KDE <display5>`. Seleccione la casilla "Habilitar efectos de escritorio al iniciar". Puede usar la pestaña "Todos los Efectos" para obtener más información sobre cada uno de los posibles efectos y para habilitar los efectos que le interesen.

source: To enable display compositing while logged into XFCE, go to :menuselection:`Settings --> Window Manager Tweaks --> Compositor`. In the screen shown in :numref:`Figure %s: Enabling Compositing in XFCE <display6>`, check the "Enable display compositing" box to enable the compositing options.
es: Para habilitar la composición de la pantalla mientras está en XFCE, vaya a :menuselection:`Configuraciones --> Ajustes del Gestor de Ventanas --> Compositor`. En la pantalla mostrada en la :numref:`Figura %s: Habilitando la Composición en XFCE <display6>`, seleccione la casilla "Habilitar la composición de pantalla" para habilitar las opciones de composición.

source: Display Troubleshooting
es: Solucionando problemas de la Pantalla

source: If you are having problems with your display settings and would like to manually edit :file:`/etc/X11/xorg.conf` or run :command:`Xorg --config`, first tell the PC-BSD® system to not automatically start X. To do so, add this temporary line to :file:`/etc/rc.conf`, then reboot the system::
es: Si está teniendo problemas con su configuración de pantalla y le gustaría editar manualmente :file:`/etc/X11/xorg.conf` o ejecutar :command:`Xorg --config`, dígale primero al sistema PC-BSD® que no inicie las X automáticamente. Para ello, añada esta línea temporal en :file:`/etc/rc.conf`, y después reinicie el sistema::

source: The system will reboot to a login prompt. After logging in, try the instructions in the `FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/x-config.html>`_ to manually configure and test Xorg. Once you have a configuration that works for you, save it to :file:`/etc/X11/xorg.conf`. Then, remove that temporary line from :file:`/etc/rc.conf` and start PCDM::
es: El sistema reiniciará en modo línea de comandos. Después de conectarse, pruebe las instrucciones del `Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/x-config.html>`_ para configurar manualmente y probar Xorg. Una vez que tenga una configuración que funcione para usted, guárdela en :file:`/etc/X11/xorg.conf`. Después, elimine esa línea temporal de :file:`/etc/rc.conf` e inicie PCDM::

source: If your graphics white-out after a suspend or resume, try running this command as the superuser::
es: Si su pantalla gráfica se vuelve blanca tras una suspensión o reanudación, pruebe a ejecutar este comando como administrador::

source: If that fixes the problem, carefully add this line to :file:`/etc/sysctl.conf`::
es: Si eso soluciona el problema, añada con cuidado esta línea a :file:`/etc/sysctl.conf`::

source: If the monitor goes blank and does not come back, try running this command as your regular user account::
es: Si el monitor se pone en negro y no se recupera, pruebe a ejecutar este comando desde su cuenta de usuario normal::

source: If that fixes the problem, add that line to the :file:`.xprofile` file in your home directory.
es: Si esto soluciona el problema, añada esta línea al archivo :file:`.xprofile` de su directorio personal.

source: Mount Tray
es: Bandeja de Montaje

source: The Mount Tray graphical application is used to facilitate the mounting and unmounting of filesystems on internal disks, USB storage devices, and optical media. It is included in the system tray, meaning that in can be used within any window manager that provides a system tray. If you remove the icon from the system tray, you can re-add it using :menuselection:`Control Panel --> Mount Tray` or by typing :command:`pc-mounttray &`.
es: La aplicación gráfica de la Bandeja de Montaje se usa para facilitar el montaje y desmontaje de sistemas de archivos en discos internos, los dispositivos de memoria USB, y los medios ópticos. Se incluye en la bandeja del sistema, lo que significa que se puede usar desde cualquier gestor de ventanas que proporcione una bandeja del sistema. Si elimina el icono de la bandeja del sistema, puede añadirlo de nuevo usando :menuselection:`Panel de control --> Bandeja de Montaje` o escribiendo :command:`pc-mounttray &`.

source: if you prefer to mount devices from the command line, see the section on :ref:`pc-sysconfig`.
es: Si prefiere montar dispositivos desde la línea de comandos, vea la sección sobre :ref:`pc-sysconfig`.

source: In the example shown in :numref:`Figure %s: Mount Tray Example <mount1>`, a USB device and a music CD are currently inserted and the user has clicked "More Options" to view the available options.
es: En el ejemplo mostrado en la :numref:`Figura %s: Ejemplo de Bandeja de Montaje <mount1>`, un dispositivo USB y un CD de música están actualmente insertados y el usuario ha presionado "Más Opciones" para ver las opciones disponibles.
