Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: If you still have problems with sound, see the section on :ref:`Finding Help` to determine which help resources are available. When reporting your problem, include your version of PC-BSD® and the name of your sound card.
es: Si todavía tiene problemas con el sonido, vea la sección sobre :ref:`Buscando Ayuda` para determinar qué recursos de ayuda están disponibles. Cuando reporte su problema, incluya su versión de PC-BSD® y el nombre de su tarjeta de sonido.

source: Printing
es: Imprimiendo

source: Like many open source operating systems, PC-BSD® uses the Common Unix Printing System (`CUPS <http://cups.org/>`_) to manage printing. Control Panel provides a graphical front-end for adding and managing printers.
es: Como muchos sistemas operativos de código abierto, PC-BSD® emplea el Sistema de Impresión Común de Unix (`CUPS <http://cups.org/>`_) para administrar la impresión. El Panel de Control proporciona un front-end gráfico para añadir y administrar impresoras.

source: While the graphical utility is easy to use, it may or may not automatically detect your printer depending upon how well your printer is supported by an open source print driver. This section will walk you through a sample configuration for a HP Officejet 4500 printer. Your printer may "just work", allowing you to breeze through the configuration screens. If your printer configuration does not work, read this section more closely for hints on how to locate the correct driver for your printer.
es: Mientras que la utilería gráfica es fácil de usar, puede que detecte automáticamente, o no, su impresora dependiendo de lo bien que esté soportada por un controlador de impresión de código abierto. Esta sección le llevará a través de un ejemplo de configuración para una impresora HP Officejet 4500. Su impresora puede "simplemente funcionar", permitiéndole dar solo un paseo por las pantallas de configuración. Si la configuración de su impresora no funciona, lea con más detalle esta sección para encontrar pistas sobre cómo localizar el controlador correcto para su impresora.

source: Researching your Printer
es: Buscando su Impresora

source: Before configuring your printer, it is worth the time to see if a print driver exists for your particular model, and if so, which driver is recommended. If you are planning to purchase a printer, this is definitely good information to know beforehand. You can look up the vendor and model of the printer in the `Open Printing Database <http://www.openprinting.org/printers>`_ which will indicate if the model is supported and if there are any known caveats with the print driver.
es: Antes de configurar su impresora, merece la pena tomar un tiempo para ver si existe un controlador de impresión para su modelo particular, y si es así, qué controlador se recomienda. Si está planeando comprar una impresora, ésta es definitivamente una buena información para saber de antemano. Puede buscar el proveedor y el modelo de la impresora en la `Base de Datos de Impresión Abierta <http://www.openprinting.org/printers>`_, la cual le indicará si el modelo está soportado y si hay algún detalle con el controlador de impresión.

source: :numref:`Figure %s: Using Open Printing Database to Locate a Driver <print1>` shows a search for our example printer. There are two models in this series and this particular hardware supports wireless.
es: La :numref:`Figura %s: Usando la Base de Datos de Impresión Abierta para Localizar un Controlador <print1>` muestra una búsqueda para nuestra impresora de ejemplo. Hay dos modelos en estas series y este hardware en particular soporta conexión inalámbrica.

source: Once the model is selected, click on the "Show this printer" button to see the results, as demonstrated in :numref:`Figure %s: Driver Recommendation from Open Printing Database <print2>`.
es: Una vez que el modelo es seleccionado, presione en el botón "Mostrar esta impresora" para ver los resultados, como se demuestra en la :numref:`Figura %s: Recomendación de Controlador de la BD de Impresión Abierta <print2>`.

source: For this model, the HPLIP driver is recommended. In PC-BSD®, the HPLIP driver is available as an optional system component called "pcbsd-meta-hplip". You can see if the driver is installed, and install it if it is not, using :ref:`AppCafe®`.
es: Para este modelo, se recomienda del controlador HPLIP. En PC-BSD®, el controlador HPLIP está disponible como un componente opcional del sistema denominado "pcbsd-meta-hplip". Puede ver si el controlador está instalado, e instalarlo si no lo está, usando :ref:`AppCafe®`.

source: Adding a Printer
es: Añadiendo una Impresora

source: Once you know that your printer is supported, make sure that the printer is plugged into your computer or, if the printer is a network printer, that both your computer and the printer are connected to the network. Then, go to :menuselection:`Control Panel --> Printing` or type :command:`pc-su pc-cupscfg`. Input your password to see a window similar to :numref:`Figure %s: Printer Configuration Utility <print4>`.
es: Una vez que sabe que la impresora está soportada, asegúrese que la impresora está conectada a la computadora o, si la impresora es una impresora de red, que tanto su equipo como la impresora están conectados a la red. Entonces, vaya a :menuselection:`Panel de Control --> Impresión` o ingrese :command:`pc-su pc-cupscfg`. Introduzca su password para ver una ventana similar a la de la :numref:`Figura %s: Utilería de Configuración de la Impresora <print4>`.

source: To add a new printer, click the "+Add" button. The printing utility will pause for a few seconds as as the wizard searches to see if any printers are connected to your computer or network. When it is finished, you should see a screen similar to :numref:`Figure %s: Select a Print Device <print5>`.
es: Para añadir una nueva impresora, presione el botón "+Add". La utilería de impresión se pausará por unos segundos ya que el asistente busca si hay impresoras conectadas a su equipo o red. Cuando termina, debería ver una pantalla similar a la de la :numref:`Figura %s: Seleccionando un Dispositivo de Impresión <print5>`.

source: In this example, the wizard has found this printer and highlighted the entry for the HP OfficeJet 4500. To also install the fax capability, instead select the driver which includes "HP Fax". The wizard should find any supported printer that is attached to the computer or network and list it as the highlighted entry in the "Devices" frame. Click "Forward" and the wizard will attempt to load the correct driver for the device. If it is successful, it will display the screen shown in :numref:`Figure %s: Describe Printer Screen <print6>`. If it does not automatically find your printer, read the section on :ref:`Printer Troubleshooting`.
es: En este ejemplo, el asistente ha encontrado esta impresora y seleccionado la entrada para la HP OfficeJet 4500. Para también instalar la capacidad de fax, en su lugar seleccione el controlador que incluye "HP Fax". El asistente debería buscar cualquier impresora soportada que esté conectada al equipo o red y listarla como la entrada seleccionada en el marco "Dispositivos". Presione "Adelante" y el asistente intentará cargar el controlador correcto para este dispositivo. Si tiene éxito, mostrará la pantalla mostrada en la :numref:`Figura %s: Pantalla de Descripción de Impresora <print6>`. Si no encuentra automáticamente su impresora, lea la sección sobre :ref:`Problemas con la Impresora`.

source: Since the configuration wizard found this printer, the "Describe Printer" screen automatically fills out the printer model series, a description, and the hostname of your computer, if the printer is locally attached, or the hostname of the network printer. If you wish, you can change the printer's name or description. Once you click the "Apply" button, the wizard will ask if you would like to print a test page. Ensure the printer has paper and click "Yes" to print the test page. If you can not print a successful test page, see the :ref:`Printer Troubleshooting` section.
es: Ya que el asistente de configuración encontró esta impresora, la pantalla "Describir Impresora" rellenará automáticamente la serie del modelo de impresora, y el nombre de su ordenador, si la impresora está conectada localmente, o el nombre de la impresora de red. Si lo desea puede cambiar el nombre o la descripción de la impresora. Una vez que haga clic en el botón "Aplicar" el asistente le preguntará si quiere imprimir una página de prueba. Asegúrese de que la impresora tiene papel y haga clic en "Sí" para imprimirla. Si no puede imprimir un página de prueba satisfactoriamente vea la sección :ref:`Problemas con la Impresora`.

source: Once the printer is created, a screen will open where you can set the properties of the printer. Our sample printer's properties screen is shown in :numref:`Figure %s: Viewing the Settings of the Newly Created Printer <print7>`.
es: Una vez que la impresora es creada, una pantalla se abrirá donde puede establecer las propiedades de la impresora. La pantalla de propiedades de nuestra impresora de ejemplo se muestra en la :numref:`Figura %s: Viendo la Configuración de la Recién Creada Impresora <print7>`.

source: You may wish to take a few minutes to review the settings in the "Policies", "Access Control", "Printer Options", and "Job Options" tabs as these allow you to configure options such as print banners, permissions, the default paper size, and double-sided printing. The available settings will vary, depending upon the capabilities of the print driver.
es: Puede que desee emplear unos minutos para revisar la configuración en las pestañas "Políticas", "Control de Accesos", "Opciones de la Impresora", y "Opciones de los Trabajos" ya que éstas le permitirán configurar opciones tales como banners de impresión, permisos, el tamaño de papel por defecto, e impresión a doble lado. Las configuraciones disponibles variarán, dependiendo de las posibilidades del controlador de impresión.

source: Manually Adding a Driver
es: Añadiendo Manualmente un Controlador

source: If the print configuration wizard fails, double-check that the printer is supported as described in :ref:`Researching your Printer` and that HPLIP is installed if it is a HP printer. Also check that the printer is plugged in and powered on.
es: Si el asistente de configuración de la impresora falla, compruebe de nuevo que la impresora está soportada como se describe en :ref:`Buscando su Impresora` y que HPLIP está instalado si es una impresora HP. También compruebe que la impresora está conectada y encendida.

source: If the wizard is unable to even detect the device, try to manually add the print device. In the "Select Device" screen (:numref:`Figure %s: Select a Print Device <print5>`) you will need to highlight and configure the type of connection to the printer:
es: Si el asistente no puede ni siquiera detectar el dispositivo, intente añadir manualmente el dispositivo de impresión. En la pantalla "Seleccionar Dispositivo" (:numref:`Figura %s: Seleccionando un Dispositivo de Impresión <print5>`) necesitará seleccionar y configurar el tipo de conexión a la impresora:

source: **USB:** this entry will only appear if a printer is plugged into a USB port and the number of entries will vary depending upon the number of USB ports on the system. If there are multiple USB entries, highlight the one that represents the USB port your printer is plugged into.
es: **USB:** esta entrada sólo aparecerá si una impresora está conectada a un puerto USB y el número de entradas variará dependiendo del número de puertos USB en el sistema. Si hay múltiples entradas USB, seleccione aquella que represente el puerto USB en el que su impresora está conectada.

source: **Enter URI:** this option allows you to manually type in the URI to the printer. A list of possible URIs is available on the `cups site <http://www.cups.org/documentation.php/network.html>`_.
es: **Introducir URI:** esta opción le permite escribir manualmente la URI a la impresora. Una lista de posibles URIs está disponible en el `sitio de cups <http://www.cups.org/documentation.php/network.html>`_.

source: **AppSocket/HP JetDirect:** select this option if you are connecting to an HP network printer. You will need to input the IP address of the printer in the "Host" field. Only change the port number if the printer is using a port other than the default of 9100.
es: **AppSocket/HP JetDirect:** seleccione esta opción si está conectándose a una impresora de red HP. Necesitará introducir la dirección IP de la impresora en el campo "Host". Cambie sólo el número del puerto si la impresora está usando un puerto distinto al predeterminado 9100.

source: **IPP:** select this option if you are connecting to a printer cabled to another computer (typically running a Microsoft operating system) that is sharing the printer using IPP. You will need to input the IP address of the printer in the "Host" field and the name of the print queue. You can then click the "Verify" button to ensure that you can connect to the print queue.
es: **IPP:** seleccione esta opción si se está conectando a una impresora que está conectada a otro equipo (típicamente corriendo un sistema operativo Windows) el cual está compartiendo la impresora usando IPP. Necesitará introducir la dirección IP de la impresora en el campo "Host"y el nombre de la cola de impresión. Después puede presionar el botón "Verificar" para asegurarse de que puede conectarse a la cola de impresión.

source: **LPD/LPR:** select this option if you are connecting to a printer which is cabled to a Unix computer that is using LPD to share the printer. You will need to select the hostname and queue name from the drop-down menus.
es: **LPD/LPR:** seleccione esta opción si se está conectando a una impresora que está conectada a un equipo Unix que está usando LPD para compartir la impresora. Necesitará seleccionar el nombre del equipo y la cola de impresión desde los menús desplegables.

source: Once you have input the information for the type of printer, press "Forward" for the wizard to continue.
es: Una vez que haya ingresado la información para el tipo de impresora, presione "Adelante" para que el asistente continúe.

source: If the wizard is able to find the printer but is unable to locate the correct driver for the printer, it will display the screen shown in :numref:`Figure %s: Manually Select the Manufacturer <print8>` instead of the "Describe Printer" screen.
es: Si el asistente es capaz de encontrar la impresora pero no puede localizar el controlador correcto para la impresora, desplegará la pantalla mostrada en la :numref:`Figura %s: Seleccionando Manualmente el Fabricante <print8>` en vez de la pantalla "Descripción de Impresora".

source: Select the manufacturer name and then click "Forward" to select the model, as seen in the example in :numref:`Figure %s: Manually Select the Driver <print9>`.
es: Seleccione el nombre del fabricante y presione "Adelante" para seleccionar el modelo, como se muestra en el ejemplo en la :numref:`Figura %s: Seleccionado el Controlador Manualmente <print9>`.

source: Click "Forward" and the wizard should continue to the "Describe Printer" screen.
es: Presione "Adelante" y el asistente debería continuar a la pantalla "Descripción de Impresora".

source: If the selected driver does not work, go back to the "Choose Driver" screen shown in :numref:`Figure %s: Manually Select the Manufacturer <print8>`. This screen provides two additional options for installing the driver:
es: Si el controlador seleccionado no funciona, regrese a la pantalla "Seleccionar Controlador" mostrada en la :numref:`Figura %s: Seleccionando Manualmente el Fabricante <print8>`. Esta pantalla proporciona dos opciones adicionales para instalar el controlador:

source: **Provide PPD file:** a PostScript Printer Description (PPD) is a driver created by the manufacturer that ends in a :file:`.ppd` extension. Sometimes the file will end with a :file:`.ppd.gz` extension, indicating that it has been compressed with :command:`gzip`. If the driver you need was not automatically found, see if there is a PPD file on the driver CD that came with the printer or if one is available for download from the manufacturer's website. If you find a PPD, select this option and browse to the location of that file. Then, click "Forward" to continue with the printer configuration.
es: **Proporcionar archivo PPD:** un PPD (Descripción de Impresora PostScript) es un controlador creado por el fabricante que termina con una extensión :file:`.ppd`. Algunas veces el archivo termina con una extensión :file:`.ppd.gz`, indicando que ha sido comprimido con :command:`gzip`. Si el controlador que usted necesita no se ha encontrado automáticamente, vea si hay un archivo PPD en el CD de controladores que viene con la impresora o si hay uno disponible para descargar desde el sitio web del fabricante. Si encuentra un PPD, seleccione esta opción y examine la localización de ese archivo. Después, presione "Adelante" para continuar con la configuración de la impresora.

source: **Search for a printer driver to download:** if you know the name of the driver that you are looking for, try typing its name or number into the "Search" box. If found, it will display in the "Printer" model drop-down menu.
es: **Buscar un controlador de impresora para descargar:** si sabe el nombre del controlador que está buscando, pruebe ingresando su nombre o número en el recuadro "Buscar". Si lo encuentra, se mostrará en el menú desplegable del modelo de la "Impresora".

source: Printer Troubleshooting
es: Problemas con la Impresora

source: Here are some solutions to common printing problems:
es: Aquí hay algunas soluciones para problemas comunes de impresión:

source: **A test page prints but it is all garbled:** this typically means that you are using the wrong driver. If your specific model was not listed, click the "Change" button in the "Driver Details" section of the "Settings" tab of the printer and try choosing another driver model that is close to your model number. If trial and error does not fix the problem, see if there are any suggestions for your model in the `Open Printing database <http://www.openprinting.org/printers>`_. A web search for the word "freebsd" followed by the printer model name may also help you to find the correct driver to use.
es: **Se imprime una página de prueba pero todo está ilegible:** esto típicamente significa que está utilizando el controlador equivocado. Si su modelo específico no estaba listado, presione el botón "Cambiar" en la sección "Detalles del Controlador" de la pestaña "Configuración" de la impresora y pruebe eligiendo otro modelo de controlador que esté próximo al número de su modelo. Si esta prueba y error no arregla el problema, vea si hay alguna sugerencia para su modelo en la `Base de Datos de Impresión Abierta <http://www.openprinting.org/printers>`_. Una búsqueda en la web de la palabra "freebsd" seguida del modelo de la impresora también puede ayudar a encontrar el controlador correcto para usar.

source: **Nothing happens when you try to print:** in this case, type :command:`tail -f /var/log/cups/error_log` in a console and then print a test page. The error messages should appear in the console. If the solution is not obvious from the error messages, try a web search for the error message. If you are still stuck, post the error, the model of your printer, and your version of PC-BSD® using the :ref:`Report a Bug` tool.
es: **No sucede nada cuando intenta imprimir:** en este caso, escriba :command:`tail -f /var/log/cups/error_log` en una consola y después imprima una página de prueba. Los mensajes de error deberían aparecer en la consola. Si la solución no es obvia a partir de los mensajes de error, pruebe una búsqueda en la web de los mensajes de error. Si aún está atascado, publique el error, el modelo de su impresora, y su versión de PC-BSD® usando la utilería :ref:`Informar de un Error`.

source: Scanner
es: Escáner

source: Control Panel provides an icon for accessing `XSane <http://www.xsane.org/>`_, a graphical utility for managing scanners.
es: El Panel de Control proporciona un icono para accesar a `XSane <http://www.xsane.org/>`_, una utilería gráfica para administrar escáneres.

source: To use your scanner, make sure the device is plugged into the PC-BSD® system and click the "Scanner" icon in Control Panel or type :command:`xsane` from the command line. A pop-up message will indicate that XSane is detecting devices and will prompt you to accept the XSane license if a device is detected. If a device is not detected, search for your device at the `list of supported scanners <http://www.sane-project.org/sane-backends.html>`_.
es: Para usar su escáner, asegúrese de que el dispositivo está conectado al sistema PC-BSD® y presione el icono de "Escáner" en el Panel de Control o escriba :command:`xsane` en la línea de comandos. Un mensaje emergente le indicará que XSane está detectando dispositivos y le pedirá que acepte la licencia de XSane si un dispositivo es detectado. Si un dispositivo no es detectado, busque su dispositivo en la `lista de escáneres soportados <http://www.sane-project.org/sane-backends.html>`_.

source: if the scanner is part of an HP All-in-One device, make sure that the "pcbsd-meta-hplip" package is installed. You can see if the driver is installed, and install it if it is not, using :ref:`AppCafe®`.
es: Si el escáner es parte de un dispositivo Multifuncional HP, asegúrese que el paquete "pcbsd-meta-hplip" está instalado. Puede ver si el controlador está instalado, e instalarlo si no lo está, usando :ref:`AppCafe®`.

source: :numref:`Figure %s: XSane Interface <sane>` shows the XSane interface running on a PC-BSD® system attached to an HP OfficeJet.
es: La :numref:`Figura %s: Interfaz de XSane <sane>` muestra la interfaz de XSane corriendo en un sistema PC-BSD® conectado a una HP OfficeJet.

source: The `XSane documentation <http://www.xsane.org/doc/sane-xsane-doc.html>`_ contains details on how to perform common tasks such as saving an image to a file, photocopying an image, and creating a fax. It also describes all of the icons in the interface and how to use them.
es: La `Documentación de XSane <http://www.xsane.org/doc/sane-xsane-doc.html>`_ contiene detalles sobre cómo realizar tareas comunes tales como guardar una imagen a un archivo, fotocopiar una imagen, y crear un fax. También describe todos los iconos en la interfaz y cómo usarlos.

source: By default, XSane uses the default browser when you click :kbd:`F1` to access its built-in documentation. How to configure the default browser varies by window manager so you may need to do an Internet search if you need to set that configuration setting and can not find it.
es: Por defecto, XSane emplea el navegador predeterminado cuando presiona :kbd:`F1` para accesar a su documentación incorporada. La manera de configurar el navegador depende del gestor de ventanas, así que necesitará hacer una búsqueda en Internet si necesita establecer dicha configuración y no la puede encontrar.

source: Firewall Manager
es: Administrador del Cortafuegos
