Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: In addition to replicating to a remote server, the :command:`lpreserver` command also provides a method for attaching a new disk drive to an existing ZFS pool, and live-mirroring all data to that disk as data changes on the pool. The attached disk drive can be another internal disk or an external USB disk. When the new disk is attached for the first time, it will be erased and used solely as a mirror of the existing system drive. In addition, it will be made bootable, allowing you to boot from and use the new disk should the primary disk fail. In order to use this feature you will need the following:
es: Además de la replicación a un servidor remoto, el comando :command:`lpreserver` también proporciona un método para conectar un nuevo disco a un pool ZFS existente, y copiar en vivo todos los datos a ese disco mientras los datos cambian en el pool. El disco conectado puede ser otro disco interno o un disco USB externo. Cuando el nuevo disco es conectado por primera vez, será borrado y usado solamente como un espejo del disco existente del sistema. Además, se hará arrancable, permitiendole inicar desde él y usar el nuevo disco por si el disco primario falla. Para usar esta característica necesitará lo siguiente:

source: an internal or external disk drive that is the same size or larger than the existing system disk.
es: Un disco interno o externo que tenga la misma o mayor capacidad que el disco existente del sistema.

source: since the disk will be formatted, it must be either blank or not have any data that you wish to keep intact.
es: Ya que el disco será formateado, debe estar o bien en blanco o no tener ningún dato que desee conservar intacto.

source: in order to boot from the disk should the primary disk fail, the system must support booting from the new disk. For example, if you are using a USB disk, make sure that the BIOS is able to boot from a USB disk.
es: Para arrancar desde el disco, si el disco primario falla, el sistema debe suportar el arranque desde el nuevo disco. Por ejemplo, si está usando un disco USB, asegúrese de que la BIOS es capaz de arrancar desde un disco USB.

source: The superuser can setup the new disk using the following command. Replace *tank1* with the name of your ZFS pool and */dev/da0* with the name of the disk to format. For example, the first USB disk will be */dev/da0* and the second internal hard disk will be */dev/ad1*::
es: El administrador puede configurar el nuevo disco usando el siguiente comando. Sustituya *tank1* con el nombre de su pool ZFS y */dev/da0* con el nombre del disco que se formateará. Por ejemplo, el primer disco USB será */dev/da0* y el segundo disco duro interno será */dev/ad1*::

source: When the disk is first attached, it will be formatted with ZFS and configured to mirror the size of the existing disk. GRUB will also be stamped on the new disk, making it bootable should another drive in the array go bad. You can add multiple disks to the pool in this manner, giving any level of redundancy that you require.
es: Cuando el disco se conecta por primera vez, será formateado con ZFS y se configurará para hacer un espejo del tamaño del disco existente. GRUB también se estampará en el nuevo disco, permitiéndole arrancar en caso de que otro disco en el arreglo vaya mal. Puede añadir múltiples discos al pool de esta manera, dando cualquier nivel de redundancia que usted requiera.

source: Once the disk is attached, it will begin to resilver. This process mirrors the data from the primary disk to the newly attached disk. This may take a while, depending upon the speed of the disks and system load. Until this is finished you should not reboot the system, or detach the disk. You can monitor the resilvering process by typing :command:`zpool status`.
es: Una vez que el disco está conectado, empezará el resilver. Este proceso hace un copia de los datos del disco primario al disco nuevo conectado. Esto puede llevar un rato, dependiendo de la velocidad de los discos y la carga del sistema. Hasta que esto haya terminado no debería reiniciar el sistema, o desconectar el disco. Puede monitorizar el proceso de resilvering escribiendo :command:`zpool status`.

source: To get a listing of the disks in your mirror, run this command, replacing *tank1* with the name of the pool::
es: Para conseguir un listado de los discos en su mirror, ejecute este comando, reemplazando *tank1* con el nombre del pool::

source: If you are using an external drive, there may be occasions where you wish to disconnect the backup drive, such as when using a laptop and going on the road. In order to so this safely, it is recommended that you first offline the external disk using the following command::
es: Si está usando un disco externo, puede haber ocasiones donde desee desconectar el disco de respaldo, como cuando esté usando una laptop y salga a carretera. Para hacer esto de manera segura, se recomienda que ponga fuera de línea el disco externo usando el siguiente comando::

source: Then when you re-connect the drive, you can place it in online mode again using::
es: Después, cuando reconecte el disco, puede colocarlo en línea otra vez usando::

source: Sometimes, the disk name will change as a result of being disconnected. The :command:`lpreserver zpool list tank1` command can be used to get the proper device ID.
es: Algunas veces el nombre del disco cambia como resultado de ser desconectado. El comando :command:`lpreserver zpool list tank1` se puede usar para obtener el ID apropiado del dispositivo.

source: If you wish to permanently remove a disk from the mirror, run the following command. If you decide to re-attach this disk later, a full disk copy will again have to be performed::
es: Si desea extraer permanentemente un disco del mirror, ejecute el siguiente comando. Si decide reconectar este disco después, se tendrá que realizar otra vez una copia completa del disco::

source: in addition to working with mirrors, the :command:`lpreserver zpool` command can also be used to manage a RAIDZ configuration, although you will probably not want to use external disks in this case.
es: Además de trabajar con mirrors, el comando :command:`lpreserver zpool` se puede usar para administrar una configuración RAIDZ, aunque en este caso, probablemente, usted no querrá usar discos externos.

source: Report a bug
es: Informar de un Error

source: The bug reporting tool in Control Panel can be used to easily send a bug report to the development team responsible for the software which produced the bug.
es: La herramienta de informe de errores del Panel de Control se pude usar para enviar de manera sencilla un informe de errores al equipo de desarrolladores responsable del software que produjo el error.

source: To access this tool, go to :menuselection:`Control Panel --> Report a bug` or type :command:`pc-bugreport` from the command line. The initial screen for this tool is shown in :numref:`Figure %s: PC-BSD® Bug Reporting Utility <report1>`.
es: Para accesar esta herramienta, vaya a :menuselection:`Panel de Control --> Informar de un error` o ingrese :command:`pc-bugreport` desde la línea de comandos. La pantalla inicial para esta herramienta se muestra en la :numref:`Figura %s: Utilería de Informe de Errores de PC-BSD® <report1>`.

source: Select the software component that most closely matches where the bug occurs. For example, if the bug occurs when using a KDE utility, select "Desktop environment", or if the bug occurs when using an application that was installed using AppCafe®, select "PC-BSD software (pbi)". When in doubt, select "PC-BSD base system".
es: Seleccione el componente del software que más se acerque a donde se produce el error. Por ejemplo, si el error ocurrió cuando estaba usando una utilería de KDE, seleccione "Entorno de escritorio", o si el error ocurrió cuando se estaba usando una aplicación que se instaló usando AppCafe®, seleccione "Software (pbi) de PCBSD". Cuando tenga dudas, seleccione "Sistema base de PC-BSD".

source: In the example shown in :numref:`Figure %s: Reporting a Bug <report2a>`, the user has selected "PC-BSD base system" then "Next".
es: En el ejemplo mostrado en la :numref:`Figura %s: Informando de un Error <report2a>`, el usuario ha seleccionado “Sistema Base de PC-BSD” y luego “Siguiente”.

source: regardless of the selection, the resulting screen will be similar to :numref:`Figure %s: Reporting a Bug <report2a>`. The various screens only differ in which bug tracking system or mailing list is used by the development team for that component. If you select "Desktop environment" you will also be asked to indicate which desktop so that the correct information is displayed for that development team. Similarly, if you select "PBI software" you will be asked to select which PBI produces the error.
es: Independientemente de la selección, la pantalla resultante será similar a la de la :numref:`Figura %s: Informando de un Error <report2a>`. Las distintas pantallas sólo difieren según el sistema de seguimiento de errores o lista de correos que es usado por el equipo que desarrolla ese componente. Si usted selecciona “Entorno de escritorio” también se le pedirá que indique cuál es el escritorio de manera que la información correcta se muestre a ese equipo de desarrollo. De igual forma, si selecciona “Software PBI” se le preguntará qué PBI produce el error.

source: If the development team has a bug tracker, its URL will be displayed. If you click the "Launch web browser" button, that website will be opened in the default web browser so that you can search for existing bugs and create a new bug if one does not already exist. Note that you will need to register first if this is your first bug report on that project's bug tracker and that you must be logged in in order to create a new bug.
es: Si el equipo de desarrollo tiene un sistema de seguimiento de errores, su URL se mostrará. Si presiona en el botón "Iniciar navegador web", ese sitio web se abrirá en el navegador web predeterminado para que usted pueda buscar errores existentes y crear uno nuevo si no existe ya. Note que necesitará primero registrarse si este es su primer informe de errores en el sistema de seguimiento de errores de ese proyecto y que debe estar conectado para crear un nuevo reporte.

source: If the development team has a mailing list, its email address will be listed. The URL to the mailing list will also be displayed so that you can search its archives and subscribe to the list. Note that you will need to be subscribed to a mailing list before you can report a bug using that list. To report the bug, click the "Compose email" button to open the default mail application. To subscribe to or read the archives of the list, click the "Launch web browser" button.
es: Si el equipo de desarrollo tiene una lista de correo, se listará su dirección de correo. La URL de la lista de correo también se mostrará para que pueda buscar en sus archivos y suscribirse a la lista. Note que necesitará estar suscrito a la lista de correo antes de que pueda informar de un error usando esa lista. Para informar de un error, presione el botón "Escribir un correo" para abrir la aplicación predeterminada de correo. Para suscribirse a la lista o leer los archivos, presione el botón "Iniciar el navegador web".

source: The three icons in the "Toolbox" section can be used to gather useful information to include in your bug report. If you click the first icon on the left, a pop-up menu allows you to create any of the following:
es: Los tres iconos en la sección "Caja de Herramientas" se pueden usar para reunir información útil para incluir en su informe de errores. Si presiona el primer icono de la izquierda, un menú emergente le permitirá crear cualquiera de los siguientes:

source: Diagnostic report
es: Informe de diagnóstico

source: FreeBSD version (:command:`uname -a`)
es: Versión de FreeBSD (:command:`uname -a`)

source: :command:`dmesg` output
es: salida de :command:`dmesg`

source: Xorg version
es: Versión de Xorg

source: Xorg log
es: Log de Xorg

source: If you click an entry in the menu, the results will be displayed in a window so that you can copy the contents into your bug report.
es: Si presiona una entrada en el menú, los resultados se mostrarán en una ventana para que pueda copiar el contenido en su informe de errores.

source: If you click the second icon, it will generate a PCI devices list. This is useful information if your built-in wireless card is not working.
es: Si presiona el segundo icono, se generará una lista de dispositivos PCI. Esta es una información útil si su tarjeta inalámbrica integrada no está funcionando.

source: If you click the third icon, the default snapshot utility for the desktop will open so that you can include a screenshot in your bug report.
es: Si presiona el tercer icono, se abrirá la utilería predeterminada de captura de pantalla del escritorio para que pueda incluir una captura de la pantalla en su informe de errores.

source: While this utility makes it easy to find the correct place to send a bug report, it is still up to you to make sure that your report includes the information that developers need to recreate and eventually fix the bug. The following resources contain useful tips for the various development teams for the bugs you may encounter when using PC-BSD®. Before reporting:
es: Mientras esta utilería le facilita el encontrar el sitio correcto para enviar un informe de errores, aún depende de usted asegurarse de que su informe incluya la información que necesitan los desarrolladores para recrear y eventualmente reparar el error. Los siguientes recursos contienen consejos útiles para los distintos equipos de desarrollo para los errores que usted pueda encontrar cuando use PC-BSD®. Antes de informar:

source: a bug about the "FreeBSD base system" or "FreeBSD software (ports/packages)", read through `the FreeBSD bug reports page <http://www.freebsd.org/support/bugreports.html>`_.
es: Un error sobre el "sistema base de FreeBSD" o "software de FreeBSD (ports/paquetes)", lea `la página de informe de errores de FreeBSD <http://www.freebsd.org/support/bugreports.html>`_.

source: a bug about the "Xorg server", read through the `Xorg FAQ <http://www.x.org/wiki/FAQ/>`_.
es: Un error sobre el "servidor Xorg", lea las `FAQ de Xorg <http://www.x.org/wiki/FAQ/>`_.

source: a KDE bug, read through `General Troubleshooting <https://forum.kde.org/viewtopic.php?f=14&t=38828>`_.
es: Un error de KDE, lea `Resolución General de Errores <https://forum.kde.org/viewtopic.php?f=14&t=38828>`_.

source: a GNOME bug, read through `how to file a bug in GNOME's bugzilla <http://askubuntu.com/questions/43487/how-to-file-a-bug-on-gnomes-bugzilla>`_.
es: Un error de GNOME, lea `cómo llenar un informe de error en bugzilla de GNOME <http://askubuntu.com/questions/43487/how-to-file-a-bug-on-gnomes-bugzilla>`_.

source: a LXDE bug, read through `read this first <http://forum.lxde.org/viewtopic.php?t=575>`_.
es: Un error de LXDE, `lea esto primero <http://forum.lxde.org/viewtopic.php?t=575>`_.

source: a XFCE bug, read through `XFCE bug reporting <http://docs.xfce.org/contribute/bugs/start>`_.
es: Un error de XFCE, lea `informando de un error de XFCE <http://docs.xfce.org/contribute/bugs/start>`_.
