Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: The "Remote login" tab, shown in :numref:`Figure %s: Configuring Remote Login <login3>`, is used to enable a remote user to connect to a desktop session using :wikipedia:`Virtual Network Computing` (VNC). Check the "Enable Remote Desktop (VNC)" box to enable this service. When you click "Apply", you will be prompted for your password as well as the remote login password to use for the VNC session. Reboot in order to activate the VNC service over port 5900. You will also need to open TCP port 5900 using :ref:`Firewall Manager`. You can test the connection using the "vnc" option of KRDC (shown in :numref:`Figure %s: Creating a Connection Using KRDC <krdc1>`) or from another VNC client.
es: La pestaña de “Acceso remoto”, mostrada en la :numref:`Figura %s: Configurando el Acceso Remoto <login3>`, se usa para habilitar que un usuario remoto se conecte a una sesión de escritorio usando :wikipedia:`Virtual Network Computing` (VNC). Seleccione la casilla “Habilitar Escritorio Remoto (VNC)” para habilitar este servicio. Cuando presione “Aplicar”, se le pedirá su contraseña así como la contraseña de acceso remoto para usar en la sesión de VNC. Reinicie para activar el servicio VNC sobre el puerto 5900. También necesitará abrir el puerto TCP 5900 usando el :ref:`Administrador del Cortafuegos`. Puede probar la conexión usando la opción “vnc” de KRDC (mostrado en la :numref:`Figura %s: Creando una Conexión Usando KRDC <krdc1>`) o desde otro cliente VNC.

source: use **extreme caution** when enabling this option as it makes your system available to anyone over the network. There is an additional risk when a user logs in over VNC as their password is sent in clear text. If you need someone to access your PC-BSD® system to assist with troubleshooting, consider using :ref:`Remote Desktop` instead, which allows you to send an invitation to connect. Always disable any type of remote login **immediately** after finishing your troubleshooting session. If you are instead using this option to login to your desktop from a remote location such as work or school, configure your network's firewall to only allow VNC connections from the specific IP address you will be using to make the connection.
es: Tome **precaución extrema** cuando habilite esta opción ya que permite que su sistema esté disponible para cualquier persona en la red. Hay un riesgo adicional cuando un usuario accede mediante VNC ya que su contraseña se envía en texto plano. Si necesita que alguien acceda a su sistema PC-BSD® para darle soporte, considere en su lugar usar el :ref:`Escritorio Remoto`, que le permite enviar una invitación para la conexión. Deshabilite siempre cualquier tipo de acceso remoto **inmediatamente** tras finalizar su sesión de soporte. Si usted, en su lugar está usando esta opción para conectarse a su escritorio desde una locación remota, como el trabajo o la escuela, configure el cortafuegos de su red para permitir solamente conexiones VNC desde la dirección IP específica que usará para hacer la conexión.

source: The "Misc" tab is shown in :numref:`Figure %s: Miscellaneous Options <login4a>`.
es: La pestaña "Misceláneos" se muestra en la :numref:`Figura %s: Opciones Misceláneas <login4a>`.

source: This screen provides the following options:
es: Esta pantalla proporciona la siguientes opciones:

source: **Enable "show password" button:** by default, when a user types their password at the login prompt shown in :numref:`Figure %s: Optional Services <optional1a>`, "*" characters are displayed as the password is typed in order to prevent another user from seeing the password as it is typed. When the "Enable "show password" button" box is checked, and the user clicks the lock icon next to the typed password in the login screen, the asterisks will change to reveal the password.
es: **Habilitar botón "mostrar password":** por defecto, cuando un usuario ingresa su contraseña en el indicador de acceso mostrado en la :numref:`Figura %s: Accediendo a una Sesión Sigilosa <stealth>`, caracteres "*" se desplegarán mientras la contraseña es ingresada para prevenir que otro usuario vea la contraseña mientras se escribe. Cuando la casilla "Habilitar botón "mostrar password"" es seleccionada, y el usuario presiona el icono de candado junto a la contraseña escrita en la pantalla de acceso, los asteriscos cambiarán para revelar la contraseña.

source: **Allow Stealth Sessions:** if this box is checked, a "Stealth Session" checkbox is added to the login menu, as seen in :numref:`Figure %s: Logging Into a Stealth Session <stealth>`. When a user logs into a stealth session, meaning that they check the "Stealth Session" box in the login menu, a temporary, encrypted zvol is created, mounted, and used as a temporary home directory. When the user logs out, the zvol is destroyed, along with the contents of that temporary home directory. This allows a user to temporarily use a PC-BSD® system without leaving any data from their login session on the PC-BSD® system. This can be useful, for example, to allow a publicly accessible system to support multiple, transient users. It also allows you to login and run applications as if on a fresh system each time. Should the system be rebooted before you logout of the stealth session, the one-time key is lost, rendering the data useless. A stealth session is similar to a web browser's private mode, except for your entire desktop session.
es: **Permitir Sesiones Sigilosas:** si esta casilla está seleccionada, una casilla de selección "Sesión Sigilosa" se añade al menú de acceso, como se muestra en la :numref:`Figura %s: Accediendo a una Sesión Sigilosa <stealth>`. Cuando un usuario accede a una sesión sigilosa, queriendo decir que seleccionaron la casilla "Sesión Sigilosa" en el menú de acceso, se crea un zvol encriptado, temporal, montado, y usado como directorio personal temporal. Esto le permite a un usuario usar temporalmente un sistema PC-BSD® sin dejar rastro de cualquier dato de su acceso a la sesión en el sistema PC-BSD®. Esto puede ser útil, por ejemplo, para permitir a un sistema públicamente accesible a que soporte múltiples, usuarios eventuales. También le permite acceder y correr aplicaciones como si fuera un sistema nuevo cada vez. Si el sistema se reiniciara antes de que saliera de la sesión sigilosa, la llave de una sola vez se pierde, dejando los datos inutilizables. Una sesión sigilosa es similar al modo privado del navegador web, excepto que es para su completa sesión de escritorio.

source: if you log into a stealth session, do not save any data to your home directory as it will be destroyed at logout. If your intent is to safely interact with a PC-BSD® system while retaining the data in your home directory, use :ref:`PersonaCrypt` instead.
es: Si accede a una sesión sigilosa, no guarde ningún dato en su directorio personal ya que será destruido cuando se desconecte. Si su intención es interactuar de manera segura con un sistema PC-BSD® mientras retiene los datos en su directorio personal, utilice :ref:`PersonaCrypt` en su lugar.

source: **Display available users:** by default, the list of available users is displayed in the login screen. To hide this list and force the user to input their username, uncheck this box. For security reasons, the Login Manager will refuse logins from the *root* and *toor* accounts.
es: **Mostrar usuarios disponibles:** por defecto, la lista de usuarios disponibles se muestra en la pantalla de acceso. Para ocultar esta lista y forzar al usuario a introducir su nombre de usuario, desmarque esta casilla. Por razones de seguridad, el Gestor de Acceso rechazará accesos desde las cuentas de *root* y *toor*.

source: **Allow Valid Users with UID under 1000:** check this box if you have imported existing users with a UID under 1000, for example from a Solaris NIS server. Checking this box will activate the "Additional Excluded Users" field. You can then use the "+" icon to add an existing user to the exclude list. To remove a user from the exclude list, highlight their entry and click the "-" icon.
es: **Permitir Usuarios Válidos con UID menor a 1000:** seleccione esta casilla si ha importado usuarios existentes con un UID menor a 1000, por ejemplo desde un servidor NIS Solaris. Seleccionando esta casilla se activará el campo "Usuarios Excluidos Adicionales". Puede entonces utilizar el icono "+" para añadir un usuario existente a la lista de exclusiones. Para eliminar a un usuario de la lista de exclusiones, seleccione su entrada y haga clic en el icono "-".

source: Service Manager
es: Administrador de Servicios

source: Service Manager, seen in :numref:`Figure %s: Managing Services Using Service Manager <service>`, provides a graphical utility for managing PC-BSD® services.
es: El Administrador de Servicios, mostrado en la :numref:`Figura %s: Gestionando Servicios Usando el Administrador de Servicios <service>`, proporciona una utilería gráfica para gestionar los servicios de PC-BSD®.

source: Buttons make it easy to start, stop, or restart services and to set the highlighted service to be enabled or disabled whenever the system boots. To access this utility, go to PC-BSD® :menuselection:`Control Panel --> Service Manager` or type :command:`pc-su pc-servicemanager`. You will be prompted for your password.
es: Los botones hacen fácil el iniciar, parar o reiniciar servicios y para establecer los servicios seleccionados a ser habilitados o deshabilitados cada que el sistema inicie. Para acceder a esta utilería, vaya al :menuselection:`Panel de Control --> Administrador de Servicios` de PC-BSD® o ingrese :command:`pc-su pc-servicemanager`. Se le pedirá su contraseña.

source: By default, services will be listed alphabetically. You can reorder the services by clicking on the "Service Name", "Running", or "Enabled" headers. Service Manager is a graphical front-end to the rc scripts located in :file:`/etc/rc.d`.
es: Por defecto, los servicios se listarán en orden alfabético. Puede reordenar los servicios haciendo clic en los encabezados "Nombre de Servicio", "Corriendo", o "Habilitado". El Administrador de Servicios es un front-end gráfico para los scripts rc localizados en :file:`/etc/rc.d`.

source: If you do not know what a service does, do not change its settings in Service Manager. If you would like to learn more about a service, try seeing if there is a man page for it. For example, type :command:`man apm` or :command:`man bootparamd`. If a man page does not exist, try seeing what man pages are associated with that keyword. For example::
es: Si no sabe lo que hace un servicio, no cambie sus configuraciones en el Administrador de Servicios. Si quiere saber más sobre un servicio, intente ver si hay un página del manual para él. Por ejemplo, escriba :command:`man apm` o :command:`man bootparamd`. Si una página del manual no existe, intente ver qué páginas del manual están asociadas con esa palabra clave. Por ejemplo::

source: System Manager
es: Administrador del Sistema

source: This section describes the various tasks that can be performed using the graphical System Manager utility. System Manager can be accessed from :menuselection:`Control Panel --> System Manager` or by typing :command:`pc-su pc-sysmanager`. You will be prompted to input your password.
es: Esta sección describe las diversas tareas que se pueden llevar a cabo mediante la utilería gráfica Adminstrador del Sistema. Se puede acceder al Administrador del Sistema desde :menuselection:`Panel de Control --> Administrador del Sistema` o ingresando :command:`pc-su pc-sysmanager`. Se le pedirá introducir su contraseña.

source: The "General" tab, shown in :numref:`Figure %s: General Tab of System Manager Utility <system1>`, displays the following system information:
es: La pestaña "General", mostrada en la :numref:`Figura %s: Pestaña General de la Utilería Administrador del Sistema <system1>`, despliega la siguiente información del sistema:

source: the version numbers for the PC-BSD® base and its command-line and graphical utilities
es: Los números de versión para la base de PC-BSD® y sus utilerías de línea de comandos y gráficas.

source: the version of the underlying FreeBSD base
es: la versión de la base de FreeBSD

source: the CPU type and speed
es: el tipo de CPU y velocidad

source: the amount of physical memory
es: la cantidad de memoria física

source: The "Generate" button can be used to create a report that includes the following items:
es: El botón "Generar" se puede usar para crear un informe que incluye los siguientes elementos:

source: a listing of the installed components and their versions
es: un listado de los componentes instalados y sus versiones

source: the output of the :command:`dmesg` command, which shows messages from the kernel
es: la salida del comando :command:`dmesg`, que muestra los mensajes del kernel

source: the last few lines of the :file:`/var/log/messages` log file
es: las últimas líneas del archivo de registro :file:`/var/log/messages`

source: the output of the :command:`pciconf -lv` command, which lists all the devices that were found when the system booted
es: la salida del comando :command:`pciconf -lv`, que lista todos los dispositivos que se encontraron cuando el sistema arrancó.

source: your X configuration file, which shows your display settings
es: la configuración de su archivo X, que muestra su conguración de pantalla

source: your :file:`/etc/rc.conf` file, which shows your startup settings
es: su archivo :file:`/etc/rc.conf`, que muestra su configuración de inicio

source: your :file:`/boot/loader.conf` file, which shows which drivers are loaded at boot time
es: su archivo :file:`/boot/loader.conf`, que muestra qué drivers se cargarán durante el arranque

source: the output of the command :command:`df -m`, which shows your amount of free disk space
es: La salida del comando :command:`df -m`, que muestra la cantidad de espacio libre en el disco

source: a listing from the :command:`top` command, which shows the currently running processes
es: Una lista del comando :command:`top`, la cual muestra los procesos ejecutándose actualmente

source: When you click the "Generate" button, you will be prompted to input the name and location of the text file that will be created. Since it is a text file, you can view its contents in any text editor. When troubleshooting your system, this file is handy to include when you :ref:`Report a bug`.
es: Cuando hace clic en el botón "Generar", se le pedirá que introduzca el nombre y la localización del archivo de texto que será creado. Ya que es un archivo de texto, pude ver su contenido en cualquier editor de texto. Cuando esté solucionando problemas de su sistema, es útil que incluya este archivo cuando esté por :ref:`Informar de un Error`.

source: During the installation of PC-BSD® you had an opportunity to install FreeBSD source and ports. If you did not and wish to do so after installation, use the "Tasks" tab of System Manager, shown in :numref:`Figure %s: Tasks Tab of the System Manager Utility <system2>`.
es: Durante la instalación de PC-BSD® tiene la oportunidad de instalar las fuentes y ports de FreeBSD. Si no lo hizo y quiere hacerlo después de la instalación, use la pestaña "Tareas" del Administrador del Sistema, mostrada en la :numref:`Figura %s: Pestaña Tareas de la Utilería Administrador del Sistema <system2>`.

source: This tab provides a graphical interface for installing system source or the ports tree using :command:`git`.
es: Esta pestaña proporciona una interfaz gráfica para instalar las fuentes del sistema o el árbol de ports usando :command:`git`.

source: If you click the "Fetch PC-BSD System Source" button, a pop-up menu will display the download process. The source will be saved to :file:`/usr/src/`. Once the download is complete, a "Finished!" message will appear and you can click the "Close" button to exit this screen.
es: Si presiona el botón "Conseguir las Fuentes del Sistema PC-BSD", un menú emergente desplegará el proceso de descarga. Las fuentes se guardarán en :file:`/usr/src/`. Una vez que se ha completado la descarga, un mensaje de "Terminado!" aparecerá y entonces puede presionar el botón de "Cerrar" para salir de la pantalla.

source: If you click the "Fetch PC-BSD Ports Tree" button, a message will indicate that ports are being fetched and will indicate when this is complete by adding a "Finished!" message to the lower left corner of the message. Ports will be installed to :file:`/usr/ports/`.
es: Si presiona el botón "Conseguir el Árbol de Ports de PC-BSD", un mensaje indicará que los ports se están descargando y cuándo se ha completado añadiendo un mensaje de "Terminado!" en las esquina inferior izquierda del mensaje. Los ports se instalarán en :file:`/usr/ports/`.

source: The "Misc" tab of System Manager is seen in :numref:`Figure %s: Misc Tab of the System Manager Utility <system3>`.
es: La pestaña "Misceláneos" del Administrador del Sistema se muestra en la :numref:`Figura %s: Pestaña Misceláneos de la Utilería Administrador del Sistema <system3>`.

source: This tab contains a checkbox to "Force IBUS keyboard input". Check this box if you wish to to input Chinese, Japanese, Korean or Indic characters using a Latin keyboard.
es: Esta pestaña contiene un casilla de verificaión para "Forzar la entrada de teclado IBUS". Seleccione esta casilla si quiere ingresar caracteres Chinos, Japoneses, Coreanos o Indicos usando un teclado Latino.

source: User Manager
es: Administrador de Usuarios

source: The PC-BSD® User Manager utility allows you to easily add and delete users and groups, as well as change a user's or the administrative password. To access this utility, go to :menuselection:`Control Panel --> User Manager` or type :command:`pc-su pc-usermanager`. You will need to input your password in order to access this utility.
es: La utilería Administrador de Usuarios de PC-BSD® le permite añadir y eliminar usuarios y grupos fácilmente, así como cambiar una contraseña de usuario o administrativa. Para acceder a esta utilería, vaya a :menuselection:`Panel de Control --> Administrador de Usuarios` o ingrese :command:`pc-su pc-usermanager`. Necesitará introducir su contaseña para poder acceder a esta utilería.

source: Managing User Accounts
es: Administrando Cuentas de Usuario

source: In the example shown in :numref:`Figure %s: Viewing User Accounts in User Manager <user1>`, the system has two user accounts. The *dru* account has the ability to become the superuser as the "Can administrate system" checkbox is checked.
es: En el ejemplo mostrado en la :numref:`Figura %s: Viendo las Cuentas de Usuario en el Administrador de Usuarios <user1>`, el sistema tiene dos cuentas de usuario. La cuenta *dru* tiene la habilidad de convertirse en superusuario ya que la casilla "Puede administrar el sistema" está seleccionada.

source: If you click the "Remove" button for a highlighted user, a pop-up menu will ask if you would like to also delete the user's home directory (along with all of their files). If you click "No", the user will still be deleted but their home directory will remain. If you have only created one user account, the "Remove" button will be greyed out as you need at least one user to be able to login to the PC-BSD® system.
es: Si presiona el botón "Eliminar" para un usuario seleccionado, un menú emergente le preguntará si también quiere eliminar el directorio personal del usuario (junto con todos sus archivos). Si presiona en "No", el usuario se eliminará pero su directorio personal se mantendrá. Si sólo ha creado una cuenta de usuario, el botón "Eliminar" aparecerá atenuado ya que necesita al menos un usuario para poder accesar al sistema PC-BSD®.

source: while a removed user will no longer be listed, the user account will not actually be deleted until you click the "Apply" button. A pop-up message will indicate that you have pending changes if you close User Manager without clicking "Apply". If you change your mind, click "No" and the user account will not be deleted; otherwise, click "Yes" and the user will be deleted and User Manager will close.
es: Mientras que un usuario eliminado ya no se listará, la cuenta del usuario no se eliminará en realidad hasta que presione el botón "Aplicar". Un mensaje emergente le indicará que tiene cambios pendientes si cierra el Administrador de Usuarios sin haber presionado "Aplicar". Si cambia de opinión, presione "No" y la cuenta del usuario no se eliminará; de lo contrario, presione "Sí" y el usuario se eliminará y se cerrará el Administrador de Usuario.

source: The password for any user can be changed by first highlighting the user name then clicking the "Change Password" button. You will not be prompted for the old password in order to reset a user's password; this can be handy if a user has forgotten their password and can no longer log into the PC-BSD® system. If you click the "Change Admin Password" button, you can change the root user's password.
es: La contraseña de cualquier usuario puede cambiarse seleccionando primero el nombre del usuario y después presionando el botón "Cambiar Contraseña". No se le pedirá la contraseña anterior para cambiar una contraseña de usuario; esto puede ser útil si un usuario ha olvidado su contraseña y ya no puede accesar al sistema PC-BSD®. Si presiona el botón "Cambiar la Contraseña del Administrador", puede cambiar la contraseña del administrador.

source: If you click the "Advanced View" button, this screen will change to show all of the accounts on the system, not just the user accounts that you created. An example is seen in :numref:`Figure %s: Viewing All Accounts and Their Details <user2>`.
es: Si presiona el botón "Vista Avanzada", esta pantalla cambiará para mostrar todas las cuentas en el sistema, no solo las cuentas que usted ha creado. Un ejemplo se muestra en la :numref:`Figura %s: Viendo Todas las Cuentas y sus Detalles <user2>`.

source: The accounts that you did not create are known as system accounts and are needed by the operating system or installed applications. Do **not** delete any accounts that you did not create yourself as doing so may cause a previously working application to stop working. "Advanced View" provides additional information associated with each account, such as the user ID number, full name (description), home directory, default shell, and primary group. System accounts usually have a shell of *nologin* for security reasons, meaning that an attacker can not try to login to the system using that account name.
es: Las cuentas que no ha creado usted se conocen como cuentas de sistema y son necesarias para el sistema operativo o aplicaciones instaladas. **No** elimine ninguna cuenta que no haya creado usted ya que puede provocar que una aplicación que antes funcionaba ahora deje de hacerlo. La "Vista Avanzada" proporciona información adicional asociada con cada cuenta, como el ID del usuario, nombre completo (descripción), directorio personal, shell predeterminado, y grupo primario. Las cuentas del sistema tienen normalmente un shell de *nologin* por razones de seguridad, lo que significa que un atacante no puede intentar acceder al sistema utilizado ese nombre de cuenta.

source: :numref:`Figure %s: Creating a New User Account <user3>` shows the add user account creation screen that opens when you click the "Add" button.
es: La :numref:`Figura %s: Creando una Nueva Cuenta de Usuario <user3>` muestra la pantalla de creación de una cuenta de usuario que se abre cuando presiona el botón "Añadir".

source: if you click the "Add" button while in "Simple View", you will only be prompted to enter the username, full name, and password.
es: Si hace clic en el botón "Añadir" mientras está en "Vista Simple" sólo se le pedirá que introduzca el nombre del usuario, nombre completo y una contraseña.
