Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: A snapshot provides a "point-in-time" image of the ZFS pool. In one way, this is similar to a full system backup as the snapshot contains the information for the entire filesystem. However, it has several advantages over a full backup. Snapshots occur instantaneously, meaning that the filesystem does not need to be unmounted and you can continue to use applications on your system as the snapshot is created. Since snapshots contain the meta-data ZFS uses to access files, the snapshots themselves are small and subsequent snapshots only contain the changes that occurred since the last snapshot was taken. This space efficiency means that you can take snapshots often. Snapshots also provide a convenient way to access previous versions of files as you can simply browse to the point-in-time for the version of the file that you need. Life Preserver makes it easy to configure when snapshots are taken and provides a built-in graphical browser for finding and restoring the files within a snapshot.
es: Un snapshot proporciona una imagen de un "momento particular" de un pool ZFS. En cierto modo, esto es similar a un respaldo completo del sistema ya que el snapshot contiene la información de todo el sistema de archivos. Sin embargo, tiene varias ventajas respecto a un respaldo completo. Los snapshots ocurren instantáneamente, lo que significa que el sistema de archivos no necesita ser desmontado y usted puede continuar utilizando las aplicaciones en su sistema mientras se crea el snapshot. Ya que los snapshots contienen los metadatos que ZFS usa para accesar archivos, los snapshots en sí mismos son pequeños y los posteriores sólo contienen los cambios que se produjeron desde que se tomó el último snapshot. Esta eficiencia en el espacio significa que puede tomar snapshots con frecuencia. Los snapshots también proporcionan una manera conveniente de accesar a versiones previas de archivos ya que usted simplemente puede buscar en uno de los momentos particulares la versión del archivo que necesite. Life Preserver facilita el configurar cuándo son tomados los snapshots y proporciona un navegador gráfico integrado para encontrar y restaurar los archivos dentro de un snapshot.

source: Replication is an efficient way to keep the files on two systems in sync. In the case of Life Preserver, the snapshots taken on the PC-BSD® system will be synchronized with their versions stored on the backup server.
es: La replicación es una manera eficiente de mantener los archivos sincronizados en dos sistemas. En el caso de Life Preserver, los snapshots tomados en el sistema PC-BSD® se sincronizarán con sus versiones almacenadas en el servidor de respaldo.

source: Snapshots are sent to the backup server oven an encrypted connection and can optionally be stored in an encrypted format, which protects the contents of the snapshots.
es: Los snapshots se mandan al servidor de respaldo sobre una conexión encriptada y pueden ser opcionalmente almacenados en un formato encriptado, el cual protege el contenido de los snapshots.

source: Having a copy of the snapshots on another system makes it possible to perform an operating system restore should the PC-BSD® system become unusable or to deploy an identical system to different hardware.
es: Tener una copia de los snapshots en otro sistema hace posible realizar una restauración de un sistema operativo si el sistema PC-BSD® se vuelve inestable o para replicar un sistema idéntico en diferente hardware.

source: Scheduling a Backup
es: Planificando un Respaldo

source: An icon to the Life Preserver utility, seen in :numref:`Figure %s: Life Preserver Icon in System Tray <lpreserver1>`, can be found in the system tray.
es: Un icono para la utilería Life Preserver, mostrado en la :numref:`Figura %s: Icono de Life Preserver en la Bandeja de Sistema <lpreserver1>`, puede encontrarse en la bandeja de sistema.

source: If you right-click this icon, the following options are available:
es: Si hace botón derecho en este icono, las siguientes opciones están disponibles:

source: **Open Life Preserver:** starts Life Preserver, which will prompt for your password. The first time this utility is run, it will display the screen shown in :numref:`Figure %s: Initial Life Preserver Screen <lpreserver2>`.
es: **Abrir Life Preserver:** inicia Life Preserver, el cual le pedirá su contraseña. La primera vez que esta utilería se ejecuta, desplegará la pantalla mostrada en la :numref:`Figura %s: Pantalla Inicial de Life Preserver <lpreserver2>`.

source: **View Messages:** opens a pop-up menu to display information messages and the Life Preserver log file. There won't be any messages until after Life Preserver is configured and starts to create backups. If a configured Life Preserver task fails, such as replication, check the "Log Files" tab.
es: **Ver Mensajes:** abre un menú emergente para mostrar mensajes de información y el archivo de log de Life Preserver. No habrá ningún mensaje hasta que Life Preserver se configure y comience a crear respaldos. Si una tarea configurada de Life Preserver falla, tal como una replicación, compruebe la pestaña de "Archivos de Log".

source: **Popup Settings:** configures Life Preserver to display its notifications over the Life Preserver icon. Choices are "Show all", which includes notifications for when a backup/replication starts or finishes, "Warnings only", which only displays warning and error messages, and "None" which disables pop-up notification. The default setting is "Warnings only". This setting does not affect critical messages which will always open a window that requires attention.
es: **Configuraciones Emergentes:** configura Life Preserver para mostrar sus notificaciones sobre el icono de Life Preserver. Las opciones son "Mostrar todo", lo que incluye notificaciones de cuándo un respaldo/réplica comienza o termina, "Sólo advertencias", que solo muestra advertencias y mensajes de error, y "Ninguno" que deshabilita la notificación emergente. La configuración predeterminada es "Solo advertencias". Esta configuración no afecta los mensajes críticos que siempre abrirán una ventana que requiere atención.

source: **Refresh Tray:** by default, Life Preserver checks the status of the pool and available disk space every 5 minutes. Click this option to check the current status of a scrub or to check the current disk space after removing a snapshot.
es: **Refrescar Bandeja:** por defecto, Life Preserver comprueba el estado del pool y del espacio disponible en disco cada cinco minutos. Presione esta opción para ver el estado actual tras una comprobación (scrub) o para comprobar el espacio actual del disco tras eliminar un snapshot.

source: **Close Tray:** will remove the icon from the system tray. To re-add it to the tray, go to :menuselection:`Control Panel --> Life Preserver` or type :command:`life-preserver-tray &` at the command line. If your desktop manager does not provide a system tray, you will need to instead refer to the section :ref:`Using the lpreserver CLI`.
es: **Cerrar Bandeja:** eliminará el icono de la bandeja de sistema. Para volverlo a añadir a la bandeja, vaya a :menuselection:`Panel de Control --> Life Preserver` o escriba :command:`life-preserver-tray &` en la línea de comandos. Si su gestor de escritorio no proporciona una bandeja de sistema, deberá en su lugar ver la sección :ref:`Usando el CLI lpreserver`.

source: The status of this icon changes when a snapshot, scrub, or replication task is occurring. If you hover over the icon during this time, a tooltip will describe the current status of the running task.
es: El estado de este icono cambia cuando una tarea de snapshot, comprobación (scrub), o replicación está ocurriendo. Si pasa el ratón sobre el icono durante este momento, una nota de ayuda le describirá el estado actual de la tarea en ejecución.

source: To create a backup schedule, click :menuselection:`File --> Manage Pool` and select the name of the pool to manage. The following examples are for a pool named *tank*. This will launch the the "New Life Preserver Wizard", allowing you to configure the backup schedule. Click "Next" to see the screen in :numref:`Figure %s: Snapshot Schedule Screen <lpreserver3>`.
es: Para crear una planificación de respaldos, presione :menuselection:`Archivo --> Gestionar Pool` y seleccione el nombre del pool a gestionar. Los siguientes ejemplos son para un pool llamado *tank*. Esto lanzara el "Asistente de Nuevo Life Preserver", permitiéndole configurar el calendario de respaldos. Presione "Siguiente" para ver la pantalla en la :numref:`Figura %s: Pantalla de Planificación de Snapshots <lpreserver3>`.

source: This screen is used to schedule how often a snapshot is taken of the system. The default of "Automatic" creates a snapshot every 5 minutes, which are kept for an hour, then the hourly is kept for 24 hours, the daily is kept for a month, and the monthly is kept for a year. You can change this default to take one daily snapshot at a specified time or to take a snapshot once every hour, 30 minutes, 10 minutes or 5 minutes.
es: Esta pantalla se usa para programar con qué frecuencia se toma un snapshot del sistema. El predeterminado de "Automático" crea un snapshot cada 5 minutos, que se guardan durante una hora, después el de cada hora se guarda por 24 horas, los diarios se guardan por un mes, y el mensual se guarda por un año. Puede cambiar esta configuración predeterminada para tomar un snapshot en un momento determinado o para tomarlo cada hora, 30 minutos, 10 minutos o 5 minutos.

source: If you change the default of "Automatic", the next screen, shown in :numref:`Figure %s: Snapshot Pruning Screen <lpreserver4>`, is used to configure how long to keep the snapshots.
es: Si cambia el predeterminado de "Automático", la siguiente pantalla, mostrada en la :numref:`Figura %s: Pantalla de Poda de Snapshots <lpreserver4>`, se usa para configurar qué tanto mantener los snapshots.

source: Snapshots can be configured to be pruned after the specified number of days or after the specified number of snapshots. This screen will not appear for "Automatic" as it has its own pruning schedule, as explained in the previous paragraph.
es: Los snapshots se pueden configurar para ser eliminados según el número especificado de días después de un número especificado de snapshots. Esta pantalla no aparecerá para "Automático" ya que éste tiene su propio plan de eliminación, tal como se explica en el párrafo anterior.

source: auto-pruning only occurs on the snapshots generated by Life Preserver according to the configured schedule. Auto-pruning will not delete any snapshots you create manually using the "Snapshots" tab in Life Preserver.
es: La eliminación automática ocurre en el snapshot generado por Life Preserver de acuerdo al plan configurado. La eliminación automática no quitará ningun snapshot que usted cree manualmente usando la pestaña "Snapshots" en Life Preserver.

source: After making your selection, press "Next" to see the screen shown in :numref:`Figure %s: Scrub Schedule Screen <lpreserver19a>`.
es: Después de hacer su selección, presione "Siguiente" en la pantalla mostrada en la :numref:`Figura %s: Pantalla del Plan de Poda <lpreserver19a>`.

source: This screen is used to schedule when a ZFS scrub occurs. Scrubs are recommended as they can provide an early indication of a potential disk failure. To schedule the scrub, check the box "Enable scheduled scrub" which will activate the configurable options in this screen. Use the drop-down menu to select a frequency of "Daily", "Weekly", or "Monthly". If you select "Daily", you can configure the "Hour". If you select "Weekly", you can configure the "Day of week" and the "Hour". If you select "Monthly", you can configure the "Day of month", "Day of week", and "Hour". Since a scrub can be disk I/O intensive, it is recommended to pick a time when the system will not be in heavy use. When you are finished, click "Next" to see the screen shown in :numref:`Figure %s: Select Advanced Configuration Screen <lpreserver21>`.
es: Esta pantalla se usa para programar cuándo ocurre una comprobación (scrub) de ZFS. Los scrubs se recomiendan ya que pueden proporcionarle una indicación temprana de una falla potencial del disco. Para programar un scrub, seleccione la casilla "Habilitar scrub programado" lo que activará las opciones configurables en esta pantalla. Use el menú desplegable para seleccionar la frecuencia de "Diario", "Semanal", o "Mensual". Si selecciona "Diario", puede configurar la "Hora". Si selecciona "Semanal", puede configurar el "Día de la semana" y la "Hora". Si selecciona "Mensual", puede configurar el "Día del mes", "Día de la semana", y "Hora". Dado que un scrub puede ser intensivo en I/O, se recomienda elegir un momento cuando el sistema no esté en uso intensivo. Cuando termine, presione "Siguiente" para ver la pantalla mostrada en la :numref:`Figura %s: Pantalla de Selección de Configuración Avanzada <lpreserver21>`.

source: This screen provides the option to finish the configuration now or to continue on to the advanced options. If you only plan to store snapshots on this system or you have not yet configured another system to back up to, click "Finish". If you wish to replicate your backups to another system on the network which has already been prepared for this purpose, check the box for "Proceed directly to the advanced configuration options" before clicking "Finish". Once you click "Finish", the wizard will save your configuration, exit the wizard, take a system snapshot, and move on to the screen shown in :numref:`Figure %s: Life Preserver's Basic View <lpreserver6a>`.
es: Esta pantalla proporciona la opción de terminar la configuración ahora o continuar a las opciones avanzadas. Si solo planea guardar snapshots en este sistema o no ha configurado aún otro sistema para respaldar, presione "Terminar". Si quiere replicar sus respaldos a otro sistema en la red que ya ha sido preparado para este propósito, seleccione la casilla para "Proceder directamente a las opciones de configuración avanzada" antes de presionar "Terminar". Una vez que presione "Terminar", el asistente guardará su configuración, saldrá del asistente, tomará un snapshot del sistema, y seguirá a la pantalla mostrada en la :numref:`Figura %s: Vista Básica de Life Preserver <lpreserver6a>`.

source: Life Preserver Options
es: Opciones de Life Preserver

source: Once the snapshot schedule has been created, the "Status" tab shown in :numref:`Figure %s: Life Preserver's Basic View <lpreserver6a>` will become active and will show the name of the latest snapshot. If you have scheduled a scrub or replication, it will also show the status of the last running scheduled task. In this example, the ZFS pool is active, is comprised of one disk, and the date and time of the last snapshot indicates that it was created on June 23 at 1:55 in the afternoon. The most recent scheduled scrub occurred on June 3 at 10:52 in the evening and the green status indicates that it completed without finding any disk errors.
es: Una vez que la programación de snapshots ha sido creada, la pestaña "Estado" se muestra en la :numref:`Figura %s: Vista Básica de Life Preserver <lpreserver6a>` se pondrá activa y mostrará el nombre del último snapshot. Si ha programado un scrub o replicación, también mostrará el estado de la última tarea programada. En este ejemplo, el pool ZFS está activo, se compone de un disco, y la fecha y hora del último snapshot indica que fue creado el 23 de junio a la 1:55 de la tarde. El scrub programado más reciente ocurrió el 3 de junio a las 10:52 de la noche y el estado verde indica que se ha completado sin encontrar ningún error en el disco.

source: The "View" menu lets you select "Basic" or "Advanced" view. Clicking "Advanced" view will add the "Snapshots" and "Disks" tabs to the menu bar.
es: El menú "Vista" le permite seleccionar una vista "Básica" o "Avanzada". Presionando en la vista "Avanzada" añadirá las pestañas "Snapshots" y "Discos" a la barra de menú.

source: If you click the "Configure" button, or if you checked the box to "Proceed directly to the advanced configuration options" in the wizard, the screen shown in :numref:`Figure %s: Modifying the Snapshot Schedule <lpreserver7a>` will open.
es: Si presiona el botón "Configurar", o si selecciona la casilla para "Proceder directamente a las opciones de configuración avanzada" en el asistente, la pantalla mostrada en la :numref:`Figura %s: Modificando la Programación del Snapshot <lpreserver7a>` se abrirá.

source: The "Local Snapshots" tab can be used to modify the schedule and pruning options on the local system. In other words, this is how often backups occur and how long to keep them. To configure a list of datasets to exclude from the snapshot, click the "+" button which will display the list of available datasets. Select a dataset to add it to the "Excluded" section. Repeat for any datasets that you do not wish to backup. To remove a dataset from the excluded list, so that it is added back to the snapshot schedule, highlight its entry in the "Excluded" section and click the "-" button.
es: La pestaña "Snapshots Locales" se puede usar para modificar la programación y las opciones de limpieza en el disco local. En otras palabras, ésto es con qué frecuencia ocurrirán los respaldos y cuánto tiempo se guardarán. Para configurar una lista de datasets a excluir del snapshot, presione en el botón "+", el cual mostrará la lista de datasets disponibles. Seleccione un dataset para añadirlo a la sección de "Excluidos". Repita para todos los datasets que no quiera respaldar. Para eliminar un dataset de la lista de excluidos, para que sea añadido nuevamente a la programación del snapshot, seleccione su entrada en la sección de "Excluidos" y presione el botón "-".

source: The "Replication" tab, is shown in :numref:`Figure %s: Configuring Replication <lpreserver22>`.
es: La pestaña "Replicación", se muestra en la :numref:`Figura %s: Configurando la Replicación <lpreserver22>`.

source: If you wish to keep a copy of the snapshots on another system, this screen is used to indicate which system to send the snapshots to. Life Preserver supports two replication schemes:
es: Si desea guardar una copia de los snapshots en otro sistema, esta pantalla se usa para indicar a qué sistema enviar los snapshots. Life Preserver soporta dos esquemas de replicación:

source: Replication to another system which is running the same version of ZFS and has SSH enabled. When this method is used, the replicated data is sent over an encrypted connection but is stored unencrypted on the other system. Refer to :ref:`Replication over SSH` for an example configuration.
es: Replicación a otro sistema que ejecuta la misma versión de ZFS y tiene habilitado SSH. Cuando este método es usado, los datos replicados se envían a través de una conexión encriptada pero se almacenan de forma no encriptada en el otro sistema. Consulte :ref:`Replicación a través de SSH` para ver un ejemplo de configuración.

source: Replication to an iSCSI target. This method provides the most security as the replicated data is sent over an encrypted connection and the data is stored in an encrypted format. The remote system does not need to be formatted with ZFS but it must understand kernel iSCSI and stunnel must be installed. Refer to :ref:`Replicating Encrypted Backups` for an example configuration.
es: Replicación a un destino iSCSI. Este método proporciona la mayor seguridad ya que los datos replicados se envían a través de una conexión encripatada y los datos se almacenan en un formato encriptado. El sistema remoto no necesita estar formateado con ZFS pero debe comprender iSCSI en el kernel y stunnel debe estar instalado. Consulte :ref:`Replicando Respaldos Encriptados` para ver un ejemplo de configuración.

source: To exclude datasets from the snapshot from being replicated to the remote system, click the "Excluded Data" tab. This will let you create an exclude list as described in the "Local Snapshots" tab.
es: Para excluir datasets del snapshot para que no sean replicados al sistema remoto, presione la pestaña "Datos Excluidos". Esto le permitirá crear una lista de exclusión como se describe en la pestaña "Snapshots Locales".

source: datasets which are excluded in the "Local Snapshots" tab are not backed up at all, and thus cannot be replicated. However, you do not have to replicate every dataset in the backup as you can use :menuselection:`Replication --> Excluded Data` to configure which datasets to exclude from the replication.
es: Los datasets que son excluidos en la pestaña "Snapshots Locales" no se respaldarán en absoluto, y no se podrán replicar. Sin embargo, no tiene qué replicar cada dataset en el respaldo ya que puede usar :menuselection:`Replicación --> Datos Excluidos` para configurar qué datasets excluir de la replicación.

source: The "Scrub" tab, shown in :numref:`Figure %s: Modifying the Scrub Schedule <lpreserver23>`, can be used to modify the scrub schedule. It is a good idea to create a scrub schedule to verify the integrity of the ZFS pool. Typically, it is recommended to run a scrub once a week or before adding more disks to a pool. The status and results of a running scrub can be viewed from the command line by typing :command:`zpool status`. When viewing the results of the scrub, check to see if there were any errors, as this is typically an early indication of a failing disk. If you are getting errors, consider backing up your data and replacing the failing disk. Since a scrub is I/O intensive, it is recommended to schedule the scrub when the system is not in use, such as the early morning hours. Depending upon the size of the pool, the scrub may take some time.
es: La pestaña "Scrub", mostrada en la :numref:`Figura %s: Modificando la Programación de Scrub <lpreserver23>`, puede usarse para modificar la programación de scrub. Es una buena idea crear un calendario de scrubs para verificar la integridad del pool ZFS. Típicamente, se recomienda correr un scrub una vez a la semana o antes de añadir más discos al pool. El estado y resultados de un scrub en ejecución se puede ver desde la línea de comandos ingresando :command:`zpool status`. Cuando vea los resultados del scrub, revise si hubieron algunos errores, ya que esto es una indicación temprana de un disco que está fallando. Si está obteniendo errores, considere respaldar sus datos y reemplazar el disco defectuoso. Ya que un scrub es intensivo en recursos de I/O, se recomienda programar el scrub cuando el sistema no esté en uso, como en las primeras horas de la mañana. Dependiendo del tamaño del pool, el scrub puede tomar algo de tiempo.

source: The "Restore Data" tab, seen in :numref:`Figure %s: Viewing the Contents of the Snapshots <lpreserver8>`, is used to view the contents of the local snapshots. This allows you to easily restore any file which has been modified or deleted since a snapshot occurred.
es: La pestaña "Restaurar Datos", mostrada en la :numref:`Figura %s: Viendo el Contenido de los Snapshots <lpreserver8>`, se usa para ver los contenidos de los snapshots locales. Esto le permite fácilmente restaurar cualquier archivo que ha sido modificado o eliminado desde que ocurrió el snapshot.
