Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: In this example, the system has been configured to make a snapshot every 5 minutes. Since files have been modified on this system, the blue time slider bar indicates that several snapshots are available as a snapshot only occurs if changes have been made within the scheduled time increment. Click the arrows to go back or forward one snapshot at a time. Alternately, click the slider until you are viewing the desired time of the snapshot.
es: En este ejemplo, el sistema ha sido configurado para hacer un snapshot cada 5 minutos. Puesto que los archivos se han modificado en este sistema, la barra de tiempo deslizable azul indica que algunos snapshots están disponibles ya que un snapshot solo se produce si se han hecho cambios dentro del incremento de tiempo programado. Presione las flechas para avanzar o retroceder un snapshot a la vez. Alternativamente, presione el deslizador hasta que vea el tiempo deseado del snapshot.

source: Once you have selected the desired date and time, use the drop-down menu to select the portion of the filesystem to view. In this example, the user has selected :file:`/usr/home/dru` as that is the user's home directory. The user can now expand the directory names to view the files within each directory.
es: Una vez que haya seleccionado el día y la hora deseados, use el menú desplegable para seleccionar la porción del sistema de archivos que quiera ver. En este ejemplo, el usuario ha seleccionado :file:`/usr/home/dru` puesto que es su directorio personal. El usuario puede ahora expandir los nombres de los directorios para ver los archivos que hay en cada directorio.

source: If your intent is to restore an earlier version of a file or a file that has been deleted, go back to the desired date and time, highlight the file, and click the "Restore" button. A copy of that file as it appeared at that point in time will be created in the same directory, with :file:`-reversion#` added to the filename. This way, any current version or restored version of the file will never be overwritten.
es: Si su intención es restaurar una versión anterior de un archivo o un archivo que ha sido eliminado, retroceda al día y hora deseados, seleccione el archivo y presione el botón "Restaurar". Una copia de ese archivo tal como aparecía en ese punto en el tiempo se creará en el mismo directorio, con :file:`-reversion#` añadido al nombre del archivo. De esta manera, cualquier versión actual o restaurada del archivo nunca se sobrescribirá.

source: The "File" menu contains the following options:
es: El menú "Archivo" contiene las siguientes opciones:

source: **Manage Pool:** this will be greyed out if you have already configured your ZFS pool. If you have a second ZFS pool, you can select this option in order to start the Life Preserver Configuration Wizard for that pool.
es: **Administrar Pool:** esto se atenuará si ya ha configurado su pool ZFS. Si tiene un segundo pool ZFS, puede seleccionar esta opción para iniciar el Asistente de Configuración de Life Preserver para ese pool.

source: **Unmanage Pool:** if you wish to disable ZFS snapshots, select the ZFS pool name. Pop-up menus will ask if you are sure and then ask if you also want to delete the local snapshots from the system. If you choose to delete these snapshots, you will lose all of the older versions of the files contained in those backups. Once you have unmanaged a pool, you will need to use "Manage Pool" to rerun the Life Preserver Configuration Wizard for that pool.
es: **Pool Sin Administración:** si desea deshabilitar snapshots ZFS, seleccione el nombre del pool ZFS. Un menú emergente le preguntará si está seguro y después le preguntará si también quiere borrar los snapshots locales del sistema. Si elige eliminar estos snapshots, perderá todas las versiones anteriores de los archivos contenidos en esos respaldos. Una vez que haya dejado de administrar un pool, necesitará usar "Administrar Pool" para reiniciar el Asistente de Configuración de Life Preserver para ese pool.

source: **Save Key to USB:** when you configure the replication of local snapshots to a remote system, you should immediately copy the automatically generated SSH key to a USB stick. Insert a FAT32 formatted USB stick and wait for :ref:`Mount Tray` to mount it. Then, click this option to copy the key.
es: **Guardar Llave en un USB:** cuando configure la replicación de snapshots locales a un sistema remoto, debería copiar inmediatamente la llave SSH generada automáticamente a una memoria USB. Inserte la memoria USB formateada con FAT32 y espere a que la :ref:`Bandeja de Montaje` la monte. Entonces, presione esta opción para copiar la llave.

source: **Close Window:** closes the Life Preserver window. However, Life Preserver will continue to reside in the system tray.
es: **Cerrar Ventana:** cierra la ventana de Life Preserver. Sin embargo, Life Preserver continuará estando en la bandeja de sistema.

source: The "Classic Backups" menu can be used to create an as-needed tarball of the user's home directory. This can be handy if you would like to make a backup of just your home directory in order to restore it in another directory or on another system.
es: El menú "Respaldos Clásicos" se puede usar para crear archivos tarball bajo demanda del directorio personal del usuario. Esto puede ser útil si quiere hacer una copia de seguridad de su directorio personal para restaurarlo en otro directorio o en otro sistema.

source: To make a tar backup, click :menuselection:`Classic Backups --> Compress Home Dir` and select the name of the user. This will open the screen shown in :numref:`Figure %s: Backing Up a User's Home Directory <lpreserver9>`.
es: Para hacer un respaldo tar, presione :menuselection:`Respaldos Clásicos --> Comprimir Directorio Personal` y seleccione el nombre del usuario. Esto abrirá la pantalla mostrada en la :numref:`Figura %s: Respaldando el Directorio Personal de un Usuario <lpreserver9>`.

source: If you want, you can change the filename of the archive to create. By default it will be in the format *username-YYYYMMDD-HHMM*. This screen also allows you to define which files to exclude from the backup. By default, it will exclude PBI shortcuts and, if it exists, the :file:`/bin` directory in the user's home directory. To exclude a specific file, click the white file icon to browse to the location of the file. To exclude a specific directory, click the blue directory icon to browse to the location of the directory.
es: Si quiere, puede cambiar el nombre el archivo que se va a crear. Por defecto tendrá el formato *nombredeusuario-YYYYMMDD-HHMM*. Esta pantalla también le permite definir qué archivos excluir del respaldo. Por defecto, se excluirán los accesos directos de los PBI y, si existe, el directorio :file:`/bin` del directorio personal del usuario. Para excluir un archivo en específico, presione el icono de archivo en blanco para buscar la localización del archivo. Para excluir un directorio en específico, presione el icono de carpeta azul para buscar la localización del directorio.

source: Press "Start" to start the backup. A progress bar will indicate the status and size of the backup. Once the backup is complete, click the "Finished" button to exit this screen.
es: Presione "Comenzar" para iniciar el respaldo. Una barra de progreso le indicará el estado y tamaño del respaldo. Una vez que se haya completado el respaldo, presione el botón "Terminado" para salir de esta pantalla.

source: Use :menuselection:`Classic Backups --> Extract Home Dir` to restore a previously made home directory backup. **Be sure this is what you want to do before using this option, as it will overwrite the current contents of the user's home directory.** If your goal is to restore files without destroying the current versions, use the "Restore Data" tab instead.
es: Use :menuselection:`Respaldos Clásicos --> Extraer Directorio Personal` para restaurar un respaldo previamente hecho del directorio personal. **Asegúrese de que esto es lo que quiere hacer antes de usar esta opción, ya que reescribirá el contenido actual del directorio personal del usuario.** Si su propósito es restaurar archivos sin destruir las versiones actuales, use en su lugar la pestaña "Restaurar Datos".

source: The "Snapshots" menu allows you to manage snapshots and replication outside of their configured schedules. If this menu is not visible, click :menuselection:`View -->Advanced` to enable it.
es: El menú de "Snapshots" le permite administrar snapshots y replicaciones fuera de sus calendarios programados. Si este menú no es visible, presione en :menuselection:`Ver -->Avanzado` para habilitarlo.

source: The "Snapshots" menu contains these options:
es: El menú "Snapshots" contiene estas opciones:

source: **New Snapshot:** click this button to create a snapshot now, instead of waiting for the schedule. For example, you can create a snapshot before making changes to a file, so that you can preserve a copy of the previous version of the file. Or, you can create a snapshot as you make modifications to the system configuration. When creating a snapshot, a pop-up message will prompt you to input a name for the snapshot, allowing you to choose a name that is useful in helping you remember why you took the snapshot.
es: **Nuevo Snapshot:** presione este botón para crear un snapshot ahora, en vez de esperar a la programación. Por ejemplo, puede crear un snapshot antes de hacer cambios a un archivo, de manera que pueda conservar una copia de la versión previa del archivo. O, puede crear un snapshot mientras va haciendo modificaciones a la configuración del sistema. Cuando cree un snapshot, un mensaje emergente le pedirá que introduzca un nombre para el snapshot, permitiéndole elegir un nombre que sea útil para ayudarle a recordar por qué tomó el snapshot.

source: **Delete Snapshot:** selecting this option will display the list of locally stored snapshots, listed in order from the oldest to the newest. If you select a snapshot, a warning will remind you that this is a permanent change that can not be reversed. In other words, the versions of files at that point in time will be lost.
es: **Eliminar Snapshot:** seleccionando esta opción le mostrará la lista de los snapshots almacenados localmente, listados en orden desde el más antiguo al más reciente. Si selecciona un snapshot, una advertencia le recordará que esto es un cambio permanente que no se puede revertir. En otras palabras, las versiones de los archivos en ese punto del tiempo se perderán.

source: **Start Replication:** this option will be greyed out if you have not yet configured replication to a remote server. To force a replication to a configured backup server, select the IP address of the remote system to start a replication now, rather than waiting for the scheduled time.
es: **Comenzar Replicación:** esta opción estará atenuada si aún no ha configurado la replicación a un servidor remoto. Para forzar la replicación a un servidor de respaldo configurado, seleccione la dirección IP del sistema remoto para comenzar la replicación ahora, en vez de esperar al tiempo programado.

source: **Re-Initialize Replications:** if a replication fails, it may prevent subsequent replications from completing successfully. In this case, select this option and select the IP address of the remote system in order to reset replication. After performing this re-initialization, click "Start Replication" to confirm that the replication issue has been resolved and snapshots are successfully replicating.
es: **Reinicializar Replicaciones:** si una replicación falla, podría impedir que las siguientes replicaciones se completen con éxito. En este caso, seleccione esta opción y seleccione la dirección IP del sistema remoto para reiniciar la replicación. Tras realizar esta reinicialización, presione "Comenzar Replicación" para confirmar que el problema con la replicación ha sido resuelto y los snapshots se están replicando con éxito.

source: The "Disks" menu provides the same functionality of :ref:`Mirroring the System to a Local Disk`, but from the GUI rather than the command line. You should read that section before attempting to use any of the disk options in this menu. It also lets you start and stop a ZFS scrub. If this menu is not visible, click :menuselection:`View -->Advanced` to enable it.
es: El menú "Discos" proporciona la misma funcionalidad que :ref:`Haciendo una Copia del Sistema en un Disco Local`, pero desde la GUI en vez que desde la línea de comandos. Debería leer esa sección antes de intentar usar cualquiera de las opciones de disco en este menú. También le permite iniciar y parar un scrub ZFS. Si este menú no está visible, presione :menuselection:`Ver -->Avanzado` para habilitarlo.

source: The following options available in the "Disks" menu:
es: Las siguientes opciones están disponibles en el menú "Discos":

source: **Attach Disk:** if you wish to mirror another internal disk or an inserted external USB disk, select this option. The disk must be at least the same size as the PC-BSD® disk and you must be willing to have that disk be re-formatted. **Do not select this option if you have any data on the disk that you wish to keep.** This option is the GUI front-end to the :command:`lpreserver zpool attach` command.
es: **Conectar Disco:** si desea hacer la copia en otro disco interno o en una memoria USB externa, seleccione esta opción. El disco debe ser al menos del mismo tamaño que el disco PC-BSD® y debe estar dispuesto a reformatear el disco. **No seleccione esta opción si tiene cualquier dato en el disco que desee conservar.** Esta opción es el front-end gráfico para el comando :command:`lpreserver zpool attach`.

source: **Detach Disk:** if you wish to remove an attached disk from the mirror, use this option. This option is the GUI front-end to the :command:`lpreserver zpool detach` command.
es: **Desconectar Disco:** si desea extraer un disco conectado del mirror, use esta opción. Esta opción es el front-end gráfico para el comando :command:`lpreserver zpool detach`.

source: **Set Disk Online/Offline:** if you need to temporarily disconnect or reconnect an attached external USB drive, select the appropriate option. This is the GUI equivalent to running :command:`lpreserver zpool offline` or :command:`lpreserver zpool online`.
es: **Establecer Disco Conectado/Desconectado:** si necesita desconectar temporalmente o reconectar una memoria externa USB insertada, seleccione la opción apropiada. Esta es la interfaz gráfica equivalente a ejecutar :command:`lpreserver zpool offline` o :command:`lpreserver zpool online`.

source: **Start/Stop Scrub:** this option allows you to manually start a scrub now rather than waiting for the scrub schedule. If a scrub is currently running, you can stop it. Note that when you stop a scrub, it will need to start all over again the next time it is run.
es: **Comenzar/Parar Scrub:** esta opción le permite comenzar manualmente un scrub ahora en vez de esperar calendario programado del scrub. Si un scrub está corriendo, puede pararlo. Note que cuando detenga un scrub, necesitará comenzar de nuevo la siguiente vez que se ejecute.

source: Replication over SSH
es: Replicación a través de SSH

source: Life Preserver can be configured to replicate snapshots to another system over an encrypted SSH connection. For this configuration, the remote system to hold a copy of the snapshots must meet the following requirements:
es: Life Preserver se puede configurar para replicar snapshots a otro sistema a través de una conexión SSH encriptada. Para esta configuración, el sistema remoto, para que mantenga una copia de los snapshots, debe cumplir los siguientes requerimientos:

source: The backup server **must be formatted with the latest version of ZFS,** also known as ZFS feature flags or ZFSv5000. Operating systems that support this version of ZFS include PC-BSD®, FreeBSD 9.2 or higher, and FreeNAS 9.1.x or higher.
es: El servidor de respaldo **debe estar formateado con la última versión de ZFS,** también conocido como ZFS feature flags o ZFSv5000. Los sistemas operativos que soportan esta versión de ZFS incluyen PC-BSD®, FreeBSD 9.2 o superior, y FreeNAS 9.1.x o superior.

source: That system must have SSH installed and the SSH service must be running. If the backup server is running PC-BSD®, SSH is already installed and you can start SSH using :ref:`Service Manager`. If that system is running FreeNAS® or FreeBSD, SSH is already installed, but you will need to start SSH.
es: Ese sistema debe tener SSH instalado y el servicio SSH debe estar corriendo. Si el servidor de respaldo está ejecutando PC-BSD®, SSH está ya instalado y usted puede iniciar SSH usando el :ref:`Administrador de Servicios`. Si ese sistema está corriendo FreeNAS® o FreeBSD, SSH está ya instalado, pero necesitará iniciar SSH.

source: If the backup server is running PC-BSD®, you will need to open TCP port 22 (SSH) using :ref:`Firewall Manager`. If the server is running FreeBSD and a firewall has been configured, add a rule to open this port in the firewall ruleset. FreeNAS® does not run a firewall by default. Also, if there is a network firewall between the PC-BSD® system and the backup system, make sure it has a rule to allow SSH.
es: Si el servidor de respaldo está corriendo PC-BSD®, necesitará abrir el puerto TCP 22 (SSH) usando el :ref:`Administrador del Cortafuegos`. Si el servidor está corriendo FreeBSD y se ha configurado un cortafuegos, añada una regla para abrir este puerto en el conjunto de reglas del cortafuegos. FreeNAS® no ejecuta un cortafuegos por defecto. Además, si hay un cortafuegos entre el sistema PC-BSD® y el sistema de respaldo, asegúrese de tener una regla para permitir SSH.

source: this configuration does not store the backup itself in an encrypted format. If you require that functionality, or prefer to backup to a system that is not formatted with ZFS, refer to :ref:`Replicating Encrypted Backups`.
es: Esta configuración, por sí misma, no almacena el respaldo en un formato encriptado. Si usted necesita esa funcionalidad, o prefiere respaldar a un sistema que no está formateado con ZFS, consulte :ref:`Replicando Respaldos Encriptados`.

source: The rest of this section demonstrates how to configure a FreeNAS® system as the remote backup server.
es: El resto de esta sección demuestra cómo configurar un sistema FreeNAS® como un servidor remoto de respaldo.

source: Replication to a FreeNAS® System
es: Replicación a un Sistema FreeNAS®

source: `FreeNAS® <http://www.freenas.org/>`_ is an open source Networked Attached Storage (NAS) operating system based on FreeBSD. This operating system is designed to be installed onto a USB stick so that it is kept separate from the storage disk(s) installed on the system. You can download the latest STABLE version of FreeNAS® 9.3 from `download.freenas.org <http://download.freenas.org/9.3/STABLE/>`_ and read its documentation at `doc.freenas.org <http://doc.freenas.org/9.3/>`_.
es: `FreeNAS® <http://www.freenas.org/>`_ es un sistema operativo Networked Attached Storage (NAS) de código abierto basado en FreeBSD. Este sistema operativo está diseñado para ser instalado en una memoria USB de manera que se mantenga separado de los discos de almacenamiento instalados en el sistema. Puede descargar la última versión ESTABLE de FreeNAS® 9.3 desde `download.freenas.org <http://download.freenas.org/9.3/STABLE/>`_ y lea su documentación en `doc.freenas.org <http://doc.freenas.org/9.3/>`_.

source: This section demonstrates how to configure FreeNAS® 9.3 as the backup server for Life Preserver to replicate to. It assumes that you have already installed this version of FreeNAS® using the installation instructions in the `FreeNAS® 9.3 Users Guide <http://doc.freenas.org/9.3/freenas_install.html>`_ and are able to access the FreeNAS® system from a web browser.
es: Esta sección demuestra cómo configurar FreeNAS® 9.3 como un servidor de respaldo para que Life Preserver replique en él. Asume que usted ya tiene instalada esta versión de FreeNAS® usando las instrucciones de instalación de la `Guía del Usuario de FreeNAS® 9.3 <http://doc.freenas.org/9.3/freenas_install.html>`_ y es capaz de acceder al sistema FreeNAS® desde un navegador web.

source: In order to prepare the FreeNAS® system to store the backups created by Life Preserver, you will need to create a ZFS pool, create and configure the dataset to store the backups, create a user account that has permission to access that dataset, and enable the SSH service.
es: Para preparar el sistema FreeNAS® para almacenar los respaldos creados por Life Preserver, necesitará crear un pool ZFS, crear y configurar el dataset para almacenar los respaldos, crear una cuenta de usuario que tenga permiso para accesar al dataset, y habilitar el servicio SSH.

source: In the example shown in :numref:`Figure %s: Creating a ZFS Volume in FreeNAS® <lpreserver10>`, the user has clicked :menuselection:`Storage --> Volumes --> Volume Manager` in order to create a ZFS pool to hold the backups.
es: En el ejemplo mostrado en la :numref:`Figura %s: Creando un Volumen ZFS en FreeNAS® <lpreserver10>`, el usuario ha presionado :menuselection:`Almacenamiento --> Volúmenes --> Administrador de Volumen` para crear un pool ZFS para contener los respaldos.

source: Input a "Volume Name", drag the slider to select the desired number of available disks, and click the "Add Volume" button. The Volume Manager will automatically select the optimal layout for both storage capacity and redundancy. In this example, a RAIDZ2 named *volume1* will be created.
es: Introduzca un "Nombre de Volumen", arrastre el deslizador para seleccionar el número deseado de discos disponibles, y presione el botón "Añadir Volumen". El Administrador de Volumen seleccionará automáticamente el esquema óptimo tanto para capacidad de almacenamiento como para redundancia. En este ejemplo, se creará un RAIDZ2 llamado "volume1".

source: make sure that the size of the pool is large enough to hold the replicated snapshots. To determine the size of the initial snapshot, run :command:`zpool list` on the PC-BSD® system and look at the value in the "ALLOC" field. Subsequent snapshots will be smaller and will be the size of the data that has changed.
es: Asegúrese de que el tamaño del pool es lo suficientemente grande para contener los snapshots replicados. Para determinar el tamaño del snapshot inicial, ejecute :command:`zpool list` en el sistema PC-BSD® y revise el valor en el campo "ALLOC". Los snapshots posteriores serán más pequeños y tendrán el tamaño de los datos que hayan cambiado.

source: To create the dataset to backup to, click the "+" next to the entry for the newly created volume, then click "Create ZFS Dataset". In the example shown in :numref:`Figure %s: Creating a ZFS Dataset in FreeNAS® <lpreserver11>`, the "Dataset Name" is *backups*. Click the "Add Dataset" button to create the dataset.
es: Para crear el dataset al cual respaldar, presione el "+" junto a la entrada para el recién creado volumen, entonces presione "Crear Dataset ZFS". En el ejemplo mostrado en la :numref:`Figura %s: Creando un Dataset ZFS en FreeNAS® <lpreserver11>`, el "Nombre del Dataset" es *backups*. Presione el botón "Añadir Dataset" para crear el dataset.
