Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: **WPA Enterprise:** if you click "WPA Enterprise" then the "Configure" button, you will see the screen shown in :numref:`Figure %s: WPA Enterprise Security Settings <network10>`. Select the authentication method ("EAP-TLS", "EAP-TTLS", or "EAP-PEAP"), input the EAP identity, browse for the CA certificate, client certificate and private key file, and input and verify the password.
es: **WPA Empresarial:** si presiona "WPA Empresarial" y luego el botón "Configurar", verá la pantalla mostrada en la :numref:`Figura %s: Configuraciones de Seguridad de WPA Empresarial <network10>`. Seleccione el método de autenticación ("EAP-TLS", "EAP-TTLS", o "EAP-PEAP"), ingrese la identidad EAP, busque el certificado CA, certificado del cliente y el archivo de llave privada, e ingrese y verifique la contraseña.

source: if you are unsure which type of encryption is being used, ask the person who setup the wireless router. They should also be able to give you the value of any of the settings seen in these configuration screens.
es: Si no está seguro de qué tipo de encriptación se está usando, pregunte a la persona que configuró el ruteador inalámbrico. También deberían poder proporcionarle el valor de cualquier de los ajustes que se ven en estas pantallas de configuración.

source: If you wish to disable this wireless interface, check the box "Disable this wireless device". This setting can be desirable if you want to temporarily prevent the wireless interface from connecting to untrusted wireless networks.
es: Si desea deshabilitar esta interfaz inalámbrica, seleccione la casilla "Deshabilite este dispositivo inalámbrico". Esta configuración puede ser deseable si quiere evitar temporalmente que la interfaz inalámbrica se conecte a redes inalámbricas que no sean de confianza.

source: The "Advanced" tab, seen in :numref:`Figure %s: Advanced Tab of a Wireless Interface <network11>`, allows you to configure the following:
es: La pestaña "Avanzado", mostrada en la :numref:`Figura %s: Pestaña Avanzado de una Interfaz Inalámbrica <network11>`, le permite configurar lo siguiente:

source: a custom MAC address. This setting is for advanced users and requires the "Use hardware default MAC address" box to be unchecked.
es: Una dirección MAC personalizada. Este ajuste es para usuarios avanzados y requiere que la casilla "Usar dirección MAC predetermianda del hardware" esté desmarcada.

source: how the interface receives its IP address information. If the network contains a DHCP server, check the box "Obtain IP automatically (DHCP)". Otherwise, input the IP address and subnet mask to use on the network.
es: Cómo recibe la interfaz su información de la dirección IP. Si la red contiene un servidor DHCP, seleccione la casilla "Obtener una IP automáticamente (DHCP)". De otra manera, introduzca la dirección IP y la máscara de subred que se usará en la red.

source: the country code. This setting is not required if you are in North America. For other countries, check the "Set Country Code" box and select your country from the drop-down menu.
es: El código del país. Este ajuste no se requiere si está en Norte América. Para otros países, seleccione la casilla "Establecer el Código del País" y seleccione su país del menú desplegable.

source: The "Info" tab, seen in :numref:`Figure %s: Info Tab of a Wireless Interface <network12>`, shows the current network status and statistics for the wireless interface.
es: La pestaña "Información", mostrada en la :numref:`Figura %s: Pestaña Información de una Interfaz Inalámbrica <network12>`, muestra el estado actual de la red y estadísticas para la interfaz inalámbrica.

source: Network Configuration (Advanced)
es: Configuración de Red (Avanzada)

source: The "Network Configuration (Advanced)" tab of the Network Configuration utility is seen in :numref:`Figure %s: Network Configuration (Advanced) tab of the Network Configuration Utility <network13a>`. The displayed information is for the currently highlighted interface. If you wish to edit these settings, make sure that the interface that you wish to configure is highlighted in the "Devices" tab.
es: La pestaña "Configuración de Red (Avanzada)" de la utilería Configuración de Red se muestra en la :numref:`Figura %s: Pestaña Configuración de Red (Avanzada) de la Utilería de Configuración de Red <network13a>`. La información desplegada es para la interfaz actualmente seleccionada. Si quiere editar estas configuraciones, asegúrese que la interfaz que quiere configurar esté seleccionada en la pestaña "Dispositivos".

source: If the interface receives its IP address information from a DHCP server, this screen allows you to view the received DNS information. If you wish to override the default DNS settings or set them manually, check the "Enable Custom DNS" box. You can then set the following:
es: Si la interfaz recibe su información de dirección IP desde un servidor DHCP, esta pantalla le permite ver la información DNS recibida. Si desea reemplazar los valores DNS predeterminados o establecerlos manualmente, seleccione la casilla "Habilitar DNS Personalizado". Después puede establecer lo siguiente:

source: **DNS 1:** the IP address of the primary DNS server. If you do not know which IP address to use, click the "Public servers" button to select a public DNS server.
es: **DNS1:** la dirección IP del servidor primario DNS. Si no sabe qué dirección IP emplear, presione el botón "Servidores públicos" para seleccionar un servidor DNS público.

source: **DNS 2:** the IP address of the secondary DNS server.
es: **DNS2:** la dirección IP del servidor DNS secundario.

source: **Search Domain:** the name of the domain served by the DNS server.
es: **Buscar Dominio:** el nombre del dominio proporcionado por el servidor DNS.

source: If you wish to change or set the default gateway, check the "Enable Custom Gateway" box and input the IP address of the default gateway.
es: Si desea cambiar o establecer la puerta de enlace por defecto, seleccione la casilla "Habilitar Puerta de Enlace Personalizada" e introduzca la dirección IP de la puerta de enlace por defecto.

source: The following settings can be modified in the IPv6 section:
es: Los siguientes ajustes se pueden modificar en la sección IPv6:

source: **Enable IPv6 support:** if this box is checked, the specified interface can participate in IPv6 networks.
es: **Habilitar soporte IPv6:** si esta casilla está marcada, la interfaz especificada puede participar en redes IPv6.

source: **IPv6 gateway:** the IPv6 address of the default gateway used on the IPv6 network.
es: **Puerta de enlace IPv6:** la dirección IPv6 de la puerta de enlace por defecto usada en la red IPv6.

source: **IPv6 DNS 1:** the IPv6 address of the primary DNS server used on the IPv6 network. If you do not know which IP address to use, click the "Public servers" button to select a public DNS server.
es: **IPv6 DNS 1:** la dirección IPv6 del servidor DNS primario usado en la red IPv6. Si no sabe qué dirección IP usar, presione el botón "Servidores públicos" para seleccionar un servidor DNS público.

source: **IPv6 DNS 2:** the IPv6 address of the secondary DNS server used on the IPv6 network.
es: **IPv6 DNS 2:** la dirección IPv6 del servidor DNS secundario usado en la red IPv6.

source: The "Misc" section allows you to configure these options:
es: La sección "Misceláneos" le permite configurar estas opciones:

source: **System Hostname:** the name of your computer. It must be unique on your network.
es: **Nombre del Sistema:** el nombre de su equipo. Debe ser único en su red.

source: **Enable wireless/wired failover via lagg0 interface:** the interface allows you to seamlessly switch between using an Ethernet interface and a wireless interface. If you want this functionality, check this box.
es: **Habilitar failover de redes inalámbricas/por cable vía interfaz lagg0:** la interfaz permite cambiar transparentemente entre usar una interfaz Ethernet y una interfaz inalámbrica. Si quiere esta funcionalidad seleccione esta casilla.

source: some users experience problems using lagg. If you have problems connecting to a network using an interface that previously worked, uncheck this box and remove any references to "lagg" in your :file:`/etc/rc.conf` file.
es: Algunos usuarios sufren problemas cuando usan lagg. Si tiene problemas conectándose a una red usando una interfaz que funcionaba previamente, seleccione esta casilla y elimine cualquier referencia a "lagg" en su archivo :file:`/etc/rc.conf`.

source: **Domain Name:** if the system is in a domain, you can specify it here.
es: **Nombre de Dominio:** si el sistema está en un dominio, lo puede especificar aquí.

source: If you make any changes within this window, click the "Apply" button to apply them.
es: Si hace algunos cambios en esta ventana, presione el botón "Aplicar" para aplicarlos.

source: Proxy Settings
es: Configuraciones del Proxy

source: The "Proxy" tab, shown in :numref:`Figure %s: Proxy Settings Configuration <network14>`, is used when your network requires you to go through a proxy server in order to access the Internet.
es: La pestaña "Proxy", mostrada en la :numref:`Figura %s: Configuración de las opciones del Proxy <network14>`, se usa cuando su red requiere pasar por un servidor proxy para accesar a Internet.

source: Check the "Proxy Configuration" check box to activate the settings. The follow settings can be configured in this screen:
es: Seleccione la casilla "Configuración del Proxy" para activar la configuración. Las siguientes opciones se pueden configurar en esta pantalla:

source: **Server Address:** enter the IP address or hostname of the proxy server.
es: **Dirección del Servidor:** introduzca la dirección IP o el nombre del equipo del servidor proxy.

source: **Port Number:** enter the port number used to connect to the proxy server.
es: **Número del Puerto:** introduzca el número del puerto usado para conectarse al servidor proxy.

source: **Proxy Type:** choices are "Basic" (sends the username and password unencrypted to the server) and "Digest" (never transfers the actual password across the network, but instead uses it to encrypt a value sent from the server). Do not select "Digest" unless you know that the proxy server supports it.
es: **Tipo de Proxy:** las posibilidades son "Básico" (envía al servidor el nombre del usuario y la contraseña sin encriptar) e "Implícita" (nunca transfiere la contraseña a través de la red, sino que la usa para encriptar un valor enviado desde el servidor). No seleccione "Implícita" a menos que sepa que el servidor la soporta.

source: **Specify a Username/Password:** check this box and input the username and password if they are required to connect to the proxy server.
es: **Especificar un nombre de usuario/contraseña:** seleccione esta casilla e introduzca el nombre de usuario y contraseña si son requeridos para conectarse al servidor proxy.

source: Proxy settings are saved to the :file:`/etc/profile` and :file:`/etc/csh.cshrc` files so that they are available to the PC-BSD® utilities as well as any application that uses :command:`fetch`.
es: La configuración del Proxy se guarda en los archivos :file:`/etc/profile` y :file:`/etc/csh.cshrc` de manera que están disponibles para las utilerías de PC-BSD® así como para cualquier aplicación que use :command:`fetch`.

source: Applications that did not come with the operating system, such as web browsers, may require you to configure proxy support using that application's configuration utility.
es: Las aplicaciones que no vienen con el sistema operativo, tales como los navegadores web, pueden requerir que configure el soporte para el proxy usando esa utilería configuración de la aplicación.

source: If you apply any changes to this tab, a pop-up message will warn that you may have to logout and back in in order for the proxy settings to take effect.
es: Si aplica cualquier cambio a esta pestaña, un mensaje emergente le avisará de que puede tener que desconectarse y volverse a conectar para que la configuración del proxy tenga efecto.

source: Configuring a Wireless Access Point
es: Configurando un Punto de Acceso Inalámbrico.

source: If you click the entry for a wireless device, as seen in :numref:`Figure %s: Setup Access Point Option <network15>`, the right-click menu has an option to "Setup Access Point".
es: Si presiona la entrada para un dispositivo inalámbrico, como se muestra en la :numref:`Figura %s: Opción de Configuración de Punto de Acceso <network15>`, el menú de botón derecho tiene una opción para "Configurar el Punto de Acceso".

source: :numref:`Figure %s: Access Point Basic Setup <network16>` shows the configuration screen if you select "Setup Access Point".
es: La :numref:`Figura %s: Configuración Básica del Punto de Acceso <network16>` muestra la pantalla de configuración si selecciona "Configurar Punto de Acceso".

source: This screen contains two options:
es: Esta pantalla contiene dos opciones:

source: **Visible Name:** this is the name that will appear when users scan for available access points.
es: **Nombre Visible:** este es el nombre que aparecerá cuando los usuarios escaneen puntos de acceso disponibles.

source: **Set Password:** setting a WPA password is optional, though recommended if you only want authorized devices to use the access point. If used, the password must be a minimum of 8 characters.
es: **Establecer Contraseña:** establecer una contraseña WPA es opcional, aunque es recomendada si solo quiere dispositivos autorizados usen el punto de acceso. Si se emplea, la contraseña debe tener un mínimo de 8 caracteres.

source: :numref:`Figure %s: Access Point Advanced Setup <network17>` shows the "Advanced Configuration (optional)" screen.
es: La :numref:`Figura %s: Configuración Avanzada del Punto de Acceso <network17>` muestra la pantalla "Configuración Avanzada (opcional)".

source: The settings in this screen are optional and allow you to fine-tune the access point's configuration:
es: Las configuraciones en esta pantalla son opcionales y le permite ajustar la configuración del punto de acceso:

source: **Base IP:** the IP address of the access point.
es: **IP Base:** la dirección IP del punto de acceso.

source: **Netmask:** the associated subnet mask for the access point.
es: **Máscara de red:** la máscara de subred asociada para el punto de acceso.

source: **Mode:** available modes are *11g* (for 802.11g), *11ng* (for 802.11n on the 2.4-GHz band), or *11n* (for 802.11n).
es: **Modo:** los modos disponibles son *11g* (para 802.11g), *11ng* (para 802.11n en la banda de los 2.4-GHz), o *11n* (para 802.11n).

source: **Channel:** select the channel to use.
es: **Canal:** seleccionar el canal a usar.

source: **Country Code:** the two letter country code of operation.
es: **Código del País:** las dos letras del código del país en operación.

source: Troubleshooting Network Settings
es: Errores en la Configuración de Red

source: While Ethernet networking usually "just works" on a PC-BSD® system, users sometimes encounter problems, especially when connecting to wireless networks. Sometimes the problem is due to a configuration error; sometimes a driver is buggy or is not yet available. This section is meant to help you pinpoint the problem so that you can either fix it yourself or give the developers the information they need to fix or create the driver.
es: Si bien la red Ethernet "normalmente funciona" en un sistema PC-BSD®, los usuarios algunas veces se encuentran con problemas, especialmente mientras se conectan a redes inalámbricas. Algunas veces el problema se debe a un error de configuración; otras veces el controlador es defectuoso o no está disponible todavía. Esta sección está pensada para ayudarle a identificar el problema ya sea para que pueda arreglarlo usted mismo o dar a los desarrolladores la información necesaria para arreglarlo o crear el controlador.

source: When troubleshooting your network configuration, use the following files and commands.
es: Cuando intente solucionar problemas de su configuración de red, use los siguientes archivos y comandos.

source: The :file:`/etc/rc.conf` file is read when the system boots up. In order for the system to configure an interface at boot time, an entry must exist for it in this file. Entries are automatically created for you during installation for each interface that is active. An entry will be added (if it does not exist) or modified (if it already exists) when you configure an interface using the Network Configuration utility.
es: El archivo :file:`/etc/rc.conf` se lee cuando el sistema arranca. Para que el sistema configure una interfaz durante el arranque, una entrada para ella debe existir en este archivo. Las entradas se crean automáticamente durante la instalación de cada interfaz que está activa. Se añadirá una entrada (si no existe) o se modificará (si ya existe) cuando configure una interfaz usando la utilería de Configuración de Red.

source: Here is an example of the :file:`rc.conf` entries for an ethernet driver (*em0*) and a wireless driver (*run0*)::
es: Aquí tiene un ejemplo de las entradas :file:`rc.conf` para un controlador ethernet (*em0*) y un controlador inalámbrico (*run0*)::

source: When reading through your own file, look for lines that begin with *ifconfig*. For a wireless interface, also look for lines containing *wlans*.
es: Cuando lea su propio archivo, busque líneas que empiecen con *ifconfig*. Para una interfaz inalámbrica, busque también líneas que contengan *wlans*.

source: unlike Linux interface driver names, FreeBSD/PC-BSD® interface driver names indicate the type of chipset. Each driver name has an associated man page where you can learn which devices use that chipset and if there are any configuration options or limitations for the driver. When reading the man page, do not include the interface number. For the above example, you could read :command:`man em` and :command:`man run`.
es: Al contrario que los nombres de controladores de interfaces de Linux, los controladores de interfaces de FreeBSD/PC-BSD® indican el tipo de chipset. Cada nombre de controlador tiene una página del manual asociada donde puede conocer qué dispositivos emplean ese chipset y si hay algunas opciones de configuración o limitaciones para el controlador. Cuando lea la página del manual, no incluya el número de interfaz. Para el ejemplo anterior, podría leer :command:`man em` y :command:`man run`.

source: The :file:`/etc/wpa_supplicant.conf` file is used by wireless interfaces and contains the information needed to connect to a WPA network. If this file does not already exist, it is created for you when you enter the "Configuration" screen of a wireless interface.
es: El archivo :file:`/etc/wpa_supplicant.conf` es empleado por las interfaces inalámbricas y contiene la información necesaria para conectarse a una red WPA. Si este archivo no existe, se creará para usted cuando entre en la pantalla de "Configuración" de una interfaz inalámbrica.

source: The :command:`ifconfig` command shows the current state of your interfaces. When reading through its output, check that your interface is listed, has a status of "active", and has an IP address. Here is a sample :command:`ifconfig` output showing the entries for the *re0* Ethernet interface and the *run0* wireless interface::
es: El comando :command:`ifconfig` muestra el estado actual de sus interfaces. Cuando lea su salida, compruebe que su interfaz esté listada, tenga un estatus de "activa", y tenga una dirección IP. Aquí tiene un ejemplo de salida de :command:`ifconfig` mostrando las entradas de la interfaz Ethernet *re0* y de la interfaz inalámbrica *run0*::

source: In this example, the ethernet interface (*re0*) is active and has an IP address. However, the wireless interface (*run0*, which is associated with *wlan0*) has a status of "no carrier" and does not have an IP address. In other words, it has not yet successfully connected to the wireless network.
es: En este ejemplo, la interfaz ethernet (*re0*) está activa y tiene una dirección IP. Sin embargo, la interfaz inalámbrica (*run0*, que está asociada con *wlan0*) tiene un estatus de "sin operador" y no tiene una dirección IP. En otras palabras, todavía no se ha conectado exitosamente a una red inalámbrica.

source: The :command:`dmesg` command lists the hardware that was probed during boot time and will indicate if the associated driver was loaded. If you wish to search the output of this command for specific information, pipe it to :command:`grep` as seen in the following examples::
es: El comando :command:`dmesg` lista el hardware que se probó durante el inicio e indicará si los controladores asociados fueron cargados. Si desea buscar en la salida de este comando por información específica, mándelo a :command:`grep` como se ve en los siguientes ejemplos::

source: If your interface does not show up in :command:`ifconfig` or :command:`dmesg`, it is possible that a driver for this card is not provided with the operating system. If the interface is built into the motherboard of the computer, you can use the :command:`pciconf` command to find out the type of card::
es: Si su interfaz no aparece en :command:`ifconfig` o :command:`dmesg`, es posible que un controlador para esta tarjeta no se haya proporcionado con el sistema operativo. Si la interfaz está integrada a la tarjeta madre del equipo, puede usar el comando :command:`pciconf` para descubrir el tipo de tarjeta::

source: In this example, there is a built-in Ethernet device that uses a driver that supports the RTL8168/8111/8111c chipsets. As we saw earlier, that driver is *re0*. The built-in wireless device was also found but the *?* indicates that a driver for the RTL8191SE chipset was not found. A web search for "FreeBSD RTL8191SE" will give an indication of whether a driver exists (perhaps in a version of FreeBSD that has not been released yet) or if a driver is being developed.
es: En este ejemplo, hay un dispositivo Ethernet integrado que usa un controlador que soporta el chipset RTL8168/8111/8111c. Como vimos antes, ese controlador es *re0*. El dispositivo inalámbrico integrado también se encontró pero *?* indica que un controlador para chipset RTL8191SE no se encontró. Una búsqueda en la web para "FreeBSD RTL8191SE" le dará una indicación de si existe el controlador (quizá en una versión de FreeBSD que no se ha liberado todavía) o si el controlador se está desarrollando.

source: The FreeBSD Handbook chapter on `Wireless Networking <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/network-wireless.html>`_ provides a good overview of how wireless works and offers some troubleshooting suggestions.
es: El capítulo del Manual de FreeBSD sobre `Redes Inalámbricas <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/network-wireless.html>`_ proporciona un buena visión general de cómo trabajan las conexiones inalámbricas y ofrece sugerencias sobre cómo solucionar problemas.

source: The built-in Life Preserver utility was designed to take full advantage of the functionality provided by ZFS snapshots. This utility allows you to schedule snapshots of a local ZFS pool and to optionally replicate those snapshots to another system over an encrypted connection. This design provides several benefits:
es: La utilería integrada Life Preserver fue diseñada para aprovechar al máximo la funcionalidad proporcionada por los snapshots de ZFS. Esta utilería le permite planificar snapshots de un pool ZFS local y opcionalmente replicar esos snapshots a otros sistemas a través de una conexión encriptada. Este diseño ofrece varias ventajas:
