Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: PC-BSD® uses the `IPFW firewall <http://www.freebsd.org/cgi/man.cgi?query=ipfw>`_ to protect your system. By default, the firewall is configured to allow all outgoing connections, but to deny all incoming connection requests. The default rulebase is located in :file:`/etc/ipfw.rules`. Use the Firewall Manager GUI utility to view and modify the existing firewall rules.
es: PC-BSD® usa el `Cortafuegos IPFW <http://www.freebsd.org/cgi/man.cgi?query=ipfw>`_ para proteger su sistema. Por defecto, el cortafuegos está configurado para permitir todas las conexiones salientes, pero denegar todas las peticiones de conexión entrantes. La base de reglas predeterminadas se localiza en :file:`/etc/ipfw.rules`. Use la utilería GUI del Administrador del Cortafuegos para ver y modificar las reglas existentes del cortafuegos.

source: typically it is not necessary to change the firewall rules. You should only add rules if you understand the security implications of doing so, as any custom rules will be used to allow connections to your computer.
es: Típicamente no es necesario cambiar las reglas del cortafuegos. Solo debería añadir reglas si comprende las implicaciones en la seguridad al hacerlo, ya que cualquier regla personalizada se usará para permitir conexiones a su equipo.

source: To access the Firewall Manager, go to :menuselection:`Control Panel --> Firewall Manager` or type :command:`pc-su pc-fwmanager`. You will be prompted to input your password. :numref:`Figure %s: Firewall Manager Utility <firewall1>` shows the initial screen when you launch this utility.
es: Para accesar al Administrador del Cortafuegos, vaya a :menuselection:`Panel de Control --> Administrador del Cortafuegos` o ingrese :command:`pc-su pc-fwmanager`. Se le pedirá introducir su contraseña. La :numref:`Figura %s: Utilería del Administrador del Cortafuegos <firewall1>` muestra la siguiente pantalla cuando ejecuta esta utilería.

source: The "General" tab of this utility allows you to:
es: La pestaña "General" de esta utilería le permite:

source: Determine whether or not the firewall starts when the system boots. Unless you have a reason to do so and understand the security implications, the "Enable Firewall on startup" box should be checked so that your system is protected by the firewall.
es: Comprobar si el cortafuegos se inicia o no cuando el sistema arranca. A no ser que tenga una razón para hacerlo y comprenda las consecuencias para la seguridad, la casilla "Habilitar Cortafuegos durante el Inicio" debería estar marcada de manera que su sistema esté protegido por el cortafuegos.

source: "Start", "Stop", or "Restart" the firewall.
es: "Iniciar", "Parar", o "Reiniciar" el cortafuegos.

source: The "Restore Default Configuration" button allows you to return to the original, working configuration.
es: El botón "Restaurar la Configuración Predeterminada" le permite volver a la configuración que funcionaba originalmente.

source: To add or delete custom firewall rules, click the "Open Ports" tab to open the screen shown in :numref:`Figure %s: Adding a New Firewall Rule <firewall2>`. Note that your custom rules will allow **incoming** connections on the specified protocol and port number.
es: Para añadir o eliminar reglas personalizadas del cortafuegos, presione la pestaña "Abrir Puertos" para abrir la pantalla mostrada en la :numref:`Figura %s: Añadiendo una Nueva Regla al Cortafuegos <firewall2>`. Note que sus reglas personalizadas permitirán conexiones **entrantes** en el protocolo especificado y en el número de puerto.

source: Any rules that you create will appear in this screen. To add a rule, input the port number to open. By default, "tcp" is selected. If the rule is for the UDP protocol, click the "tcp" drop-down menu and select "udp". Once you have the protocol and port number selected, click the "Open Port" button to add the new rule to your custom list.
es: Cualquier regla que cree aparecerá en esta pantalla. Para añadir una regla, introduzca el número del puerto que se abrirá. Por defecto, "tcp" está seleccionado. Si la regla es para el protocolo UDP, presione el menú desplegable "tcp" y seleccione "udp". Una vez que tenga el protocolo y número de puerto seleccionados, presione el botón "Abrir Puerto" para añadir la nueva regla a su lista personalizada.

source: If you have created any custom rules and wish to delete one, highlight the rule to delete and click the "Close Selected Ports" button to remove it from the custom rules list.
es: Si ha creado reglas personalizadas y desea eliminar una, seleccione la regla a eliminar y presione el botón "Cerrar Puertos Seleccionados" para eliminarla de la lista de reglas personalizadas.

source: whenever you add or delete a custom rule, the rule will not be used until you click the "Restart" button shown in :numref:`Figure %s: Firewall Manager Utility <firewall1>`. Also, your custom rules are not used whenever the system is in :ref:`Tor Mode`.
es: Cuando añada o elimine una regla personalizada, la regla no será usada hasta que presione el botón "Reiniciar" mostrado en la :numref:`Figura %s: Utilería de Administración del Cortafuegos <firewall1>`. También, sus reglas personalizadas no se usan cuando el sistema está en :ref:`Modo Tor`.

source: Whenever you create a custom rule, test that your new rule works as expected. For example, if you create a rule to allow incoming SSH connections, try connecting to your PC-BSD® system using :command:`ssh` to verify that the firewall is now allowing the connection.
es: Siempre que cree una regla personalizada, pruebe que su nueva regla funcione como se espera. Por ejemplo, si crea una regla para permitir conexiones entrantes SSH, pruebe conectándose a su sistema PC-BSD® usando :command:`ssh` para verificar que el cortafuegos está permitiendo la conexión.

source: Network Configuration
es: Configuración de Red

source: During installation, PC-BSD® configures your Ethernet interfaces to use DHCP and provides a screen to :ref:`Connect to a Wireless Network`. In most cases, this means that your connected interfaces should "just work" whenever you use your PC-BSD® system.
es: Durante la instalación, PC-BSD® configura sus interfaces Ethernet para usar DHCP y proporciona una pantalla para :ref:`Conectarse a una Red Inalámbrica`. En la mayoría de los casos, esto significa que sus interfaces conectadas deberían "simplemente funcionar" cuando use su sistema PC-BSD®.

source: For desktops that provide a system tray, a wireless configuration icon will appear if PC-BSD® detects a supported wireless card. If you hover over the wireless icon, shown in :numref:`Figure %s: Wireless Information in System Tray <network1>`, it will indicate if the interface is associated and provide information regarding the IP address, IPv6 address, SSID, connection strength, connection speed, MAC address, and type of wireless device.
es: Para escritorios que proporcionan una bandeja de sistema, un icono de configuración inalámbrica aparecerá si PC-BSD® detecta una tarjeta inalámbrica soportada. Si pasa el ratón sobre el icono inalámbrico, mostrado en la :numref:`Figura %s: Información Inalámbrica en la Bandeja de Sistema <network1>`, indicará si la interfaz está asociada y proporcionará información sobre la dirección IP, dirección IPv6, SSID, fuerza de la conexión, velocidad de la conexión, dirección MAC, y tipo de dispositivo inalámbrico.

source: If you right-click the wireless icon, you will see a list of detected wireless networks. Simply click the name of a network to associate with it. The right-click menu also provides options to configure the wireless device, start the Network Manager, restart the network (useful if you need to renew your DHCP address), and to close the Network Monitor so that the icon no longer shows in the system tray. If you have multiple wireless devices, each will have its own icon in the system tray. If you do not use one of the devices, click its "Close the Network Monitor" to remove it from the tray.
es: Si hace botón derecho en el icono inalámbrico, verá una lista de redes inalámbricas detectadas. Simplemente presione el nombre de una red para asociarse con ella. El menú de botón derecho también proporciona opciones para configurar el dispositivo inalámbrico, inicia el Administrador de Red, reinicia la red (útil si necesita renovar su dirección DHCP), y cierra el Monitor de Red de manera que el icono ya no se muestra en la bandeja del sistema. Si tiene múltiples dispositivos inalámbricos, cada uno tendrá su propio icono en la bandeja del sistema. Si no usa alguno de los dispositivos, presione "Cerrar el Monitor de Red" para eliminarlo de la bandeja.

source: To view or manually configure all of your network interfaces click :menuselection:`Control Panel --> Network Configuration` or type :command:`pc-su pc-netmanager`. If a new device has been inserted (e.g. a USB wireless interface), a pop-up message will open when you start Network Configuration, indicate the name of the new device, and ask if you would like to enable it. Click "Yes" and the new device will be displayed with the list of network interfaces that PC-BSD® recognizes. In the example seen in :numref:`Figure %s: Network Configuration Utility <network2a>`, the system has one Intel Ethernet interface that uses the *em* driver and an Intel wireless interface that uses the *wlan* driver.
es: Para ver o configurar manualmente todas sus interfaces de red presione :menuselection:`Panel de Control --> Configuración de Red` o ingrese :command:`pc-su pc-netmanager`. Si un nuevo dispositivo se ha insertado (por ejemplo una interfaz inalámbrica USB), un mensaje emergente se abrirá cuando inicie la Configuración de Red, indicará el nombre del nuevo dispositivo, y preguntará si quiere habilitarlo. Presione "Sí" y el nuevo dispositivo se desplegará con la lista de interfaces de red que PC-BSD® reconoce. En el ejemplo mostrado en la :numref:`Figura %s: Utilería de Configuración de Red <network2a>`, el sistema tiene una interfaz Ethernet Intel que usa el controlador *em* y una interfaz Intel inalámbrica que usa el controlador *wlan*.

source: The rest of this section describes each tab of the Network Configuration utility and demonstrate how to view and configure the network settings for both Ethernet and wireless devices. It will then present some common troubleshooting scenarios, known issues, and suggestions for when a device does not have a built-in driver.
es: El resto de esta sección describe cada pestaña de la utilería de Configuración de Red y demuestra cómo ver y configurar los ajustes de red tanto para Ethernet como para dispositivos inalámbricos. Después mostrará algunos escenarios comunes de solución de problemas, problemas conocidos, y sugerencias para cuando un dispositivo no tenga un controlador incorporado.

source: Ethernet Adapters
es: Adaptadores Ethernet

source: If you highlight an Ethernet interface in the "Devices" tab and either click the "Configure" button or double-click the interface name, you will see the screen shown in :numref:`Figure %s: Network Settings for an Ethernet Interface <network3>`.
es: Si selecciona una interfaz Ethernet en la pestaña "Dispositivos" y presiona el botón "Configurar" o hace doble clic en el nombre de la interfaz, verá la pantalla mostrada en la :numref:`Figura %s: Configuraciones de Red para una Interfaz Ethernet <network3>`.

source: There are two ways to configure an Ethernet interface:
es: Hay dos formas de configurar una interfaz Ethernet:

source: **Use DHCP:** this method assumes that your Internet provider or network assigns your addressing information automatically using the DHCP protocol. Most networks are already setup to do this. This method is recommended as it should "just work".
es: **Usar DHCP:** este método asume que su proveedor de Internet o red le asigna la información de direccionamiento de manera automática usando el protocolo DHCP. La mayoría de las redes están ya configuradas para hacer esto. Este método se recomienda ya que simplemente "debe funcionar".

source: **Manually type in the IP addressing information:** this method requires you to understand the basics of TCP/IP addressing or to know which IP address you should be using on your network. If you do not know which IP address or subnet mask to use, you will have to ask your Internet provider or network administrator.
es: **Escribir manualmente la información de la dirección IP:** este método requiere que comprenda los conceptos básicos del direccionamiento TCP/IP o conozca qué dirección IP debería estar usando en su red. Si no conoce qué dirección IP o máscara de subred usar, tendrá que preguntar a su proveedor de Internet o administrador de red.

source: By default, PC-BSD® will attempt to obtain an address from a DHCP server. If you wish to manually type in your IP address, check the box "Assign static IP address". Type in the IP address, using the right arrow key or the mouse to move between octets. Then, double-check that the subnet mask ("Netmask") is the correct value and change it if it is not.
es: Por defecto, PC-BSD® intentará obtener una dirección desde un servidor DHCP. Si desea escribir manualmente su dirección IP, seleccione la casilla "Asignar una dirección IP estática". Escriba la dirección IP, usando la tecla de la flecha derecha o el ratón para moverse entre los octetos. Después, compruebe que la máscara de subred ("Máscara de Red") tiene el valor correcto y cámbielo si no lo es.

source: If the Ethernet network uses 802.1x authentication, check the box "Enable WPA authentication" which will enable the "Configure WPA" button. Click this button to select the network and to input the authentication values required by the network.
es: Si la red Ethernet usa autenticación 802.1x, seleccione la casilla "Habilitar autenticación WPA", lo que habilitará el botón "Configurar WPA". Presione este botón para seleccionar la red e introducir los valores de autenticación requeridos por la red.

source: By default, the "Disable this network device" box is unchecked. If you check this checkbox, PC-BSD® will immediately stop the interface from using the network. The interface will remain inactive until this checkbox is unchecked.
es: Por defecto el recuadro "Deshabilitar este dispositivo de red" no está marcado. Si lo marca PC-BSD® detendrá inmediatamente a la interfaz para que no use la red. La interfaz permanecerá inactiva hasta que el recuadro no esté marcado.

source: The "Advanced" tab, seen in :numref:`Figure %s: Advanced Tab of an Ethernet Interface's Network Settings <network4>`, allows advanced users to change their :wikipedia:`MAC address` or to automatically obtain an :wikipedia:`IPv6 address`. Both boxes should remain checked unless you are an advanced user who has a reason to change the default MAC or IPv6 address and you understand how to input an appropriate replacement address.
es: La pestaña “Avanzado”, mostrada en la :numref:`Figura %s: Pestaña Avanzada de la Configuración de Red de una Interfaz Ethernet <network4>`, permite a usuarios avanzados cambiar su dirección MAC u obtener automáticamente una dirección IPv6. Ambas casillas deben permanecer seleccionadas a menos que sea un usuario avanzado que tiene una razón para cambiar la MAC predeterminada o la dirección IPv6 y entiende como ingresar un reemplazo de dirección apropiado.

source: The "Info" tab, seen in :numref:`Figure %s: Info Tab of an Ethernet Interface's Network Settings <network5>`, will display the current network address settings and some traffic statistics.
es: La pestaña "Información", mostrada en la :numref:`Figura %s: Pestaña Información de la Configuración de Red de una Interfaz Ethernet <network5>`, mostrará las configuraciones actuales de la dirección de red y algunas estadísticas de tráfico.

source: If you make any changes within any of the tabs, click the "Apply" button to activate them. Click the "OK" button when you are finished to go back to the main Network Configuration window.
es: Si hace algunos cambios en alguna de las pestañas haga clic en el botón "Aplicar" para activarlos. Haga clic en el botón "OK" cuando haya finalizado para volver a la ventana principal de Configuración de Red.

source: You can repeat this procedure for each network interface that you wish to view or configure.
es: Puede repetir este procedimiento para cada interfaz de red que desee ver o configurar.

source: Wireless Adapters
es: Adaptadores Inalámbricos

source: If your wireless interface does not automatically associate with a wireless network, you probably need to configure a wireless profile that contains the security settings required by the wireless network. Double-click the wireless icon in the system tray or highlight the wireless interface displayed in the "Devices" tab of Network Configuration and click the "Configure" button. :numref:`Figure %s: Wireless Configuration Window of Network Configuration Utility <network6>` demonstrates that this system's wireless interface is currently associated with the wireless network listed in the "Configured Network Profiles" section.
es: Si su interfaz inalámbrica no se asocia automáticamente con una red inalámbrica, probablemente necesite configurar un perfil inalámbrico que contenga las configuraciones de seguridad requeridas por la red inalámbrica. Presione el icono inalámbrico en la bandeja de sistema o seleccione la interfaz inalámbrica mostrada en la pestaña "Dispositivos" de la Configuración de Red y presione el botón "Configurar". La :numref:`Figura %s: Ventana de Configuración Inalámbrica de la Utilería de Configuración de Red <network6>` demuestra que la interfaz inalámbrica del sistema está actualmente asociada con la red inalámbrica listada en la sección "Perfiles de Red Configurados".

source: To associate with a wireless network, click the "Scan" button to receive the list of possible wireless networks to connect to. Highlight the network you wish to associate with and click the "Add Selected" button. If the network requires authentication, a pop-up window will prompt you for the authentication details. Input the values required by the network then click the "Close" button. PC-BSD® will add an entry for the network in the "Configured Network Profiles" section.
es: Para conectarse a una red inalámbrica, presione el botón "Escanear" para recibir la lista de posibles redes inalámbricas a las que conectarse. Seleccione la red a la que desea conectarse y presione el botón "Añadir Red Seleccionada". Si la red necesita autenticación, una ventana emergente le preguntará los detalles de autenticación. Introduzca los valores requeridos por la red y presione el botón "Cerrar". PC-BSD® añadirá una entrada para la red en la sección "Perfiles de Red Configurados".

source: If the network is hidden, click the "Add Hidden" button, input the name of the network in the pop-up window, and click "OK".
es: Si la red está oculta, presione el botón "Añadir Redes Ocultas", introduzca el nombre de la red en la ventana emergente, y presione "OK".

source: If you add multiple networks, use the arrow keys to place them in the desired connection order. PC-BSD® will try to connect to the first profile in the list and will move down the list in order if it is unable to connect. When finished, click the "Apply" button. A pop-up message will indicate that PC-BSD® is restarting the network. If all went well, there should be an IP address and status of "associated" when you hover over the wireless icon in the system tray. If this is not the case, double-check for typos in your configuration values and read the section on :ref:`Troubleshooting Network Settings`.
es: Si añade varias redes, use las teclas con las flechas para colocarlas en el orden de conexión deseado. PC-BSD® tratará de conectarse al primer perfil en la lista y se moverá hacia abajo de la lista de forma ordenada si es incapaz de conectarse. Cuando termine, presione el botón "Aplicar". Un mensaje emergente le indicará que PC-BSD® está reiniciando la red. Si todo ha ido bien, debería haber una dirección IP y el estatus de "conectada" cuando pase el ratón sobre el icono de red inalámbrica de la bandeja de sistema. Si este no es el caso, revise para buscar errores en sus valores de configuración y lea la sección :ref:`Errores en la Configuración de Red`.

source: PC-BSD® supports the types of authentication shown in :numref:`Figure %s: Configuring Wireless Authentication Settings <network7>`. You can access this screen (and change your authentication settings) by highlighting an entry in the "Configured Network Profiles" section and clicking the "Edit" button.
es: PC-BSD® soporta los tipos de autenticación mostrados en la :numref:`Figura %s: Configurando las Opciones de Autenticación Inalámbrica <network7>`. Puede accesar esta pantalla (y cambiar sus opciones de autenticación) seleccionando una entrada en la sección "Perfiles de Red Configurados" y presionando el botón "Editar".

source: This screen allows you to configure the following types of wireless security:
es: Esta pantalla le permite configurar los siguientes tipos de seguridad inalámbrica:

source: **Disabled:** if the network is open, no additional configuration is required.
es: **Deshabilitado:** si la red está abierta, no se requiere configuración adicional.

source: **WEP:** this type of network can be configured to use either a hex or a plaintext key and Network Manager will automatically select the type of key that it has detected. If you click "WEP" then the "Configure" button, you will see the screen shown in :numref:`Figure %s: WEP Security Settings <network8>`. Type the key into both network key boxes. If the key is complex, check the "Show Key" box to make sure that the passwords are correct and that they match. Uncheck this box when you are finished to replace the characters in the key with the "*" symbol. A wireless access point that uses WEP can store up to 4 keys and the number in the key index indicates which key you wish to use.
es: **WEP:** este tipo de red puede configurarse para usar ya sea una llave hexadecimal o de texto plano y el Administrador de Red automáticamente seleccionará el tipo de llave que ha detectado. Si presiona "WEP" y luego el botón "Configurar", verá la pantalla mostrada en la :numref:`Figura %s: Configuraciones de Seguridad WEP <network8>`. Ingrese la llave en las dos casillas de llave de red. Si la llave es compleja, presione la casilla "Mostrar Llave" para asegurarse que las contraseñas son correctas y que son iguales. Deseleccione esta casilla cuando termine para reemplazar los caracteres en la llave con el símbolo "*". Un punto de acceso inalámbrico que usa WEP puede guardar hasta 4 llaves y el número en el índice de llaves indica qué llave quiere usar.

source: **WPA Personal:** this type of network uses a plaintext key. If you click "WPA Personal" then the "Configure" button, you will see the screen shown in :numref:`Figure %s: WPA Personal Security Settings <network9>`. Type in the key twice to verify it. If the key is complex, you can check the "Show Key" box to make sure the passwords match.
es: **WPA Personal:** este tipo de red usa una llave en texto plano. Si presiona "WPA Personal" y luego el botón "Configurar", verá la pantalla mostrada en la :numref:`Figura %s: Configuraciones de Seguridad de WPA Personal <network9>`. Ingrese la llave dos veces para verificarla. Si la llave es compleja, puede seleccionar la casilla "Mostrar Llave" para asegurarse que sus contraseñas coincidan.
