Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: for boot environments to work properly, **do not delete the default ZFS mount points during installation.** The default ZFS layout ensures that when boot environments are created, the :file:`/usr/local/`, :file:`/usr/home/`, :file:`/usr/ports/`, :file:`/usr/src/` and :file:`/var/` directories remain untouched. This way, if you rollback to a previous boot environment, you will not lose data in your home directories, any installed applications, or downloaded src or ports. During installation, you can add additional mount points, just don't delete the default ones.
es: Para que los BE funcionen apropiadamente, **no elimine los puntos de montaje predeterminados de ZFS durante la instalación**. El diseño ZFS por defecto asegura que cuando los BE son creados, los directorios :file:`/usr/local/`, :file:`/usr/home/`, :file:`/usr/ports/`, :file:`/usr/src/` y :file:`/var/` permanecen intactos. De esta manera, si vuelve a un BE previo, no perderá datos en su directorio personal, ni aplicaciones instaladas, ni src o ports descargados. Durante la instalación, puede añadir puntos de montaje adicionales, solamente no elimine los predeterminados.

source: To create and manage boot environments using a graphical interface, go to :menuselection:`Control Panel --> Boot Manager` or type :command:`pc-su pc-bootconfig`. You will be prompted to enter your password.
es: Para crear y gestionar BE usando una interfaz gráfica, vaya a :menuselection:`Panel de Control --> Gestor de Arranque` o escriba :command:`pc-su pc-bootconfig`. Se le pedirá que introduzca una contraseña.

source: PC-BSD® automatically creates a boot environment whenever it updates the operating system or installed software. In the example shown in :numref:`Figure %s: Managing Boot Environments <be1>`, there is an entry named *default* that represents the original installation and an entry that was created when the operating system was updated to patch level 20.
es: PC-BSD® automáticamente crea un BE cada que se actualiza el sistema operativo o se instala software. En el ejemplo mostrado en la :numref:`Figura %s: Gestionando BEs <be1>`, hay una entrada llamada *default* que representa la instalación original y una entrada que fue creada cuando el sistema operativo se actualizó al nivel de parche 20.

source: To ensure that the files that the operating system needs are included when the system boots, all boot environments include :file:`/usr`, :file:`/usr/local`, and :file:`/var`. User-specific data is **not** included in the boot environment. This means that :file:`/usr/home`, :file:`/usr/jails`, :file:`/var/log`, :file:`/var/tmp`, and :file:`/var/audit` will not change, regardless of which boot environment is selected at system boot.
es: Para asegurarse de que los archivos que necesita el sistema operativo están incluidos cuando el sistema arranque, todos los BE incluyen :file:`/usr`, :file:`/usr/local`, y :file:`/var`. Datos específicos del usuario **no** están incluidos en el BE. Esto significa que :file:`/usr/home`, :file:`/usr/jails`, :file:`/var/log`, :file:`/var/tmp`, y :file:`/var/audit` no cambiarán, independientemente de qué BE se seleccione al iniciar el sistema.

source: From top to bottom, the icons on the far left are used to:
es: De arriba hacia abajo, los iconos de la izquierda se usan para:

source: **Create:** a new boot environment. You should do this before making any changes to the system that may impact on your current boot environment. You will be prompted for a name which can only contain letters or numbers. Once you click "OK", the system will create the environment, then add it to the list of boot environments.
es: **Crear:** un nuevo BE. Debería hacer esto antes de hacer cualquier cambio en el sistema que pueda afectar su BE actual. Se le pedirá un nombre que sólo puede contener letras o números. Una vez que haga clic en "OK", el sistema creará el entorno, después lo añadirá a la lista de BE.

source: **Remove:** will delete the highlighted boot environment. You can not delete the boot environment which has a "Running" status of *Yes* as that is the current boot environment.
es: **Eliminar:** eliminará el BE resaltado. No puede eliminar el BE que tiene el estatus de "Corriendo" o *Sí* ya que es el BE actual.

source: **Copy:** creates a copy of an existing boot environment.
es: **Copiar:** crea una copia de un BE existente.

source: **Rename:** used to rename the highlighted boot environment. The name is what appears in the boot menu when the system boots. You cannot rename the BE you are currently booted into and an error message will occur if you try to do so.
es: **Renombrar:** empleado para renombrar el entorno de arranque seleccionado. El nombre es el que aparece en el menú de arranque cuando el sistema inicia. No puede renombrar el BE en el que está actualmente y aparecerá un mensaje de error si trata de hacerlo.

source: **Activate:** tells the system to boot into the highlighted boot environment at next system boot. The "Default" will change to *Yes*, but the "Running" will remain the same. In other words, "Running" refers to the boot environment the system last booted into (is currently running from) whereas "Default" indicates which boot environment the system will boot into at next system boot.
es: **Activar:** le indica al sistema que inicie en el entorno de arranque seleccionado en el siguiente inicio del sistema. El "Predeterminado" cambiará a *Sí*, pero "En funcionamiento" permanecerá igual. En otras palabras, "En funcionamiento" se refiere al entorno de arranque en el que el sistema se inició la última vez (que está actualmente corriendo) mientras que "Predeterminado" indica en qué entorno de arranque se iniciará el sistema cuando arranque de nuevo.

source: This screen also lets you set the "Maximum auto-generated boot environments". The default is *5* and the range is from *1* to *10*. PC-BSD® automatically creates a boot environment before updating any software and the operating system as well as before applying a system update. Once the configured maximum number of boot environments is reached, PC-BSD® will automatically prune (delete) the oldest automatically created boot environment. However, it will not delete any boot environments you create manually.
es: Esta pantalla también le permite establecer el "Máximo de entornos de arranque auto-generados". Por defecto es *5* y el rango es de *1* a *10*. PC-BSD® crea automáticamente un entorno de arranque antes de actualizar cualquier software y el sistema operativo así como antes de aplicar una actualización del sistema. Una vez que se alcanza el número máximo configurado de entornos de arranque, PC-BSD® eliminará (borrará) el más antiguo de los entornos de arranque creados automáticamente. Sin embargo, no borrará ningún entorno de arranque que usted haya creado manualmente.

source: Whenever there are multiple boot environments, a boot menu similar to the one seen in :numref:`Figure %s: Boot Menu With Multiple Boot Environments <be4>` will appear for two seconds during system boot. If you do not pause this screen, the system will automatically boot into either the last "Running" boot environment or, if you have activated another boot environment, the environment that was set as the "Default".
es: Siempre que haya múltiples entornos de arranque, un menú de arranque similar al que se muestra en la :numref:`Figura %s: Menú de Arranque con Múltiples Entornos de Arranque <be4>` aparecerá por dos segundos durante el arranque del sistema. Si no pausa esta pantalla, el sistema automáticamente arrancará ya sea en el último entorno de arranque en ejecución o, si usted ha activado otro entorno de arranque, el entorno que fue definido como "En funcionamiento".

source: The "Boot Environment Menu" entry indicates that multiple boot environments are available. To browse the available boot environments, press the :kbd:`spacebar` to pause the screen, arrow down to "Boot Environment Menu" and press :kbd:`Enter`. In the example shown in :numref:`Figure %s: Boot Menu Shows Created Boot Environments <be2>`, two boot environments are available. The entry with "default" in the name indicates the date and time of the initial installation. The first boot entry indicates the operating system's current patch level and the date the system was updated. It is first in the boot order and since it is highlighted in blue, it is the active boot environment, or the one the system will boot into unless another BE is manually selected in this menu. Use the arrow keys to highlight the boot environment you would like to boot into, and press :kbd:`Enter` to continue booting into the selected boot environment.
es: La entrada "Menú de Entorno de Arranque" indica que múltiples entornos de arranque están disponibles. Para examinar los entornos de arranque disponibles, presione la :kbd:`barra espaciadora` para detener la pantalla, flecha hacia abajo hasta "Menú de Entorno de Arranque" y presione :kbd:`Intro`. En el ejemplo mostrado en la :numref:`Figura %s: Menú de Arranque Muestra Entornos de Arranque Creados <be2>`, dos entornos de arranque están disponibles. La entrada con "default" en el nombre indica la fecha y hora de la instalación inicial. La primera entrada de arranque indica el nivel de parche actual del sistema operativo y la fecha en la que el sistema fue actualizado. Está al inicio del orden de arranque y ya que está seleccionada en azul, es el entorno de arranque activo, o en el que el sistema arrancará a menos que otro BE sea seleccionado manualmente en este menu. Use las teclas de flecha para seleccionar el BE en el que quiera arrancar, y presione :kbd:`Intro` para continuar el arranque en el BE seleccionado.

source: To customize the appearance of the boot menu, click the "Grub Configuration" tab in Boot Manager to see the screen seen in :numref:`Figure %s: Managing GRUB Configuration <be3a>`.
es: Para personalizar la apariencia del menú de arranque, presione en la pestaña “Configuración de Grub” en el Gestor de Arranque para ver la pantalla mostrada en la :numref:`Figura %s: Administrando la Configuración de GRUB <be3a>`.

source: The fields in this screen are used to configure the:
es: Los campos en esta pantalla se usan para configurar:

source: **Theme File:** used to customize the look of the GRUB menu. The theme file format is described in `this section of the GRUB Manual <http://www.gnu.org/software/grub/manual/html_node/Theme-file-format.html>`_. The `GRUB 2 Theme Reference <http://wiki.rosalab.ru/en/index.php/Grub2_theme_/_reference>`_ provides additional information.
es: **Archivo de Tema:** empleado para personalizar el aspecto del menú de GRUB. El formato del archivo del tema está descrito en `esta sección del Manual de GRUB <http://www.gnu.org/software/grub/manual/html_node/Theme-file-format.html>`_. La `Referencia de los Temas de GRUB 2 <http://wiki.rosalab.ru/en/index.php/Grub2_theme_/_reference>`_ proporciona información adicional.

source: **Font File:** before a font can be used in the GRUB menu, it must first be converted to :file:`.pf2` format using the :command:`grub-mkfont(1)` command.
es: **Archivo de Fuentes:** antes de que una fuente se pueda usar en el menú de GRUB, debe convertirse primero al formato :file:`.pf2` usando el comando :command:`grub-mkfont(1)`.

source: **Timer:** sets the delay time for accessing the GRUB menu. By default it is 2 seconds, so if you find that the time to access the menu goes by too quickly, increase this timer.
es: **Temporizador:** establece el retardo del tiempo durante el que se podrá acceder al menú de GRUB. Por defecto son 2 segundos, así que si encuentra que el tiempo de acceso al menú pasa demasiado rápido, aumente este temporizador.

source: **Show Timer Countdown:** if this box is unchecked, the timer countdown will not display, though you can still interrupt the boot process during the delay time.
es: **Mostrar Cuenta Regresiva:** si esta casilla no está seleccionada, el reloj de la cuenta regresiva no se mostrará, aunque usted puede todavía interrumpir el proceso de arranque durante el tiempo de retardo.

source: **Custom Entries:** if you have an existing GRUB configuration that you would like to add to the menu, cut and paste it into the box. Refer to the `GRUB Manual <http://www.gnu.org/software/grub/manual/grub.html>`_ for more information on creating a custom GRUB configuration.
es: **Entradas Personalizadas:** si tiene una configuración existente de GRUB que quisiera añadir al menú, córtela y péguela en el recuadro. Refiérase al `Manual de GRUB <http://www.gnu.org/software/grub/manual/grub.html>`_ para más información sobre la creación de una configuración personalizada de GRUB.

source: If you make any changes in this tab, the two buttons below "Settings" or "Custom Entries" will be activated. Use them to save your changes or to re-load the GRUB configuration. If you forget to do so, a pop-up message will remind you that you have unsaved changes when you exit Boot Manager. If you do not save the changes using these buttons, the boot menu will remain the same.
es: Si hace cualquier cambio en esta pestaña, los dos botones debajo de "Configuraciones" o "Entradas Personalizadas" se activarán. Úselos para guardar sus cambios o para recargar la configuración de GRUB. Si olvida hacerlo, un mensaje emergente le recordará que tiene cambios sin guardar al momento de salir del Gestor de Arranque. Si no guarda los cambios usando estos botones, el menú de arranque se mantendrá igual.

source: the "Emergency Services" menu can be used to "Rebuild GRUB Menu" or to "Restore GRUB Defaults". If you make any changes to :file:`/boot/loader.conf`, remember to use the "Rebuild GRUB Menu" so that GRUB is aware of the changes to this file.
es: El menú "Servicios de Emergencia" se puede usar para "Reconstruir el Menú de GRUB" o para "Restaurar los Valores Predeterminados de GRUB". Si hace cualquier cambio en :file:`/boot/loader.conf` recuerde emplear "Reconstruir el Menú de GRUB" de manera que GRUB se entere de los cambios en este archivo.

source: Managing Boot Environments from the Command Line
es: Administrando Entornos de Arranque desde la línea de Comandos

source: If you are running TrueOS® or prefer to use the command line, you can manage boot environments using the :command:`beadm` command as the superuser. For example, this command creates a boot environment named *beforeupgrade*::
es: Si está corriendo TrueOS® o prefiere emplear la línea de comandos, puede administrar los BE usando el comando :command:`beadm` como administrador. Por ejemplo, este comando crea un BE denominado *beforeupgrade*::

source: To view all boot environments, use the :command:`list` command::
es: Para ver todos los BE, use el comando :command:`list`::

source: The possible flags in the "Active" field are as follows:
es: Las banderas posibles en el campo "Activo" son las siguientes:

source: **R:** active on reboot
es: **R:** activar al reiniciar

source: **N:** active now
es: **N:** activar ahora

source: **-:** inactive
es: **-:** inactivo

source: In this example, the current boot environment is called *10.1-RELEASE-p20-up-20150512_114505*, it is active now, will be used at next reboot, and it is mounted. The newly created *beforeupgrade* boot environment exists, but is inactive and unmounted. To activate the new boot environment::
es: En este ejemplo, el BE actual se denomina *10.1-RELEASE-p20-up-20150512_114505*, está activo ahora, se usará en el siguiente reinicio, y está montado. El BE recientemente creado *beforeupgrade* existe, pero está inactivo y desmontado. Para activar el nuevo BE::

source: The flags now indicate that the system is currently booted into *10.1-RELEASE-p20-up-20150512_114505*, but at next boot the system will boot into *beforeupgrade*.
es: Las banderas ahora indican que el sistema está actualmente iniciado en *10.1-RELEASE-p20-up-20150512_114505*, pero en el siguiente arranque el sistema se iniciará en *beforeupgrade*.

source: The boot menu configuration can be found in the ASCII text file :file:`/usr/local/etc/default/grub`::
es: La configuración del menú de arranque se puede encontrar en el archivo de texto ASCII :file:`/usr/local/etc/default/grub`::

source: To modify the maximum number of boot environments, change the number of this variable in :file:`/usr/local/etc/pcbsd.conf`::
es: Para modificar el máximo número de BE, cambie el número de esta varible en :file:`/usr/local/etc/pcbsd.conf`::

source: Note that valid values range from *1* to *10*.
es: Note que los valores válidos van desde *1* a *10*.

source: Hardware Compatibility
es: Compatibilidad de Hardware

source: The PC-BSD® installer allows you to quickly determine if your system's video card, Ethernet card, wireless device, and sound card are compatible with PC-BSD®.
es: El instalador de PC-BSD® le permite determinar rápidamente si la tarjeta gráfica, tarjeta Ethernet, dispositivo inalámbrico y tarjeta de sonido de su sistema son compatibles con PC-BSD®.

source: A "Hardware Compatibility" icon in Control Panel provides a quick overview of the system's detected hardware. To start the application, double-click its icon in Control Panel or type :command:`pc-sysinstaller -checkhardware`.
es: Un icono de "Compatibilidad de Hardware" en el Panel de Control proporciona un rápido resumen del hardware detectado en su sistema. Para iniciar la aplicación, haga doble clic en su icono en el Panel de Control o escriba :command:`pc-sysinstaller -checkhardware`.

source: In the example shown in :numref:`Figure %s: Sample Hardware Compatibility <hardware>`, this system has a detected NVIDIA video card with a configured resolution of 1600x900, one Ethernet device using the `em(4) <http://www.freebsd.org/cgi/man.cgi?query=em&apropos=0&sektion=4>`_ driver, and one wireless device using the `iwn(4) <http://www.freebsd.org/cgi/man.cgi?query=iwn&apropos=0&sektion=4>`_ driver. Currently no sound card is detected, meaning that the user should configure and test their sound card using the instructions in :ref:`PC-BSD Mixer Tray`.
es: En el ejemplo mostrado en la :numref:`Figura %s: Muestra de Compatibilidad de Hardware <hardware>`, este sistema ha detectado una tarjeta de video NVIDIA con una resolución configurada de 1600x900, un dispositivo Ethernet usando el controlador `em(4) <http://www.freebsd.org/cgi/man.cgi?query=em&apropos=0&sektion=4>`_, y un dispositivo inalámbrico usando el controlador `iwn(4) <http://www.freebsd.org/cgi/man.cgi?query=iwn&apropos=0&sektion=4>`_. Actualmente no se detectan tarjetas de sonido, significando que el usuario debería configurar y probar su tarjeta de sonido usando las instrucciones en la :ref:`Bandeja del Mezclador de PC-BSD`.

source: Hardware that is currently incompatible may show with a green checkbox after a system upgrade or update. This indicates that the update added the driver for the device.
es: El Hardware que es actualmente incompatible puede aparecer con una casilla de verificación verde tras un incremento de versión del sistema o una actualización. Esto indica que las actualizaciones añadieron el controlador para el dispositivo.

source: Login Manager
es: Gestor de Acceso

source: A Login Manager utility is available in Control Panel. :numref:`Figure %s: Login Manager <login2>` shows the initial screen when you click on this icon in Control Panel or type :command:`pc-su pc-dmconf` at the command line. Note that this utility will prompt you for your password.
es: Una utilería Gestor de Acceso está disponible en el Panel de Control. La :numref:`Figura %s: Gestor de Acceso <login2>` muestra la pantalla inicial cuando hace clic en este icono en el Panel de Control o ingresa :command:`pc-su pc-dmconf` en la línea de comandos. Note que esta utilería le preguntará por su contraseña.

source: For security reasons, PC-BSD® defaults to a login screen. This means that users are required to input their password before logging into the PC-BSD® system. If you are the only user on the PC-BSD® computer, always use the same window manager, and do not consider it a security risk for the system to automatically boot into that window manager, you can enable auto-login using the "Auto login" tab.
es: Por razones de seguridad, PC-BSD® por defecto le lleva a una pantalla de acceso. Esto significa que los usuarios necesitan introducir su contraseña antes de acceder al sistema PC-BSD®. Si es usted el único usuario en el equipo PC-BSD®, siempre usa el mismo gestor de ventanas, y no considera un riesgo de seguridad para el sistema el iniciar automáticamente en ese gestor de ventanas, puede habilitar el acceso automático usando la pestaña "Acceso automático".

source: As seen in the example in :numref:`Figure %s: Login Manager <login2>`, the "Enable auto login" box is unchecked by default. If you check the box, the "Auto login user" drop-down menu will be activated. Select the user account to automatically login as. If desired, the "Time Delay" can be changed to control how long the login manager will wait for the user to cancel the automated login. Do not set this setting too low if there are times that you wish to login as a different user or to select a different desktop. When finished, click "Apply" and you will be prompted to input the selected user's password.
es: Como se muestra en el ejemplo en la :numref:`Figura %s: Gestor de Acceso <login2>`, la casilla "Habilitar acceso automático" está desmarcada por defecto. Si selecciona la casilla, el menú desplegable "Usuario con acceso automático" se activará. Seleccione la cuenta de usuario con la cual accederá automáticamente. Si lo desea, el "Retraso en el Tiempo" se puede cambiar para controlar qué tanto esperará el gestor de acceso para que el usuario cancele el acceso automático. No establezca esta configuración con un valor muy bajo si hay ocasiones en las que quisiera acceder como un usuario diferente o para seleccionar un escritorio diferente. Cuando termine, presione en "Aplicar" y se le pedirá que ingrese la contraseña del usuario seleccionado.

source: this change requires a reboot. Once the system is rebooted, a login screen will no longer appear unless the user interrupts the automatic boot or until this setting is changed again in Login Manager.
es: Este cambio requiere un reinicio. Una vez que el sistema ha reiniciado, ya no aparecerá una pantalla de acceso a no ser que el usuario interrumpa el arranque automático o hasta que esta configuración sea cambiada nuevamente en el Gestor de Acceso.
