Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: This screen is used to input the following information when adding a new user or system account:
es: Esta pantalla se emplea para introducir la siguiente información cuando se añade un nuevo usuario o una cuenta de sistema:

source: **Full Name:** this field provides a description of the account and can contain spaces. If it is a user account, use the person's first and last name. If it is a system account, input a description to remind you which application uses the account.
es: **Nombre Completo:** este campo proporciona una descripción de la cuenta y puede contener espacios. Si es una cuenta de usuario ponga el nombre y apellido. Si es una cuenta de sistema introduzca una descripción para recordarle que aplicaciones usan esa cuenta.

source: **Username:** the name the user will use when they log in to the system; it is case sensitive and can not contain any spaces. If you are creating a system account needed by an application, use the name provided by the application's installation instructions. If the name that you choose already exists as an account, it will be highlighted in red and the utility will prompt you to use another name.
es: **Nombre del Usuario:** el nombre que el usuario empleará cuando acceda al sistema; es sensible a mayúsculas y no puende contener ningún espacio. Si está creando una cuenta de sistema que es necesaria para una aplicación, use el nombre que proporcione las instrucciones de instalación de la aplicación. Si el nombre que elige ya existe como una cuenta, se destacará en rojo y la herramienta le pedirá que use otro nombre.

source: **Home Directory:** leave this field empty for a user account as the system will automatically create a ZFS dataset for the user's home directory under :file:`/usr/home/username`. However, if you are creating a system account it is important to override this default by typing in :file:`/var/empty` or :file:`/nonexistent` unless the application's installation instructions specify that the account needs a specific home directory.
es: **Directorio Personal:** deje este campo vacío para un cuenta de usuario ya que el sistema creará automáticamente un dataset ZFS para el directorio personal del usuario en :file:`/usr/home/username`. Sin embargo, si está creando una cuenta de sistema es importante invalidar este valor por defecto ingresando :file:`/var/empty` o :file:`/nonexistent` a no ser que las instrucciones de instalación de la aplicación especifiquen que la cuenta necesite un directorio personal específico.

source: **Shell:** this drop-down menu contains the shells that are available to users when they are at a command prompt. You can either keep the default or select a shell which the user prefers.
es: **Shell:** este menú desplegable contiene los shells que están disponibles para los usuarios cuando están en la línea de comandos. Puede mantener el predeterminado o seleccionar un shell que el usuario prefiera.

source: **UID:** by default, the user will be assigned the next available User ID (UID). If you need to force a specific UID, you can set it here. Note that you cannot set a UID lower than 1001 or specify a UID that is already in use by another user account.
es: **UID:** por defecto, al usuario se le asignará el siguiente ID de Usuario (UID) disponible. Si necesita forzar un UID específico, puede establecerlo aquí. Tenga en cuenta que no puede establecer una UID más abajo de 1001 o especificar un UID que ya esté en uso por otra cuenta de usuario.

source: **Primary Group:** if you leave the default button of "New Group" selected, a group will be created with the same name as the user. This is usually what you want unless you are creating a system account and the installation instructions specify a different group name. Note that the drop-down menu for specifying a group name will only show existing groups, but you can quickly create a group using the "Groups" tab.
es: **Grupo Primario:** si deja el botón predeterminado de "Nuevo Grupo" seleccionado, se creará un grupo con el mismo nombre que el usuario. Esto es normalmente lo que se quiere a no ser que esté creando una cuenta de sistema y las instrucciones de instalación especifiquen un nombre de grupo diferente. Tenga en cuenta que el menú desplegable para especificar el nombre del grupo mostrará solo los grupos existentes, pero puede crear rápidamente un grupo usando la pestaña "Grupos".

source: **Password:** the password is case-sensitive and needs to be confirmed.
es: **Contraseña:** la contraseña es sensible a mayúsculas y necesita ser confirmada.

source: Once you have made your selections, press the "Save" button to create the account.
es: Una vez que haya hecho sus selecciones, presione el botón "Guardar" para crear la cuenta.

source: Beginning with 10.1.2, PC-BSD® provides support for PersonaCrypt. A PersonaCrypt device is a removable USB media, such as a USB stick, which has been formatted with ZFS and encrypted with GELI. This device is used to hold a specific user's home directory, meaning that they can securely transport and access their personal files on any PC-BSD® 10.1.2 or higher system. This can be used, for example, to securely access one's home directory from a laptop, home computer, and work computer. The device is protected by an encryption key and a password which is, and should be, separate from the user's login password.
es: Comenzando con 10.1.2, PC-BSD® proporciona soporte para PersonaCrypt. Un dispositivo PersonaCrypt es un medio USB extraíble, tal como una memoria USB, que se ha formateado con ZFS y encriptado con GELI. Este dispositivo se emplea para tener un directorio personal específico de usuario, lo que significa que se puede transportar y acceder a los archivos personales de manera segura en cualquier sistema PC-BSD® 10.1.2 o superior. Esto puede ser usado, por ejemplo, para accesar de manera segura su directorio personal desde una laptop, equipo de casa, y equipo de trabajo. El dispositivo está protegido por una llave de encriptación y una contraseña la cual es, y debería ser, diferente a la contraseña de acceso del usuario.

source: when a user is configured to use a PersonaCrypt device, that user can not login using an unencrypted session on the same system. In other words, the PersonaCrypt username is reserved for PersonaCrypt use. If you need to login to both encrypted and unencrypted sessions on the same system, create two different user accounts, one for each type of session.
es: Cuando un usuario está configurado para usar un dispositivo PersonaCrypt, ese usuario no puede conectarse mediante una sesión sin encriptar al mismo sistema. En otras palabras, el nombre de usuario de PersonaCrypt está reservado para el uso de PersonaCrypt. Si necesita conectarse tanto a sesiones encriptadas como no encriptadas en el mismo sistema, cree dos cuentas de usuario diferentes, una para cada tipo de sesión.

source: PersonaCrypt uses GELI's ability to split the key into two parts: one being your passphrase, and the other being a key stored on disk. Without both of these parts, the media cannot be decrypted. This means that if somebody steals the key and manages to get your password, it is still worthless without the system it was paired with.
es: PersonaCrypt emplea la capacidad de GELI para separar la llave en dos partes: una siendo su contraseña, y la otra siendo una llave almacenada en el disco. Sin estas dos partes, el dispositivo no se puede desencriptar. Esto significa que si alguien roba la llave y se las arregla para obtener su contraseña, no servirá de nada sin el sistema con el que está emparejado.

source: USB devices can and do eventually fail. Always backup any important files stored on the PersonaCrypt device to another device or system.
es: Los dispositivos USB pueden y eventualmente fallarán. Siempre respalde todos los archivos importantes guardados en el dispositivo PersonaCrypt en otro dispositivo o sistema.

source: Advanced Mode can be used to initialize a PersonaCrypt device for any created user, **except** for the currently logged in user. In the example shown in :numref:`Figure %s: Initialize PersonaCrypt Device <user5>`, a new user, named *dlavigne*, has been created and the entry for that user has been clicked.
es: El Modo Avanzado puede ser usado para inicializar un dispositivo PersonaCrypt para cualquier usuario creado, **excepto** para el usuario actualmente conectado. En el ejemplo mostrado en la :numref:`Figura %s: Inicializando un Dispositivo PersonaCrypt <user5>`, un nuevo usuario, llamado *dlavigne*, se ha creado y la entrada para ese usuario se ha presionado.

source: Before a user is configured to use PersonaCrypt on a PC-BSD® system, two buttons are available in the "PersonaCrypt" section of "Advanced Mode". Note that this section is hidden if the currently logged in user is selected. Also, if you have just created a user and do not see these options, click "Apply" then re-highlight the user to display these options:
es: Antes de que un usuario sea configurado para usar PersonaCrypt en un sistema PC-BSD®, hay dos botones disponibles en la sección "PersonaCrypt" del "Modo Avanzado". Note que esta sección está oculta si el usuario actualmente conectado está seleccionado. También, si sólo ha creado un usuario y no ve estas opciones, presione en "Aplicar" y vuelva a seleccionar al usuario para mostrar estas opciones:

source: **Import Key:** if the user has already created a PersonaCrypt device on another PC-BSD® system, click this button to import a previously saved copy of the key associated with the device. Once the key is imported, the user can now login to this computer using PersonaCrypt.
es: **Importar Llave:** si el usuario ha creado ya un dispositivo PersonaCrypt en otro sistema PC-BSD®, presione este botón para importar una copia previamente guardada de la llave asociada con el dispositivo. Una vez que la llave se ha importado, el usuario puede ahora acceder a este equipo usando PersonaCrypt.

source: **Initialize Device:** used to prepare the USB device that will be used as the user's home directory.
es: **Inicializar Dispositivo:** se usa para preparar un dispositivo USB que será utilizado como directorio personal del usuario.

source: To prepare a PersonaCrypt device for this user, insert a USB stick and click "Initialize Device". A pop-up menu will indicate that the current contents of the device will be wiped and that the device must be larger than the user's current home directory.
es: Para preparar un dispositivo PersonaCrypt para este usuario, inserte una memoria USB y presione en "Inicializar Dispositivo". Un menú emergente le indicará que el contenido actual del dispositivo se borrará y que el dispositivo debe ser mayor que el directorio personal actual del usuario.

source: since the USB stick will hold the user's home directory and files, ensure that the stick is large enough to meet the anticipated storage needs of the home directory. Since the stick will be reformatted during the initialization process, make sure that any current data on the stick that you need has been copied elsewhere. Also, the faster the stick, the better the user experience while logged in.
es: Ya que la memoria USB contendrá el directorio personal del usuario y sus archivos, asegúrese de que la memoria tiene suficiente capacidad para cumplir con las necesidades del directorio personal. Puesto que la memoria USB se formateará durante el proceso de inicialización, asegúrese de que cualquier dato que necesite de la memoria USB se haya copiado en cualquier otro sitio. También, cuanto más rápida sea la memoria USB, mejor será la experiencia del usuario mientras esté conectado.

source: Press "OK" in the pop-up menu. This will prompt you to input and confirm the password to associate with the device. Another message will ask if you are ready. Click "Yes" to initialize the device. The User Manager screen will be greyed out while the device is prepared. Once the initialization is complete, the User Manager screen will change to display the device's key options, as seen in :numref:`Figure %s: PersonaCrypt Key Options <user6>`.
es: Presione "OK" en el menú desplegable. Esto le avisará para ingresar y confirmar la contraseña para asociar con el dispositivo. Otro mensaje preguntará si está listo. Presione "Sí" para inicializar el dispositivo. La pantalla de Administrador de Usuarios se pondrá en gris mientras se prepara el dispositivo. Una vez que la inicialización está completa, la pantalla del Administrador de Usuarios cambiará para mostrar las opciones de la llave del dispositivo, como se muestra en la :numref:`Figura %s: Opciones de la Llave PersonaCrypt <user6>`.

source: The following options are now available:
es: Las siguientes opciones están ahora disponibles:

source: **Export Key:** used to create a copy of the encryption key so that it can be imported for use on another PC-BSD® system.
es: **Exportar Llave:** usado para crear una copia de la llave de encriptación de manera que pueda ser importada para su uso en otro sistema PC-BSD®.

source: **Disable Key (No Data):** used to uninitialize the PersonaCrypt device on this system. Note that the device can still be used to login to other PC-BSD® systems.
es: **Desahabilitar la Llave (Sin Datos):** usado para deshabilitar el dispositivo PersonaCrypt en este sistema. Note que el dispositivo todavía se podrá usar para acceder a otros sistemas PC-BSD®.

source: **Disable Key (Import Data):** in addition to uninitializing the PersonaCrypt device on this system, copy the contents of the user's home directory to this system.
es: **Deshabilitar la Llave (Importar Datos):** además de deshabilitar el dispositivo PersonaCrypt en este sistema, copia el contenido del directorio personal del usuario a este sistema.

source: Once a user has been initialized for PersonaCrypt on the system, their user account will no longer be displayed when :ref:`Logging In` **unless** their PersonaCrypt device is inserted. Once the USB device is inserted, the login screen will add an extra field, as seen in the example shown in Figure 4.8b.
es: Una vez que un usuario ha sido inicializado para PersonaCrypt en el sistema, su cuenta de usuario ya no se mostrará más en :ref:`Accesando` **a menos que** su dispositivo PersonaCrypt esté conectado. Una vez que el dispositivo USB esté conectado, la pantalla de acceso añadirá un campo extra.

source: if the "Allow Stealth Sessions" checkbox has been checked in :menuselection:`Control Panel --> Login Manager --> Misc`, PersonaCrypt users will still be displayed in the login menu, even if their USB device is not inserted. This is to allow those users the option to instead login using a stealth session. See :ref:`Login Manager` for more information about stealth sessions.
es: Si la casilla "Permitir Sesión Sigilosa" se ha seleccionado en :menuselection:`Panel de Control --> Gestor de Acceso --> Misceláneos`, los usuarios PersonaCrypt aún se mostrarán en el menú de acceso, incluso si sus dispositivos USB no están conectados. Esto es para permitir a dichos usuarios la opción de acceder usando una sesión sigilosa. Ver :ref:`Gestor de Acceso` para más información sobre las sesiones sigilosas.

source: In the field with the yellow padlock icon, input the password for the user account. In the field with the grey USB stick icon, input the password associated with the PersonaCrypt device.
es: En el campo con el icono de candado amarillo, ingrese la contraseña para la cuenta de usuario. En el campo con el icono de una memoria USB gris, ingrese la contraseña asociada con el dispositivo PersonaCrypt.

source: To prevent data corruption and freezing the system **DO NOT** remove the PersonaCrypt device while logged in! Always log out of your session before physically removing the device.
es: Para evitar corrupción de datos y bloquear el sistema **NO** extraiga el dispositivo PersonaCrypt mientras esté conectado! Siempre desconéctese de su sesión antes de extraer físicamente el dispositivo.

source: Managing Groups
es: Administrando Grupos

source: If you click the "Groups" tab, you can view all of the groups on the system, as seen in :numref:`Figure %s: Managing Groups Using User Manager <user4>`.
es: Si presiona la pestaña "Grupos", puede ver todos los grupos en el sistema, como se muestra en la :numref:`Figura %s: Gestionando Grupos Usando el Administrador de Usuarios <user4>`.

source: This screen has 3 columns:
es: Esta pantalla tiene 3 columnas:

source: **Groups:** shows all of the groups on the system.
es: **Grupos:** muestra todos los grupos en el sistema.

source: **Available:** shows all of the system and user accounts on the system in alphabetical order.
es: **Disponible:** muestra todas las cuentas de sistema y de usuario en el sistema en orden alfabético.

source: **Members:** indicates if the highlighted group contains any user accounts.
es: **Miembros:** indica si el grupo seleccionado contiene alguna cuenta de usuario.

source: To add an account to a group, highlight the group name in the "Groups" column. Then, highlight the account name in the "Available" column. Click the right arrow and the selected account will appear in the "Members" column. You should only add user accounts to groups that you create yourself or when an application's installation instructions indicate that an account needs to be added to a group.
es: Para añadir una cuenta a un grupo, seleccione el nombre del grupo en la columna "Grupos". Después, seleccione el nombre de la cuenta en la columna "Disponible". Presione la flecha derecha y la cuenta seleccionada aparecerá en la columna "Miembros". Solo debería añadir cuentas de usuario a los grupos que haya creado usted o cuando las instrucciones de instalación de una aplicación indiquen que una cuenta necesita añadirse a un grupo.

source: If you click the "Add" button, a pop-up menu will prompt you for the name of the new group. Once you press "OK", the group will be added to the "Groups" column.
es: Si presiona el botón de "Añadir", un menú emergente le preguntará por el nombre del nuevo grupo. Una vez que presione "OK", el grupo será añadido a la columna "Grupos".

source: If you click the "Remove" button, the highlighted group will automatically be deleted after you press the "Apply" button, so be sure to do this with care. Again, do **not** remove any groups that you did not create yourself or applications that used to work may stop working.
es: Si presiona el botón "Eliminar", el grupo seleccionado será eliminado automáticamente después de presionar el botón "Aplicar", así que asegúrese de hacer esto con cuidado. De nuevo, **no** elimine ningún grupo que no haya creado usted o las aplicaciones que solían funcionar dejarán de hacerlo.

source: Disk Manager
es: Administrador del Disco

source: The PC-BSD® Disk Manager can be used to manage ZFS pools and datasets as well as the disks attached to the system. To access this utility, use :menuselection:`Control Panel --> Disk Manager` or type :command:`pc-su pc-zmanager` from within an xterm. You will need to input your password in order to access this utility.
es: El Administrador del Disco de PC-BSD® se puede usar para gestionar pools y datasets de ZFS, así como los discos conectados al sistema. Para accesar esta utilería, use :menuselection:`Panel de Control --> Administrador del Disco` o ingrese :command:`pc-su pc-zmanager` desde una xterm. Necesitará introducir su contraseña para accesar a esta utilería.

source: As seen in the example in :numref:`Figure %s: Viewing the System's ZFS Datasets <disk1>`, the utility will open in the "ZFS Filesystems" tab and will display the system's ZFS datasets and their snapshots, the amount of space available to each dataset, and the amount of space each dataset is using.
es: Como se muestra en el ejemplo en la :numref:`Figura %s: Viendo los Datasets ZFS del Sistema <disk1>`, la utilería se abrirá en la pestaña "Sistemas de Archivos ZFS" y mostrará los datasets del sistema y sus snapshots, la cantidad de espacio disponible para cada dataset, y la cantidad de espacio que está usando cada dataset.

source: The name of the pool in this example is *tank1*. If the system has multiple pools, click the green arrow to select the desired pool.
es: El nombre del pool en este ejemplo es *tank1*. Si el sistema tiene múltiples pools, presione la flecha verde para seleccionar el pool deseado.

source: If you right-click the pool name under "Filesystems", the following options are available:
es: Si hace clic con el botón derecho en el nombre del pool dentro de "Sistemas de Archivos", las siguientes opciones estarán disponibles:

source: **Mount:** whether or not the filesystem can be mounted depends upon the value of the "canmount" property of the dataset.
es: **Montar:** que el sistema de archivos se pueda montar o no, depende del valor de la propiedad "canmount" del dataset.

source: **Create new dataset:** :numref:`Figure %s: Creating a New ZFS Dataset <disk2>` shows the options that are available when you create a new dataset.
es: **Crear un nuevo dataset:** la :numref:`Figura %s: Creando un Nuevo Dataset ZFS <disk2>` muestra las opciones que están disponibles cuando usted crea un nuevo dataset.

source: **Create a clone dataset:** creates a copy of the dataset.
es: **Crear un dataset clonado:** crea una copia del dataset.

source: **Take a snapshot:** will prompt for the name of the snapshot. The field is pink to remind you to type the snapshot name in immediately after the pool name and *@* symbol. In this example, *tank1@* will be displayed in the name field. An example snapshot name could be *tan1k@snapshot1* or *tank1@201505181353* to denote the date and time the snapshot was created. The snapshot creation will be instantaneous and the new snapshot will be added to the list of datasets and will have a camera icon. Click the entry for the snapshot entry if you wish to rename it, clone it, destroy it, rollback the system to that point in time, or edit its properties. If you forget when you made the snapshot, pick "Edit properties" from the snapshot's right-click menu as it will show its "creation" property.
es: **Tomar un snapshot:** le pedirá el nombre del snapshot. El campo está en rosa para recordarle que ingrese en él el nombre del snapshot inmediatamente después del nombre del pool y del símbolo *@*. En este ejemplo, *tank1@* se mostrará en el campo del nombre. Un ejemplo de snapshot podría ser *tank1@snapshot1* o *tank1@201505181353* para indicar al fecha y la hora en la que el snapshot fue creado. La creación del snapshot será instantánea y el nuevo snapshot se añadirá a la lista de datasets y tendrá una cámara como icono. Presione en la entrada del snapshot si desea renombrarlo, clonarlo, destruirlo, hacer que el sistema vuelva a ese momento en el tiempo, o editar sus propiedades. Si olvida cuándo hizo el snapshot, elija "Editar propiedades" del menú de clic derecho del snapshot ya que mostrará su propiedad "creación".
