Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: When you first insert a USB drive, a "New Device" message should appear in the system tray. If you click Mount Tray and the filesystem on the device is recognized, it will automatically mount and the contents of the device will be displayed in the default file manager for the desktop. Alternately, right-click Mount Tray and click the "Mount" button to mount the device and its contents. A list of available file managers can be found in :ref:`Files and File Sharing` and Table 1.3a lists which filesystems are supported by Mount Tray. If the filesystem is not recognized, a *?* will appear next to the device. When the device is mounted, its "Mount" button changes to "Eject". When you are finished using the device, press this "Eject" button and wait for the message indicating that it is safe to remove the device before physically removing the device. Note that you will receive a "Device Busy" message if the file manager is still open with the device's contents. If you receive this message, press "No" to close it, close the file manager, then press "Eject" again. This will ensure that the device is cleanly unmounted.
es: Cuando inserta por primera vez un dispositivo USB, debería aparecer un mensaje de "Dispositivo Nuevo" en la bandeja del sistema. Si presiona en la Bandeja de Montaje y el sistema de archivos del dispositivo es reconocido, será montado automáticamente y los contenidos del dispositivo se mostrarán en el administrador de archivos predeterminado del escritorio. Alternativamente, haga clic derecho en la Bandeja de Montaje y presione el botón "Montar" para montar el dispositivo y su contenido. Una lista de administradores de archivos disponibles se puede encontrar en :ref:`Archivos y Compartición de Archivos`. Si el sistema de archivos no es reconocido, un *?* aparecerá junto al dispositivo. Cuando el dispositivo está montado, su botón "Montar" cambia a "Expulsar". Cuando haya terminado de usar el dispositivo, presione este botón "Expulsar" y espere por el mensaje indicando que es seguro el remover el dispositivo antes de extraerlo físicamente. Note que recibirá un mensaje de "Dispositivo Ocupado" si el administrador de archivos está todavía abierto con los contenidos del dispositivo. Si recibe este mensaje, presione "No" para cerrarlo, cierre el administrador de archivos, después presione "Expulsar" otra vez. Esto asegurará que el dispositivo se ha desmontado limpiamente.

source: while Mount Tray will allow you to physically remove a USB device without unmounting it first, it is recommended to always "Eject" the drive first.
es: Mientras que la Bandeja de Montaje le permitirá extraer físicamente un dispositivo USB sin desmontarlo primero, se recomienda que siempre "Expulse" primero el dispositivo.

source: When you first insert an optical media, such as a music CD or DVD video, a message will indicate that an optical disk is available and, by default, the default player application will open so that you can play the contents of the disk. The default player that is used depends upon which applications have been installed, where `VLC <http://www.videolan.org/vlc/>`_ takes precedence, followed by `SMPlayer <http://smplayer.sourceforge.net/>`_. If you close the player, you can click the "Play" button shown in :numref:`Figure %s: Mount Tray Example <mount1>` to restart it.
es: Cuando inserta por primera vez un medio óptico, como un CD de música o un video DVD, un mensaje le indicará que un disco óptico está disponible y, por defecto, la aplicación predeterminada para reproducirlos se abrirá para que pueda reproducir el contenido del disco. El reproductor predeterminado que se usa depende en cuales aplicaciones han sido instaladas, donde `VLC <http://www.videolan.org/vlc/>`_ toma precedencia, seguido por `SMPlayer <http://smplayer.sourceforge.net/>`_. Si cierra el reproductor, puede presionar el botón “Reproducir” mostrado en la :numref:`Figura %s: Ejemplo de Bandeja de Montaje <mount1>` para reiniciarlo.

source: The following options are available in the "More Options" menu:
es: Las siguientes opciones están disponibles en el menú "Más Opciones":

source: **Open Media Directory:** this will only appear if a filesystem has been mounted and can be used to open the default file manager if it does not automatically open. If the desktop does not provide a default file manager, Mount Tray will provide an "open with" dialogue so that you can select the utility to use to browse the contents of the USB device.
es: **Abrir Directorio del Medio:** esto aparecerá solo si se ha montado un sistema de archivos, y se puede utilizar para abrir el administrador de archivos predeterminado si no se abre de forma automática. Si el escritorio no proporciona un administrador de archivos predeterminado, la Bandeja de Montaje mostrará un diálogo de "abrir con" de manera que pueda seleccionar la utilería con la cual examinar los contenidos del dispositivo USB.

source: **View Disk Usage:** in the example shown in :numref:`Figure %s: View Disk Usage Using Mount Tray <mount2>`, a UFS-formatted USB device is mounted at :file:`/Media/STECH-1d`. The amount of disk space used by the system hard drive and the USB drive is shown in both GB and as a percentage of available disk space. The Mount Tray will turn yellow if disk space is over 70% and red if disk space is over 90%. If the internal disk drives are partitioned with any other filesystems, these will also appear in Mount Tray.
es: **Ver Uso del Disco:** en el ejemplo mostrado en la :numref:`Figura %s: Ver el Uso del Disco Usando la Bandeja de Montaje <mount2>`, un dispositivo USB formateado con UFS está montado en :file:`/Media/STECH-1d`. La cantidad de espacio usado en disco por el disco duro del sistema y el disco USB se muestra tanto en GB como en porcentaje de espacio disponible en disco. La Bandeja de Montaje se pondrá en amarillo si el espacio en disco está sobre el 70% y en rojo si el espacio en disco está arriba de 90%. Si los discos internos están particionados con cualquier otro sistema de archivos, éstos también aparecerán en la Bandeja de Montaje.

source: **Rescan Devices:** click this option if an entry for the USB device does not automatically appear.
es: **Reexaminar Dispositivos:** presione en esta opción si una entrada para el dispositivo USB no aparece automáticamente.

source: **Load ISO File:** used to mount an ISO to a memory disk. It will prompt for your password then open a browse menu so that you can browse to the location of the :file:`.iso` file. Once the file is selected and mounted, its contents will be displayed in the default file manager. When you are finished browsing the contents, close the file manager and click the "Eject" button for the memory device in Mount Tray and enter your password when prompted. As the ISO is unmounted, the memory disk is also detached from the system.
es: **Cargar imagen ISO:** se utiliza para montar una ISO en un disco en memoria. Le preguntará su contraseña y después abrirá un menú de navegación para que pueda examinar la localización del archivo :file:`.iso`. Una vez que el archivo se haya seleccionado y montado, sus contenidos se mostrarán en el administrador de archivos predeterminado. Cuando termine de explorar los contenidos, cierre el administrador de archivos y presione el botón "Expulsar" para el dispositivo en memoria en la Bandeja de Montaje e introduzca su constraseña cuando se le requiera. Como la ISO está desmontada, el disco en memoria también se desconecta del sistema.

source: **Change Settings:** as seen in :numref:`Figure %s: Configure Disk Space Check <mount3a>`, this screen allows you to configure whether or not optical disks automatically open using the default player, whether or not Mount Tray automatically rechecks the disk space used by mounted devices and how often to perform that check, and whether or not Mount Tray checks disk space when a disk is mounted.
es: **Cambiar Configuraciones:** como se muestra en la :numref:`Figura %s: Configurando la Revisión de Espacio en Disco <mount3a>`, esta pantalla le permite configurar si los discos ópticos se abren o no automáticamente usando el reproductor predeterminado, si la Bandeja de Montaje vuelve a checar automáticamente el espacio en disco usado por los dispositivos montados y qué tan seguido se realiza esta comprobación, y si la Bandeja de Montaje revisa o no el espacio en disco cuando un disco es montado.

source: **Close Tray:** click this option to remove Mount Tray from the system tray.
es: **Cerrar Bandeja:** presione en esta opción para eliminar la Bandeja de Montaje de la bandeja del sistema.

source: The previous section described PC-BSD®'s graphical mount utility. This graphical utility has a command-line backend, :command:`pc-sysconfig`, which can be used directly from the command line on TrueOS® systems, window managers without a system tray, or by users who prefer to use the command line.
es: La sección anterior describió la utilería gráfica de montaje de PC-BSD®. Esta utilería gráfica tiene un back-end en línea de comandos, :command:`pc-sysconfig`, que se puede usar directamente desde la línea de comandos en los sistemas TrueOS®, gestores de ventanas sin bandeja del sistema, o por usuarios que prefieren usar la línea de comandos.

source: For usage information, run the command without any options::
es: Para la información de uso, ejecute el comando sin ninguna de las opciones::

source: For example, to see a listed of the supported filesystems, use::
es: Por ejemplo, para ver una lista de los sistemas de archivos soportados, use::

source: PC-BSD Keyboard Settings
es: Configuración del Teclado PC-BSD

source: The PC-BSD® control panel includes a graphical utility for managing the keyboard's layout settings. To start the application, double-click its icon in Control Panel or type :command:`pc-syskeyboard` at the command line. A screenshot of this utility is seen in :numref:`Figure %s: Configuring Keyboard Settings <keyboard1>`.
es: El panel de control de PC-BSD® incluye una utilería gráfica para gestionar las configuraciones de la distribución del teclado. Para iniciar la aplicación, haga doble clic en su icono en el Panel de Control o ingrese :command:`pc-syskeyboard` en la línea de comandos. Una captura de pantalla de esta utilería se muestra en la :numref:`Figura %s: Configurando las Opciones del Teclado <keyboard1>`.

source: any changes made using this utility can be saved as either just this login session or permanently. To make the changes permanent, click the "Save to User Profile" button once you are finished making your changes. Otherwise, click the "Apply to Session" button. If you just click the "Close" button, your changes will not be saved.
es: Cualquier cambio que se haga usando esta utilería se puede guardar ya sea para esta sesión o permanentemente. Para hacer los cambios permanentes, presione el botón “Guardar en el Perfil del Usuario” una vez que haya finalizado con los cambios. De otra manera, presione el botón “Aplicar a la Sesión”. Si solo presiona el botón “Cerrar”, sus cambios no se guardarán.

source: Click the "Keyboard model" drop-down menu to select the type of keyboard. Note that the default model of "Generic 104-key PC" does **not** support special keys such as multimedia or Windows keys. You will need to change this default to enable support for hot keys.
es: Presione en el menú desplegable "Modelo de teclado" para seleccionar el tipo de teclado. Note que el modelo predeterminado de "PC Genérico de 104 teclas" **no soporta** teclas especiales tales como las de multimedia o Windows. Necesitará cambiar esta selección predeterminada para habilitar el soporte de las teclas de acceso rápido.

source: To add another keyboard layout, click the "+" button, which will open the screen shown in :numref:`Figure %s: Adding Another Layout <keyboard2>`. Highlight the desired layout. This will activate the "Layout variant" drop-down menu where you can select to either use the "Typical" variant or a specific variant. Press "OK" to add the configured layout.
es: Para añadir otra distribución de teclado, presione el botón "+", el cual abrirá la pantalla mostrada en la :numref:`Figura %s: Añadiendo Otra Distribución <keyboard2>`. Seleccione la distribución deseada. Esto activará el menú desplegable "Variante de Distribución" donde puede seleccionar usar ya sea la variante "Típica" o una variante específica. Presione "OK" para añadir la distribución configurada.

source: To edit an existing layout, highlight it then click the icon that looks like a pencil. You can then either change the "Layout variant" for that layout or select a different layout entirely. Selecting a different layout will replace the current layout.
es: Para editar una distribución existente, selecciónelo y presione el icono que parece un lápiz. Puede entonces cambiar la "Variante de distribución" para esa distribución o seleccionar una distribución completamente diferente. Seleccionar una distribución diferente reemplazará la distribución actual.

source: If there are multiple layout entries defined in the "Keyboard layouts" screen, you can delete a layout by highlighting it and clicking the "-" icon. Note that this icon is greyed out when there is only one entry as at least one keyboard layout must be defined.
es: Si hay múltiples entradas de distribuciones definidas en la pantalla "Distribuciones de Teclado", puede eliminar una seleccionándola y presionando el icono "-". Note que este icono está atenuado cuando hay solo una entrada ya que al menos una distribución de teclado debe estar definida.

source: After creating or editing a layout, you can test it by typing some text into the "Test here" field.
es: Después de crear o editar una distribución, puede probarla escribiendo algo de texto en el campo "Probar aquí".

source: To configure keyboard shortcuts, click the "Options" tab. As seen in :numref:`Figure %s: Configuring Layout Switch Keys <keyboard3>`, the default view is used to set the keyboard layout switch keys.
es: Para configurar los atajos de teclado, presione la pestaña "Opciones". Como se muestra en la :numref:`Figura %s: Configurando las Teclas de Acceso Rápido de la Distribución <keyboard3>`, la vista predeterminada se usa para establecer las teclas de accerso rápido de la distribución del teclado.

source: If you wish to set the keys for terminating the graphical session, check the box "Ctrl+Alt+Backspace terminates xorg".
es: Si desea establecer las teclas para terminar la sesión gráfica, seleccione la casilla "Ctrl+Alt+Retroceso termina xorg".

source: To configure many more keyboard shortcuts, click the "Advanced view" button which will open the screen shown in :numref:`Figure %s: Configuring Keyboard Shortcuts <keyboard4>`. In this example, several categories have been expanded to show their options. To enable an option, check its box.
es: Para configurar muchas teclas rápidas más, presione el botón "Vista Avanzada" el cual abrirá la pantalla mostrada en la :numref:`Figura %s: Configurando Atajos del Teclado <keyboard4>`. En este ejemplo, algunas categorías han sido expandidas para mostrar sus opciones. Para habilitar una opción, seleccione esta casilla.

source: PC-BSD Mixer Tray
es: Bandeja del Mezclador de PC-BSD

source: PC-BSD® includes a graphical utility for managing the sound card's mixer settings. Desktops that include a system tray should have a speaker icon in the system tray which can be used to access this utility. If this icon does not appear in the system tray, either double-click the "PC-BSD Mixer Tray" icon in Control Panel or type :command:`pc-mixer &` to add it. Alternately, to open this application without adding it to the system tray, type :command:`pc-mixer -notray`.
es: PC-BSD® incluye una utilería gráfica para administrar la configuración del mezclador de la tarjeta de sonido. Los escritorios que incluyen una bandeja del sistema deberían tener un icono con un altavoz en ella, el cual se puede usar para accesar a esta utilería. Si este icono no aparece en la bandeja del sistema, haga doble clic en el icono "Bandeja del Mezclador de PC-BSD" en el Panel de Control o escriba :command:`pc-mixer &` para añadirlo. Alternativamente, para abrir esta aplicación sin añadirla a la bandeja del sistema, escriba :command:`pc-mixer -notray`.

source: :numref:`Figure %s: Mixer Icon <sound1>` shows an example of right-clicking the icon in the system tray on a system with multiple audio outputs. If the system only has one audio output, the "Outputs" menu will not be displayed. To change the default output, click its entry in the "Output" menu.
es: La :numref:`Figura %s: Icono del Mezclador <sound1>` muestra un ejemplo de clic derecho en el icono en la bandeja del sistema en un sistema con múltiples salidas de audio. Si el sistema solo tiene una salida de audio, el menú "Salidas" no se desplegará. Para cambiar la salida predeterminada, presione en su entrada en el menú "Salidas".

source: :numref:`Figure %s: Mixer Controls <sound2>` shows the mixer application which can be opened by either clicking the "Mixer" button shown in :numref:`Figure %s: Mixer Icon <sound1>` or by typing :command:`pc-mixer -notray`.
es: La :numref:`Figura %s: Controles del Mezclador <sound2>` muestra la aplicación del mezclador, la cual se puede abrir ya sea presionando el botón "Mezclador" mostrado en la :numref:`Figura %s: Icono del Mezclador <sound1>` o escribiendo :command:`pc-mixer -notray`.

source: The "Mixer Controls" screen provides sliders to modify the left and right channels that control volume, pcm (the sound driver), the speaker, the microphone, the recording level, and the sound provided by the monitor. Each control can be muted/unmuted individually by clicking its "Mute" or"Unmute" button, depending upon its current mute state.
es: La pantalla "Controles del Mezclador" proporciona controles deslizantes para modificar los canales izquierdo y derecho que controlan el volumen, pcm (el controlador de sonido), el altavoz, el micrófono, el nivel de grabación, y el sonido proporcionado por el monitor. Cada control se puede silenciar/activar individualmente presionando sus botones "Silenciar" o "Activar", dependiendo del estado en el que se encuentre.

source: :numref:`Figure %s: System Sound Configuration <sound3>` shows the "System Configuration" tab.
es: La :numref:`Figura %s: Configuración del Sonido del Sistema <sound3>` muestra la pestaña "Configuración del Sistema".

source: This tab contains the following options:
es: Esta pestaña contiene las siguientes opciones:

source: **Recording Device:** use the drop-down menu to select the device to use for recording sound.
es: **Dispositivo de Grabación:** use el menú desplegable para seleccionar el dispositivo que usará para grabar sonido.

source: **Default Tray Device:** use the drop-down menu to set the default slider to display in the system tray.
es: **Dispositivo Predeterminado de la Bandeja:** use el menú desplegable para establecer el control deslizante predeterminado que se mostrará en la bandeja del sistema.

source: **Audio Output Channel:** use the drop-down menu to change the sound device and use the "Test" button to determine that sound is working. This is sometimes necessary when you change audio devices. For example, if you connect a USB headset, PC-BSD® will detect the new device and will automatically change the audio device to the USB input. However, if you insert a headset into an audio jack, the system may not detect the new input so you will have to manually change the default device.
es: **Canal de Salida de Audio:** use el menú desplegable para cambiar el dispositivo de sonido y use el botón "Probar" para determinar que el sonido está funcionando. Esto es necesario algunas veces cuando cambia los dispositivos de audio. Por ejemplo, si conecta unos auriculares USB, PC-BSD® los detectará y automáticamente cambiará el dispositivo de audio a la entrada USB. Sin embargo, si inserta unos auriculares en un conector de audio, puede que el sistema no detecte la nueva entrada, de manera que tendrá que cambiar manualmente el dispositivo por defecto.

source: The "File" menu can be used to quit this mixer screen or to close both this screen and remove the icon from the system tray.
es: El menú "Archivo" se puede usar para salir de esta pantalla del mezclador o para cerrar esta pantalla y eliminar el icono de la bandeja del sistema.

source: The "Configuration" menu provides options for accessing the "PulseAudio Mixer" and "PulseAudio Settings" utilities as well as for restarting PulseAudio. PC-BSD® provides full `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_ support and these utilities can be used to configure discoverable network sound devices and mixer levels.
es: El menú de “Configuración” proporciona opciones para accesar al “Mezclador de PulseAudio” y las utilerías de “Configuración de PulseAudio”, así como para reiniciar PulseAudio. PC-BSD® proporciona soporte completo para `PulseAudio <https://www.freedesktop.org/wiki/Software/PulseAudio/>`_ y estas utilerías se pueden usar para configurar dispositivos de sonido que se descubran en la red y los niveles del mezclador.

source: For command line only systems, type :command:`mixer` from the command line to see the current sound settings::
es: Para sistemas con sólo línea de comandos, escriba :command:`mixer` en la línea de comandos para ver la configuración actual de sonido::

source: If any of these settings are set to *0*, set them to a higher value, by specifying the name of the mixer setting and a percentage value up to *100*::
es: Si cualquiera de estos ajustes están establecidos a *0*, cámbielos a un valor más alto, especificando el nombre del ajuste del mezclador y un valor de porcentaje de hasta *100*::

source: You can make that change permanent by creating a file named :file:`.xprofile` in your home directory that contains the corrected mixer setting.
es: Puede hacer ese cambio permanente creando un archivo llamado :file:`.xprofile` en su directorio personal que contendrá la configuración corregida del mezclador.

source: Troubleshooting Sound
es: Resolviendo Problemas de Sonido

source: If you only get one or two mixer settings, you need to change the default mixer channel. As the superuser, try this command::
es: Si sólo obtiene una o dos configuraciones del mezclador, necesita cambiar el canal del mezclador por defecto. Como administrador, pruebe este comando::

source: To see if that changed to the correct channel, type :command:`mixer` again. If you still only have one or two mixer settings, try setting the :command:`sysctl` value to *2*, and if necessary, to *3*.
es: Para ver si eso cambió al canal correcto, escriba otra vez :command:`mixer`. Si sigue teniendo una o dos configuraciones del mezclador, intente establecer el valor :command:`sysctl` a *2*, y si es necesario, a *3*.

source: Once you have all of the mixer settings and none are set to *0*, your sound should work. If it still doesn't, these resources may help you to pinpoint the problem:
es: Una vez que tenga todas las configuraciones del mezclador y ninguna esté fijada en *0*, su sonido debería funcionar. Si aún no lo hace, estos recursos pueden ayudarle a descubrir el problema:

source: `Sound Section of FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/sound-setup.html>`_
es: `Sección de Sonido del Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/sound-setup.html>`_

source: `FreeBSD Sound Wiki <https://wiki.FreeBSD.org/Sound>`_
es: `Wiki de Sonido de FreeBSD <https://wiki.FreeBSD.org/Sound>`_
