Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/controlpanel.po
Languages: es

source: Control Panel
es: Panel de Control

source: PC-BSD® provides a Control Panel which contains tools for managing your system. The Control Panel is available from any desktop, meaning it is available regardless of which desktop you log into.
es: PC-BSD® proporciona un Panel de Control que contiene herramientas para administrar su sistema. El Panel de Control está disponible desde cualquier escritorio, lo que significa que está disponible independientemente del escritorio en el que se encuentre.

source: if a desktop does not contain an icon or menu item for Control Panel, type :command:`pc-controlpanel` from a shell prompt to launch the Control Panel.
es: Si el escritorio no contiene un icono o un elemento en el menú para el Panel de Control, escriba :command:`pc-controlpanel` en una consola para abrir el Panel de Control.

source: A screenshot of Control Panel started from the KDE desktop can be seen in :numref:`Figure %s: PC-BSD® Control Panel <control1a>`.
es: Una captura de pantalla del Panel de Control iniciado desde el escritorio KDE puede verse en la :numref:`Figura %s: Panel de Control de PC-BSD® <control1a>`.

source: The available utilities are divided into sections. If you click a grey section bar, you can toggle between displaying (bar has up arrow) or hiding (bar has down arrow) its icons.
es: Las utilerías disponibles están divididas en secciones. Si presiona en una barra de sección gris, puede cambiar entre mostrar (la barra tiene la flecha hacia arriba) u ocultar (la barra tiene la flecha hacia abajo) sus iconos.

source: The search box in the upper right can be used to find the proper control panel item if you know what you would like to configure but are uncertain which utility to use. The icon next to the search box can be used to change the size of the icons, change the view from a grid to a list, and organize the icons into a fixed layout.
es: El campo de búsqueda en la parte superior derecha se puede usar para encontrar un elemento apropiado del panel de control si sabe lo que le gustaría configurar pero no está seguro qué herramienta usar. El icono que está a continuación del campo de búsqueda se puede usar para cambiar el tamaño de los iconos, cambiar de una vista en rejilla a un listado, y para organizar los iconos en disposiciones fijas.

source: If an icon includes a yellow exclamation mark, you will need to input your password in order to access that configuration utility.
es: Si un icono incluye un signo de exclamación amarillo, necesitará introducir su contraseña para acceder a la utilería de configuración.

source: if your user account is not a member of the *wheel* group, you will not see the configuration utilities in Control Panel that require a password. By default, the first user account that you create is made a member of the *wheel* group. You can log in as that user and use :ref:`User Manager` to add other accounts to this group.
es: Si su cuenta de usuario no es parte del grupo *wheel* no verá las utilerías de configuración en el Panel de Control que requieren una contaseña. Por defecto, la primera cuenta de usuario que se creó es miembro del grupo *wheel*. Puede conectarse como ese usuario y usar el :ref:`Administrador de Usuarios` para añadir otras cuentas a este grupo.

source: Control Panel includes a "desktop selector" menu which allows you to load the configuration utilities from just the operating system (as seen in the example in :numref:`Figure %s: PC-BSD® Control Panel <control1a>`), all installed desktops, or one of these installed desktops: KDE, GNOME, Cinnamon, MATE, XFCE4, LXDE, or Lumina. In the example shown in :numref:`Figure %s: Desktop Selector Menu <control2>`, the user is currently logged into the LXDE desktop but they have chosen to view the GNOME utilities. The menu icon indicates the control panel view while "(current)" will be beside the desktop that is presently active.
es: El Panel de Control incluye un menú “selector de escritorio” que le permite cargar las utilerías de configuración desde el sistema operativo (como se muestra en el ejemplo en la :numref:`Figura %s: Panel de Control de PC-BSD® <control1a>`), desde todos los escritorios instalados, o uno de estos escritorios instalados: KDE, GNOME, Cinnamon, MATE, XFCE4, LXDE, o Lumina. En el ejemplo mostrado en la :numref:`Figura %s: Menú Selector de Escritorio <control2>`, el usuario está conectado en el escritorio LXDE pero ha elegido ver las utilerías de GNOME. El icono del menú indica la vista del panel de control mientras “(actual)” estará junto al escritorio que está activo en este momento.

source: Switching between the icons in the selector changes the icons displayed within the control panel window to match those used in that desktop. If "All desktops" is set by the desktop selector, you will see every utility that is available, depending upon which desktops are currently installed. You can change which desktops are installed using :ref:`AppCafe®`.
es: Intercambiando entre los iconos en el selector se cambian los iconos que se muestran en la ventana del panel de control para que coincidan con aquellos usados en ese escritorio. Si "Todos los escritorios" está seleccionado por el selector de escritorio, verá todas las utilerías que están disponibles, dependiendo de los escritorios que estén instalados. Puede cambiar qué escritorios están instalados usando :ref:`AppCafe®`.

source: The following utilities are found in the Control Panel of a PC-BSD® system, regardless of which desktops are installed:
es: Las siguientes utilerías se encuentran en el Panel de Control de un sistema PC-BSD®, independientemente de qué escritorios estén instalados:

source: **Software and updates**
es: **Software y actualizaciones**

source: :ref:`Update Manager`
es: :ref:`Administrador de Actualizaciones`

source: **System management**
es: **Administración del Sistema**

source: :ref:`About`
es: :ref:`Acerca de`

source: :ref:`Active Directory & LDAP`
es: :ref:`Directorio Activo y LDAP`

source: :ref:`Boot Manager`
es: :ref:`Gestor de Arranque`

source: :ref:`Hardware Compatibility`
es: :ref:`Compatibilidad de Hardware`

source: :ref:`Login Manager`
es: :ref:`Gestor de Acceso`

source: :ref:`Service Manager`
es: :ref:`Administrador de Servicios`

source: :ref:`System Manager`
es: :ref:`Administrador del Sistema`

source: :ref:`User Manager`
es: :ref:`Administrador de Usuarios`

source: :ref:`Disk Manager`
es: :ref:`Administrador de Discos`

source: :ref:`Display`
es: :ref:`Pantalla`

source: :ref:`Mount Tray`
es: :ref:`Bandeja de Montaje`

source: :ref:`PC-BSD Keyboard Settings`
es: :ref:`Configuración del Teclado de PC-BSD`

source: :ref:`PC-BSD Mixer Tray`
es: :ref:`Bandeja del Mezclador de PC-BSD`

source: :ref:`Printing`
es: :ref:`Impresión`

source: :ref:`Scanner`
es: :ref:`Escáner`

source: **Networking**
es: **Red**

source: :ref:`Firewall Manager`
es: :ref:`Administrador de Cortafuegos`

source: :ref:`Network Configuration`
es: :ref:`Configuración de la Red`

source: **Tools**
es: **Herramientas**

source: :ref:`Report a bug`
es: :ref:`Informar de un Error`

source: This chapter describes these utilities in more detail.
es: Este capítulo describe estas utilerías con más detalle.

source: About
es: Acerca de

source: The "About" icon of Control Panel can be used to quickly find information about the PC-BSD® system. To start the application, double-click its icon in Control Panel or type :command:`about-gui`. An example is seen in :numref:`Figure %s: About Information <about1a>`.
es: El icono “Acerca de” del Panel de Control puede usarse para encontrar rápidamente información acerca del sistema PC-BSD®. Para iniciar la aplicación, haga doble clic en su icono en el Panel de Control o ingrese :command:`about-gui`. Un ejemplo se puede apreciar en la :numref:`Figura %s: Información Acerca de <about1a>`.

source: The displayed information includes the version of PC-BSD®, whether the system is using the PRODUCTION, EDGE, or ENTERPRISE package set, the hostname of the system, the underlying version of FreeBSD, the architecture, the name of the kernel (ident), the type of CPU, and the amount of installed memory.
es: La información mostrada incluye la versión de PC-BSD®, sin importar si el sistema está usando el set de paquetes PRODUCTION, EDGE, o ENTERPRISE, el nombre del equipo, la versión base de FreeBSD, la arquitectura, el nombre del kernel (ident), el tipo de CPU y la cantidad de memoria instalada.

source: If you click the "Software and system components" button, the screen shown in :numref:`Figure %s: System Components Screen <about2a>` will be displayed.
es: Si presiona el botón “Software y Componentes del Sistema”, se mostrará la pantalla mostrada en la :numref:`Figura %s: Pantalla Componentes del Sistema <about2a>`.

source: Click the arrow next to an entry to display or hide its its details. The following information is available:
es: Presione la flecha junto a una entrada para mostrar u ocultar sus detalles. La siguiente información está disponible:

source: **PCBSD components:** the version number for the PC-BSD® CLI and GUI utilities.
es: **Componentes PCBSD:** el número de versión de las utilerías CLI y GUI de PC-BSD®.

source: **Video stack:** the Xorg version number, the type and version of the loaded video driver, and the version of the loaded VirtualBox driver.
es: **Pila de Video:** el número de versión de Xorg, el tipo y versión del controlador de video cargado, y la versión del controlador de Virtualbox cargado.

source: **Toolkits:** the version numbers for the installed graphical toolkits.
es: **Toolkits:** los números de versión para los toolkits gráficos instalados.

source: **Desktops:** the version numbers of each installed desktop environment.
es: **Escritorios:** los números de versión para cada entorno de escritorio instalado.

source: **Office:** if an office suite is installed, its version number.
es: **Oficina:** si una suite de oficina está instalada, su número de versión.

source: **Scripting languages:** the version numbers of any installed scripting languages, such as Perl or Python.
es: **Lenguajes de Script:** los números de versión de cualquier lenguaje de script instalado, como Perl o Python.

source: Active Directory & LDAP
es: Directorio Activo y LDAP

source: The "Active Directory & LDAP" icon is used for managing connections to an Active Directory or OpenLDAP domain. If your network contains an Active Directory or OpenLDAP server, use this icon to input the settings needed to connect to your account information stored on the network.
es: El icono "Directorio Activo y LDAP" se emplea para administrar conexiones a un Directorio Activo o dominio OpenLDAP. Si su red contiene un Directorio Activo o un servidor OpenLAP, utilice este icono para introducir las configuraciones necesarias para conectarse a la información de su cuenta almacenada en la red.

source: This utility is to manage the settings of the client, not the Active Directory or OpenLDAP server itself. This application also needs more testing from users. If you have trouble using this utility or find a bug, please post the details using the :ref:`Report a bug` tool.
es: Esta herramienta sirve para administrar la configuración del cliente, no del Directorio Activo ni del servidor OpenLDAP mismo. Esta aplicación también necesita más comprobaciones por parte de los usuarios. Si tiene problemas cuando use esta aplicación o encuentra un error, por favor, envíe los detalles mediante la herramienta :ref:`Informar de un Error`.

source: To start the application, double-click its icon in Control Panel or type :command:`pc-su pc-adsldap`. You will be prompted to input your password. :numref:`Figure %s: Initial Active Directory & LDAP Screen <ldap1>` shows the configuration utility with the Active Directory tab open.
es: Para iniciar la aplicación, haga doble clic en su icono en el Panel de Control o ingrese :command:`pc-su pc-adsldap`. Se le preguntará su contraseña. La :numref:`Figura %s: Pantalla Inicial de Directorio Activo y LDAP <ldap1>` muestra la utilería de configuración con la pestaña Directorio Activo abierta.

source: to prevent "DNS Update for localhost.pcbsd-3881 failed: ERROR_DNS_UPDATE_FAILED" errors, set the PC-BSD® hostname to include the realm name. For example, if the current hostname is "pcbsd-3881" and the realm name is "maloney.local", change the hostname to "pcbsd-3881.maloney.local" in :menuselection:`Control Panel --> Network Configuration (Advanced) --> Misc`.
es: para evitar los errores "DNS Update for localhost.pcbsd-3881 failed: ERROR_DNS_UPDATE_FAILED", establezca el nombre del equipo PC-BSD® para que incluya el nombre del dominio. Por ejemplo, si el nombre del equipo es "pcbsd-3881" y el nombre del dominio es "maloney.local", cambie el nombre del equipo a "pcbsd-3881.maloney.local" en :menuselection:`Panel de Control --> Configuración de Red (Avanzada) --> Misceláneos`.

source: If you need to connect to a network running Active Directory, check the box "Enable Active Directory". This will change the greyed-out status of the rest of the screen, allowing you to configure the following:
es: Si necesita conectarse a una red que ejecuta un Directorio Activo, marque la casilla "Habilitar Directorio Activo". Esto cambiará el estado grisáceo del resto de la pantalla, permitiéndole configurar lo siguiente:

source: **Domain Name (DNS/Realm-Name):** input the name of the Active Directory domain (e.g. *example.com*) or child domain (e.g. *sales.example.com*). This setting is mandatory.
es: **Nombre del Dominio (DNS/Nombre-Dominio):** introduzca el nombre de dominio del Directorio Activo (por ejemplo, *ejemplo.com*) o el dominio hijo (e.g. *ventas.ejemplo.com*). Este ajuste es obligatorio.

source: **NetBIOS Name:** input the hostname of the PC-BSD® system as listed in the :ref:`About` icon.
es: **Nombre NetBIOS:** introduzca el nombre del equipo del sistema PC-BSD® como se lista en el icono :ref:`Acerca de`.

source: **Workgroup Name:** input the name of the Windows workgroup. Unless the administrator has changed it, the default workgroup name is *WORKGROUP*.
es: **Nombre del Grupo de Trabajo:** introduzca el nombre del grupo de trabajo de Windows. A no ser que el administrador lo haya cambiado, el grupo de trabajo predeterminado es *WORKGROUP*.

source: **Allow Trusted Domains:** only check this box if the network has `active domain/forest trusts <https://technet.microsoft.com/en-us/library/cc757352(WS.10).aspx>`_.
es: **Permitir Dominios de Confianza:** solo marque esta casilla si la red tiene `dominio activo/confianza en bosques <https://technet.microsoft.com/en-us/library/cc757352(WS.10).aspx>`_.

source: **Administrator Name:** input the name of the Active Directory Administrator account.
es: **Nombre del Administrador:** introduzca el nombre de la cuenta del Administrador del Directorio Activo.

source: **Administrator Password:** input and confirm the password for the Active Directory Administrator account.
es: **Contraseña del Administrador:** introduzca y confirme la contraseña para la cuenta del Adminstrador del Directorio Activo.

source: The values that you input using this GUI are saved to :file:`/usr/local/etc/pc-activedirectory.conf` and :file:`/usr/local/etc/smb4.conf`.
es: Los valores que introduzca usando esta GUI (Interfaz Gráfica de Usuario) se guardan en :file:`/usr/local/etc/pc-activedirectory.conf` y en :file:`/usr/local/etc/smb4.conf`.

source: once you enable AD, you can no longer configure auto login in :ref:`Login Manager` as users will now authenticate with the Active Directory server.
es: Una vez que habilite DA, ya no podrá configurar el acceso automático en el :ref:`Administrador de Acceso` ya que los usuarios se identificarán ahora con el servidor del Directorio Activo.

source: :numref:`Figure %s: Managing LDAP Client Settings <ldap2>` shows the configuration utility with the LDAP tab open.
es: La :numref:`Figura %s: Administrando las Configuraciones del Cliente LDAP <ldap2>` muestra la utilería de configuración con la pestaña LDAP abierta.

source: If you need to connect to a network which contains a configured LDAP server, check the box "Enable LDAP". This will change the greyed-out status of the rest of the screen, allowing you to configure the following:
es: Si necesita conectarse a una red que contiene un servidor LDAP configurado marque la casilla "Habilitar LDAP". Esto cambiará el estado grisáceo del resto de la pantalla, permitiéndole configurar lo siguiente:

source: **Hostname:** input the hostname or IP address of the OpenLDAP server. This setting is mandatory.
es: **Nombre del Equipo:** introduzca el nombre del equipo o la dirección IP del servidor OpenLDAP. Esta configuración es obligatoria.

source: **Base DN:** input the top level of the LDAP directory tree to be used when searching for resources (e.g. *dc=test,dc=org*).
es: **DN Base:** introduzca el nivel superior del árbol del directorio LDAP que se usará cuando se busquen recursos (por ejemplo *dc=test,dc=org*).

source: **Allow Anon Binding:** only check this box if the LDAP server allows read and write access without requiring authentication.
es: **Permitir Enlaces Anónimos:** sólo marque esta casilla si el servidor LDAP permite acceso de lectura y escritura sin requerir autenticación.

source: **Root bind DN:** input the name of the administrative account on the LDAP server (e.g. *cn=Manager,dc=test,dc=org*).
es: **Root bind DN:** introduzca el nombre de la cuenta administrativa en el servidor LDAP (por ejemplo *cn=Manager,dc=test,dc=org*).

source: **Root bind password:** input the password for the "Root bind DN".
es: **Contraseña Root bind:** introduzca la contraseña para el "Root bind DN".

source: **Password Encryption:** select a type supported by the LDAP server, choices are: "clear" (unencrypted), "crypt", "md5", "nds", "racf", "ad", or "exop".
es: **Encriptado de Contraseña:** seleccione un tipo soportado por el servidor LDAP, las opciones son: "clear" (no encriptado), "crypt", "md5", "nds", "racf", "ad", o "exop".

source: **User Suffix:** this setting is optional and is usually a department or company name. The input value will be added to the name when a user account is added to the LDAP directory
es: **Sufijo de Usuario:** este ajuste es opcional y es normalmente un nombre de departamento o de compañía. El valor introducido se añadirá al nombre cuando una cuenta de usuario se añada al directorio LDAP.

source: **Group Suffix:** this setting is optional and is usually a department or company name. The input value will be added to the name when a group is added to the LDAP directory.
es: **Sufijo del Grupo:** este ajuste es opcional y es normalmente el nombre de un departamento o de una compañía. El valor introducido se añadirá al nombre cuando un grupo se añada al directorio LDAP.

source: **Password Suffix:** this setting is optional. The input value will be added to the password when a password is added to the LDAP directory.
es: **Sufijo de la contraseña:** este ajuste es opcional. El valor introducido se añadirá a la contraseña cuando se añada una contraseña al directorio LDAP.

source: **Machine Suffix:** this setting is optional and usually represents a description such as server or accounting. The input value will be added to the name when a system is added to the LDAP directory.
es: **Sufijo del Equipo:** este ajuste es opcional y representa normalmente una descripción como la de un servidor o cuenta. El valor introducido se añadirá al nombre cuando se añada un sistema al directorio LDAP.

source: **Encryption Mode:** choices are "NONE", "SSL", or "TLS". The selected type must be supported by the LDAP server.
es: **Modo de Encriptado:** las posibilidades son "NINGUNO", "SSL" o "TLS". El tipo seleccionado debe ser soportado por el servidor LDAP.

source: **Self Signed Certificate:** used to verify the certificate of the LDAP server if SSL connections are used. Paste the output of the command :command:`openssl s_client -connect server:port -showcerts`.
es: **Certificado Autofirmado:** empleado para verificar el certificado del servidor LDAP si se están usando conexiones SSL. Pegue la salida del comando :command:`openssl s_client -connect server:port -showcerts`.

source: **Auxiliary Parameters:** `ldap.conf(5) <http://www.openldap.org/software/man.cgi?query=ldap.conf>`_ options, one per line, not covered by other options in this screen.
es: **Parámetros Auxiliares:** opciones de `ldap.conf(5) <http://www.openldap.org/software/man.cgi?query=ldap.conf>`_, una por línea, no cubiertas por otras opciones en esta pantalla.

source: The values that you input into this tab are saved to :file:`/usr/local/etc/pc-ldap.conf`.
es: Los valores que introduzca en esta pestaña se guardarán en :file:`/usr/local/etc/pc-ldap.conf`.

source: If you are new to LDAP terminology, you may find it useful to skim through the `OpenLDAP Software 2.4 Administrator's Guide <http://www.openldap.org/doc/admin24/>`_.
es: Si la terminología LDAP es nueva para usted, puede serle útil echar un vistazo a la `Guía del Administrador de OpenLDAP 2.4 <http://www.openldap.org/doc/admin24/>`_.

source: Boot Manager
es: Gestor de Arranque

source: PC-BSD® supports a feature of ZFS known as multiple boot environments (BEs). With multiple boot environments, the process of updating software becomes a low-risk operation as you can backup your current boot environment before upgrading or making software updates to your system. If needed, you also have the option of booting into a backup boot environment. For example:
es: PC-BSD® soporta una característica de ZFS conocida como múltiples entornos de arranque (BEs). Con múltiples BE, el proceso de actualización de software pasa a se una operación de bajo riesgo ya que puede hacer copias de seguridad de su entorno de arranque actual antes de la actualización del sistema o de la actualización de software. Si es necesario, también tiene la opción de arrancar dentro del respaldo del BE. Por ejemplo:

source: If you are making software changes to a boot environment, you can take a snapshot of that environment at any stage during the modifications.
es: Si está haciendo cambios de software a un BE, puede tomar un snapshot de ese entorno en cualquier momento durante las modificaciones.

source: You can save multiple boot environments on your system and perform various updates on each of them as needed. You can install, test, and update different software packages on each.
es: Puede guardar múltiples BE en su sistema y realizar varias actualizaciones en cada uno de ellos según sea necesario. Puede instalar, probar, y actualizar diferentes paquetes de software en cada uno de ellos.

source: You can mount a boot environment in order to :command:`chroot` into the mount point and update specific packages on the mounted environment.
es: Puede montar un BE para hacer :command:`chroot` en el punto de montaje y actualizar paquetes específicos en el entorno montado.

source: You can move a boot environment to another machine, physical or virtual, in order to check hardware support.
es: Puede mover un BE a otra máquina, física o virtual, para comprobar el soporte de hardware.
