Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/desktops.po
Languages: es

source: The `Lumina Desktop Environment <http://lumina-desktop.org/>`_ (Lumina for short) is a lightweight, XDG-compliant, BSD-licensed desktop environment that focuses specifically on streamlining the ability to complete work while minimizing system overhead. It is specifically designed for PC-BSD® and FreeBSD, but has also been ported to many other BSD and Linux operating systems. It is based on the Qt graphical toolkit and the Fluxbox window manager, and uses a small number of X utilities for various tasks, such as :command:`numlockx` and :command:`xscreensaver`.
es: El `Entorno de Escritorio Lumina <http://lumina-desktop.org/>`_ (mejor conocido como Lumina) es un entorno ligero, compatible con XDG, y de licencia BSD que se enfoca específicamente en mejorar la habilidad de dejar el trabajo hecho, a la vez que minimiza la sobrecarga en el sistema. Está diseñado específicamente para PC-BSD® y FreeBSD, pero también ha sido portado a muchos otros sistemas operativos BSD y Linux. Esta basado en el toolkit gráfico QT y el manejador de ventanas Fluxbox, y usa un pequeño conjunto de utilidades de X tales como :command:`numlockx` y :command:`xscreensaver` para llevar a cabo varias tareas.

source: Lumina's features include:
es: Las características de Lumina incluyen:

source: Very little system overhead.
es: Mínima sobrecarga del sistema.

source: Intelligent "favorites" system for creating quick shortcuts to applications, files, and directories.
es: Un sistema inteligente de "favoritos" para crear accesos directos rápidos a aplicaciones, archivos y directorios.

source: ZFS file restore functionality through the Insight File Manager.
es: Funcionalidad ZFS de restauración de archivos a través del Administrador de Archivos Insight.

source: Desktop system is plugin-based, which is similar to Android or other modern operating systems.
es: El sistema de escritorio esta basado en plugins, lo cual es similar a Android y otros sistemas operativos modernos.

source: Simple access to operating system-specific functionality such as screen brightness, audio volume, and battery status.
es: Acceso simple para funcionalidad operativa específica del sistema como brillo de pantalla, volúmen de audio, y estatus de batería.

source: :numref:`Figure %s: Lumina Desktop <lumina1>` shows a screenshot of Lumina on a PC-BSD® |version| system with the "User" button clicked.
es: La :numref:`Figura %s: Escritorio Lumina <lumina1>` muestra una captura de pantalla de Lumina en un sistema PC-BSD® |version| con el botón de "Usuario" presionado.

source: Lumina provides the following built-in utilities:
es: Lumina proporciona las siguientes utilerías nativas:

source: **Lumina Configuration:** allows the user to configure every aspect of the desktop and is the recommended way to make changes. To launch this utility, click the "User" icon then :menuselection:`Desktop Preferences --> Desktop Appearance/Plugins` or right-click the desktop and click :menuselection:`Settings --> Desktop`, or type :command:`lumina-config` from an xterm.
es: **Configuración de Lumina:** le permite al usuario configurar cada aspecto del escritorio y es la manera recomendada de hacer cambios. Para ejecutar esta utilería, presione en el icono de "Usuario" y después en :menuselection:`Preferencias del Escritorio --> Apariencia del Escritorio/Plugins` o de clic derecho en el escritorio y presione :menuselection:`Configuraciones --> Escritorio`, o ingrese :command:`lumina-config` desde una xterm.

source: **Lumina Screenshot:** used to take screenshots of the desktop or applications and save them as PNG image files. To launch this utility, click the icon for :menuselection:`System Applications --> Lumina Screenshot` or type :command:`lumina-screenshot` from an xterm.
es: **Captura de Pantalla de Lumina:** se usa para tomar capturas del escritorio o aplicaciones y guardarlas como archivos de imágen PNG. Para ejecutar esta utilería, presione el icono para :menuselection:`Aplicaciones del Sistema --> Captura de Pantalla de Lumina` o ingrese :command:`lumina-screenshot` desde una xterm.

source: **Insight File Manager:** allows the user to easily browse and modify files on the local system on a per-directory basis. To open Insight, right-click the desktop and select "Browse System" or type :command:`lumina-fm` from an xterm.
es: **Administrador de Archivos Insight:** le permite al usuario examinar fácilmente y modificar archivos en el sistema local en una base por-directorio. Para abrir Insight, de clic derecho en el escritorio y seleccione "Examinar Sistema" o ingrese :command:`lumina-fm` desde una xterm.

source: **Lumina Search:** provides the ability to easily search for and launch applications or to quickly search for file and directories. Type :command:`lumina-search` to launch this utility.
es: **Búsqueda Lumina:** proporciona la habilidad de fácilmente buscar y lanzar aplicaciones o rápidamente buscar archivos y directorios. Ingrese :command:`lumina-search` para lanzar esta utilería.

source: **Lumina Xconfig:** provides the ability to probe and manage any number of attached monitors. To start this utility, right-click the desktop and select :menuselection:`Settings --> Screen Configuration`, click the "User" icon then :menuselection:`Desktop Preferences --> Screen Configuration`, or type :command:`lumina-xconfig` from an xterm.
es: **Lumina Xconfig:** proporciona la habilidad de probar y administrar cualquier número de monitores conectados. Para iniciar esta utilería, haga clic derecho en el escritorio y seleccione :menuselection:`Configuraciones --> Configuración de Pantalla`, presione el icono "Usuario" y luego :menuselection:`Preferencias del Escritorio --> Configuración de la Pantalla`, o ingrese :command:`lumina-xconfig` desde una xterm.

source: Refer to the `Lumina Handbook <http://lumina-desktop.org/handbook/>`_ for detailed instructions on how to configure and use Lumina and its applications.
es: Refiérase al `Manual de Lumina <http://lumina-desktop.org/handbook/>`_ para instrucciones detalladas en cómo configurar y usar Lumina y sus aplicaciones.

source: The `Lightweight X11 Desktop Environment <http://lxde.org/>`_ is an excellent choice for older hardware or for users who want a complete desktop environment without all of the overhead required by KDE or GNOME. Since it is XDG-compliant, the PC-BSD® :ref:`Control Panel`, :ref:`AppCafe®`, and :ref:`Life Preserver` are available on the desktop and integrated into LXDE's menus.
es: El `Lightweight X11 Desktop Environment <http://lxde.org/>`_ es una excelente opción para hardware antiguo o para usuarios que quieren un entorno de escritorio completo sin todos los extras requeridos por KDE o GNOME. Ya que cumple con las normas de XDG, el :ref:`Panel de Control`, :ref:`AppCafe®`, y :ref:`Life Preserver` de PC-BSD® están disponibles en el escritorio y están integrados en los menús de LXDE.

source: :numref:`Figure %s: LXDE Desktop on a PC-BSD® System <lxde1>` shows a screenshot of the default LXDE installation with the LXPanel open.
es: La :numref:`Figura %s: Escritorio LXDE en un sistema PC-BSD® <lxde1>` muestra una captura de pantalla de la instalación predeterminada de LXDE con el LXPanel abierto.

source: In addition to the PC-BSD® utilities, LXDE provides the following utilities:
es: En adición a las utilerías de PC-BSD®, LXDE proporciona las siguientes utilerías:

source: `LXPanel <http://wiki.lxde.org/en/LXPanel>`_: desktop panel which is launched by clicking on the PC-BSD® icon in the lower right corner of the desktop. To configure the panel, right-click the PC-BSD® icon and select "Panel Settings" or "Add/Remove Panel Items" from the right-click menu.
es: `LXPanel <http://wiki.lxde.org/en/LXPanel>`_: panel de escritorio que se lanza presionando el icono de PC-BSD® en la esquina inferior derecha del escritorio. Para configurar el panel, haga clic derecho en el icono de PC-BSD® y seleccione "Configuraciones del Panel" o "Añadir/Remover Elementos del Panel" desde el menú del botón derecho.

source: `PCManFM <http://wiki.lxde.org/en/PCManFM>`_: found in :menuselection:`System Tools --> File Manager PCManFM`. A file manager with features like drag and drop, tabbed browsing, built-in file search, file association with default application, thumbnails for images, bookmarks, and support for non-UTF-8 encoded filenames.
es: `PCManFM <http://wiki.lxde.org/en/PCManFM>`_: se encuentra en :menuselection:`Utilerías del Sistema --> Administrador de Archivos PCManFM`. Un administrador de archivos con características como drag and drop, navegación con pestañas, búsqueda de archivos nativa, asociación de archivos con aplicación predeterminada, miniaturas para imágenes, marcadores, y soporte para nombres de archivo no codificados con UTF-8.

source: `GPicView <http://wiki.lxde.org/en/GPicView>`_: fast image viewer found in :menuselection:`Accessories --> Image Viewer`.
es: `GPicView <http://wiki.lxde.org/en/GPicView>`_: veloz visor de imágenes localizado en :menuselection:`Accesorios --> Visor de Imágenes`.

source: `Leafpad <http://tarot.freeshell.org/leafpad/>`_: a light-weight graphical text editor found in :menuselection:`Accessories --> Leafpad`.
es: `Leafpad <http://tarot.freeshell.org/leafpad/>`_: un editor de textos gráfico y ligero localizado en :menuselection:`Accesorios --> Leafpad`.

source: `LXTerminal <http://wiki.lxde.org/en/LXTerminal>`_: terminal emulator found in :menuselection:`Accessories --> LXTerminal`
es: `LXTerminal <http://wiki.lxde.org/en/LXTerminal>`_: emulador de terminal localizado en :menuselection:`Accesorios --> LXTerminal`.

source: `Xarchiver <http://xarchiver.sourceforge.net/>`_: archiver utility that supports the 7z, ARJ, bzip2, gzip, lzma, RAR, RPM, DEB, tar, and ZIP file formats. Found in :menuselection:`Accessories --> Xarchiver`.
es: `Xarchiver <http://xarchiver.sourceforge.net/>`_: utilería de archivado que soporta los formatos de archivo 7z, ARJ, bzip2, gzip, lzma, RAR, RPM, DEB, tar, y ZIP. Localizado en :menuselection:`Accesorios --> Xarchiver`.

source: **epdfview**: a PDF viewer with printing support found in :menuselection:`Office --> Document Viewer`.
es: **epdfview**: un visor PDF con soporte para impresión localizado en :menuselection:`Oficina --> Visor de Documentos`.

source: `LXTask <http://wiki.lxde.org/en/LXTask>`_: task manager and system monitor found in :menuselection:`System Tools --> Task Manager`.
es: `LXTask <http://wiki.lxde.org/en/LXTask>`_: administrador de tareas y monitor del sistema localizado en :menuselection:`Utilerías del Sistema --> Administrador de Tareas`.

source: `LXAppearance <http://wiki.lxde.org/en/LXAppearance>`_: a theme switcher for customizing the widgets, colors, icons, mouse cursors, and sound effects used by applications. Found in :menuselection:`Preferences --> Customize Look and Feel`.
es: `LXAppearance <http://wiki.lxde.org/en/LXAppearance>`_: un cambiador de temas para personalizar los widgets, colores, iconos, cursores del ratón, y efectos de sonido usados por las aplicaciones. Localizado en :menuselection:`Preferencias --> Personalizar Aspecto`.

source: **LXInput:** a tool to configure your keyboard and mouse found in :menuselection:`Preferences --> Keyboard and Mouse`.
es: **LXInput:** una utilería para configurar su teclado y ratón localizada en :menuselection:`Preferencias --> Teclado y Ratón`.

source: :ref:`Openbox`: the window manager used by LXDE. You can configure settings such as themes, appearance, mouse, and margins by going to :menuselection:`Preferences --> Openbox Configuration Manager`.
es: :ref:`Openbox`: el gestor de ventanas usado por LXDE. Puede configurar preferencias tales como temas, apariencia, ratón, y márgenes yendo a :menuselection:`Preferencias --> Administrador de Configuración de Openbox`.

source: The `MATE desktop <http://mate-desktop.org/>`_ is a fork of the popular, but now unmaintained, GNOME2 desktop environment. MATE is under active development to add support for new technologies while preserving the traditional GNOME desktop experience and its many built-in utilities. :numref:`Figure %s: MATE Desktop on a PC-BSD® System <mate1>` shows a screenshot of MATE on a PC-BSD® |version| system with the "Applications" menu open.
es: El `Escritorio MATE <http://mate-desktop.org/>`_ es una bifurcación del popular, pero ahora abandonado, entorno de escritorio GNOME2. MATE está bajo desarrollo activo para añadir soporte para nuevas tecnologías mientras preserva la experiencia tradicional del escritorio GNOME y sus muchas utilerías incluidas. La :numref:`Figura %s: Escritorio MATE en un Sistema PC-BSD® <mate1>` muestra una captura de pantalla de MATE en un sistema PC-BSD® |version| con el menú de "Aplicaciones" abierto.

source: Each category in the "Applications" menu contains many applications and the :menuselection:`System --> Preferences` category contains many utilities for configuring your system. If you are new to MATE, take some time to discover which applications best suit your needs. Some of the applications which are provided by MATE include:
es: Cada categoría en el menú de "Aplicaciones" contiene muchas aplicaciones y la categoría :menuselection:`Sistema --> Preferencias` contiene muchas utilerías para configurar su sistema. Si usted es nuevo en MATE, tómese su tiempo para descubrir cuáles aplicaciones se ajustan mejor a sus necesidades. Algunas de las aplicaciones que se proporcionan con MATE incluyen:

source: **Engrampa:** archive manager found in :menuselection:`Accessories --> Engrampa Archive Manager`.
es: **Engrampa:** administrador de archivos localizado en :menuselection:`Accesorios --> Administrador de Archivos Engrampa`.

source: **Pluma:** text editor found in :menuselection:`Accessories --> pluma Text Editor`.
es: **Pluma:** editor de textos localizado en :menuselection:`Accesorios --> Editor de Textos pluma`.

source: **Atril:** PDF document viewer found in :menuselection:`Office --> Atril Document Viewer`.
es: **Atril:** Visor de documentos PDF localizado en :menuselection:`Oficina --> Visor de Documentos Atril`.

source: **Caja:** file manager found in :menuselection:`System Tools --> Caja`. It is a fork of Nautilus.
es: **Caja:** Administrador de archivos localizado en :menuselection:`Utilerías del Sistema --> Caja`. Es un fork de Nautilus.

source: This `minimalist window manager <http://openbox.org/wiki/Main_Page>`_ is highly configurable. It is the window manager used by LXDE but can also be run separately from LXDE.
es: Este `gestor de ventanas minimalista <http://openbox.org/wiki/Main_Page>`_ es altamente configurable. Es el gestor de ventanas usado por LXDE pero también puede correr separado de LXDE.

source: :numref:`Figure %s: Openbox on a PC-BSD® System <openbox1>` provides a screenshot of Openbox running on a PC-BSD® system. The application menu was launched by right-clicking on an area of the desktop.
es: La :numref:`Figura %s: Openbox en un Sistema PC-BSD® <openbox1>` proporciona una captura de pantalla de Openbox corriendo en un sistema PC-BSD®. El menú de aplicaciones se lanzó haciendo clic derecho en un área del escritorio.

source: The application menu contains an entry for the Openbox Configuration Manager which can be used to customize settings such as themes, appearance, mouse, and margins. A screenshot of this configuration utility is shown in :numref:`Figure %s: Openbox Configuration Manager <openbox2>`.
es: El menú de aplicaciones contiene una entrada para el Administrador de Configuración de Openbox, el cuál puede ser usado para personalizar configuraciones como temas, apariencia, ratón, y márgenes. Una captura de pantalla de esta utilería de configuración se muestra en la :numref:`Figura %s: Administrador de Configuración de Openbox <openbox2>`.

source: A list of websites containing additional themes is available from the `Openbox wiki <http://openbox.org/wiki/Openbox:Themes>`_.
es: Una lista de sitios web que contienen temas adicionales está disponible desde el `Wiki de Openbox <http://openbox.org/wiki/Openbox:Themes>`_.

source: The `simple Ratpoison window manager <http://www.nongnu.org/ratpoison/>`_ has no fat library dependencies, fancy graphics, nor window decorations.
es: El `simple gestor de ventanas Ratpoison <http://www.nongnu.org/ratpoison/>`_ no tienen dependencias pesadas de librerías, gráficos llamativos, ni decoraciones en las ventanas.

source: :numref:`Figure %s: Ratpoison on a PC-BSD® System <ratpoison1>` provides a screenshot of Ratpoison running on a PC-BSD® system:
es: La :numref:`Figura %s: Ratpoison en un Sistema PC-BSD® <ratpoison1>` proporciona una captura de pantalla de Ratpoison corriendo en un sistema PC-BSD®:

source: Ratpoison uses keyboard shortcuts. To view the shortcuts, press :kbd:`Ctrl-t` then :kbd:`?`. To leave this help screen, press :kbd:`Enter`.
es: Ratpoison usa atajos de teclado. Para ver los atajos, presione :kbd:`Ctrl-t` y después :kbd:`?`. Para dejar esta pantalla de ayuda, presione :kbd:`Intro`.

source: To open an xterm, press :kbd:`Ctrl-t` then :kbd:`c`. Type :command:`exit` to close the xterm. Type :command:`killall ratpoison` within an xterm to leave Ratpoison and return to the login screen.
es: Para abrir una xterm, presione :kbd:`Ctrl-t` y después :kbd:`c`. Ingrese :command:`exit` para cerrar la xterm. Ingrese :command:`killall ratpoison` detro de una xterm para dejar Ratpoison y regresar a la pantalla de acceso.

source: The `Ratpoison wiki <https://wiki.archlinux.org/index.php/Ratpoison>`_ contains an FAQ and tips for setting keyboard shortcuts.
es: El `Wiki de Ratpoison <https://wiki.archlinux.org/index.php/Ratpoison>`_ contiene Preguntas Frecuentes y tips para configurar los atajos de teclado.

source: The `spectrwm minimalist window manager <https://github.com/conformal/spectrwm/wiki>`_, formerly known as scrotwm, is written by OpenBSD hackers. It provides keyboard shortcuts, a configuration file, and assumes that the user prefers to use the command line. If you have not used spectrwm before, spend some time reading through its `man page <https://opensource.conformal.com/cgi-bin/man-cgi?spectrwm>`_ first.
es: El `gestor de ventanas minimalista spectrwm <https://github.com/conformal/spectrwm/wiki>`_, anteriormente conocido como scrotwm, es programado por hackers de OpenBSD. Proporciona atajos de teclado, un archivo de configuraciones, y asume que el usuario prefiere usar la línea de comandos. Si no ha usado spectrwm anteriormente, tómese su tiempo para leer a través de su `página del manual <https://opensource.conformal.com/cgi-bin/man-cgi?spectrwm>`_ primero.

source: To launch applications within spectrwm, start an xterm by pressing :kbd:`Alt+Shift+Enter`. Once you have an xterm, you can start any program you wish. For example, to start :ref:`Control Panel` type :command:`pc-controlpanel`. spectrwm does not provide minimize, maximize, or close buttons within its windows. To close a GUI application, use :kbd:`CTRL-c` within the xterm you used to launch the application. To leave this desktop, type :command:`killall spectrwm` from an xterm.
es: Para lanzar aplicaciones desde spectrwm, inicie una xterm presionando :kbd:`Alt+Shift+Intro`. Una vez que tenga una xterm, puede iniciar cualquier programa que guste. Por ejemplo, para iniciar el :ref:`Panel de Control` ingrese :command:`pc-controlpanel`. spectrwm no proporciona dentro de sus ventanas los botones de minimizar, maximizar o cerrar. Para cerrar una aplicación gráfica, use :kbd:`CTRL-c` dentro de la xterm que usó para lanzar la aplicación. Para dejar este escritorio, ingrese :command:`killall spectrwm` desde una xterm.

source: The `WindowLab window manager <http://nickgravgaard.com/windowlab/>`_ is small and simple. It uses a window resizing mechanism that allows one or many edges of a window to be changed in one action, and an innovative menubar that shares the same part of the screen as the taskbar. It follows a click-to-focus but not raise-on-focus policy. This means that when a window is clicked it gets focus, but it is not redrawn to obscure other windows. This allows one, for example, to switch to a terminal to enter commands while keeping documentation visible in a web browser.
es: El `gestor de ventanas WindowLab <http://nickgravgaard.com/windowlab/>`_ es pequeño y simple. Usa un mecanismo de redimensionado de ventana que permite que una o varias esquinas de una ventana sean cambiadas en una sola acción, y una barra de menú innovadora que comparte la misma parte de la pantalla que la barra de tareas. Sigue una política de clic para el foco pero no de venir al frente al obtener el foco. Esto significa que cuando se hace clic en una ventana obtiene el foco, pero no se redibuja para oscurecer otras ventanas. Esto le permite, por ejemplo, cambiar a una terminal para ingresar comandos mientras se tiene la documentación visible en un navegador.

source: Use the right mouse button to display the top menu panel. Use the left mouse button or hover over a taskbar entry to open that application.
es: Use el botón derecho del ratón para desplegar el panel del menú superior. Use el botón izquierdo del ratón o páselo por encima de una entrada de la barra de tareas para abrir esa aplicación.

source: To add the applications you use most often to the menubar, select "Edit menu" while holding the right mouse button.
es: Para añadir las aplicaciones que usted usa más a la barra de menú, seleccione "Editar menú" mientras mantiene presionado el botón derecho del ratón.

source: To leave the WindowLab session, select "Quit" from the menubar.
es: Para dejar la sesión de WindowLab, seleccione "Salir" de la barra de menú.

source: The `Window Maker window manager <https://windowmaker.org/>`_ is light-weight and designed to reproduce the look and feel of the :wikipedia:`NEXTSTEP` user interface.
es: El `gestor de ventanas Window Maker <https://windowmaker.org/>`_ es liviano y diseñado para reproducir el aspecto de la interfaz de usuario de :wikipedia:`NEXTSTEP`.

source: :numref:`Figure %s: Window Maker on PC-BSD® <windowmaker1>` shows a screenshot of Window Maker running on PC-BSD®. In this example, the user launched the "Application" menu by right-clicking an area of the desktop.
es: La :numref:`Figura %s: Window Maker en PC-BSD® <windowmaker1>` muestra una captura de pantalla de Window Maker corriendo en PC-BSD®. En este ejemplo, el usuario lanzó el menú de "Aplicación" haciendo clic derecho en un área del escritorio.

source: In addition to the PC-BSD® utilities, Window Maker provides the following applications:
es: Además de las utilerías de PC-BSD®, Window Maker proporciona las siguientes aplicaciones:

source: **WPrefs**: located in :menuselection:`Appearance --> Preferences Utility`. Allows you to configure window focus, window placement, menu alignment, icons, keyboard actions, mouse, fonts, and various other window manager settings.
es: **WPrefs**: localizado en:`Apariencia --> Utilería de Preferencias`. Le permite configurar el foco de la ventana, posicionado de la ventana, alineamiento de menú, iconos, acciones de teclado, ratón, fuentes, y otras varias configuraciones del gestor de ventanas.
