Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/desktops.po
Languages: es

source: `wmakerconf <http://wmakerconf.sourceforge.net/>`_: found in :menuselection:`Utils --> wmakerconf`. Allows you to fine-tune your menu entries as well as your desktop's appearance, themes, background, mouse, and special effects. :numref:`Figure %s: Editing the Application Menu Using wmakerconf <windowmaker2>` shows wmakerconf with the "Menu" button selected.
es: `wmakerconf <http://wmakerconf.sourceforge.net/>`_: que se encuentra en :menuselection:`Utils --> wmakerconf`. Le permite afinar sus entradas del menú así como la apariencia, temas, tapiz, ratón y efectos especiales del escritorio. La :numref:`Figura %s: Editando el Menú de Aplicación Usando wmakerconf <windowmaker2>` muestra wmakerconf con el botón "Menu" seleccionado.

source: Working with the Dock
es: Trabajando con el Dock

source: Window Maker uses a dock to store application shortcuts. The dock appears as a series of icons in the upper right corner of the desktop. Docked applications always show on the desktop, even after you close an application or close and restart your Window Maker session.
es: Window Maker usa un dock para guardar los accesos directos de las aplicaciones. El dock aparece como una serie de iconos en la esquina superior derecha del escritorio. Las aplicaciones en el dock aparecen siempre en el escritorio, aún después de cerrar la aplicación o cerrar y reiniciar su sesión de Window Maker.

source: Whenever you start an application, an icon will appear in the lower left corner of the screen. You can move that icon elsewhere on the desktop with your mouse. If you right-click the icon, you have the option to hide/unhide the icon, set icon (change its picture), or kill the application. If you drag the icon onto the dock, it will remain on the desktop.
es: Cada que inicie una aplicación, un icono aparecerá en la esquina inferior izquierda de la pantalla. Puede mover ese icono a cualquier lado en el escritorio con su ratón. Si hace clic derecho en el icono, tiene la opción de esconder/mostrar el icono, poner el icono (cambiar su imágen), o matar la aplicación. Si arrastra el icono en el dock, se conservará en el escritorio.

source: Once an icon is docked, a settings menu is added to the icon's right-click menu. :numref:`Figure %s: Configuring an Icon <windowmaker3>` demonstrates how to configure an icon for :ref:`AppCafe®`.
es: Una vez que un icono está en el dock, un menú de configuraciones se añade al menú de clic derecho del icono. La :numref:`Figura %s: Configurando un Icono <windowmaker3>` demuestra cómo configurar un icono para :ref:`AppCafe®`.

source: You will find the icons for :ref:`AppCafe®` and :ref:`Control Panel` in :file:`/usr/local/share/pcbsd/pc-controlpanel/icons`. Choose the 64x64 versions as this is the size that Window Maker users. The application name for :ref:`AppCafe®` is :command:`appcafe` and for :ref:`Control Panel` it is :command:`pc-controlpanel`.
es: Usted encontrará los iconos para :ref:`AppCafe®` y :ref:`Panel de Control` en :file:`/usr/local/share/pcbsd/pc-controlpanel/icons`. Elija las versiones de 64x64 ya que este es el tamaño que usa Window Maker. El nombre de la aplicación para :ref:`AppCafe®` es :command:`appcafe` y para :ref:`Pane de Control` es :command:`pc-controlpanel`.

source: Window Maker supports dockapps which are applications that were designed to work with Window Maker but which are separate from the Window Maker project. Dockapps tend to be small and designed to perform a particular function. For example, there are clocks, weather applications, and CPU monitors. Most dockapps have been ported to FreeBSD and the port name always begins with "wm". You can search for these at `freshports.org <http://www.freshports.org/>`_ by entering a "Short Description" containing "dockapp".
es: Window Maker soporta dockapps que son aplicaciones que fueron diseñadas para trabajar con Window Maker pero que están separadas de el proyecto Window Maker. Dockapps tienden a ser pequeñas y diseñadas para realizar una función particular. Por ejemplo, hay relojes, aplicaciones de clima, y monitores de CPU. La mayoría de las dockapps han sido portadas a FreeBSD y el nombre del port siempre comienza con "wm". Puede encontrarlos en `freshports.org <http://www.freshports.org/>`_ ingresando una "Pequeña Descripción" que contenga "dockapp".

source: If your favorite dockapp has not been ported to FreeBSD, you can request that a port be created on the Ports Requests forum using these `instructions <https://forums.pcbsd.org/thread-12336.html>`_.
es: Si su dockapp favorita no ha sido portada a FreeBSD, puede pedir que sea creado el por en el foro de Requerimientos de Ports usando estas `instrucciones <https://forums.pcbsd.org/thread-12336.html>`_.

source: `XFCE <http://www.xfce.org/>`_ is a lightweight desktop environment that aims to be low on system resources and fast, while still being visually appealing and user friendly. More information about XFCE, including usage tips, can be found at the `XFCE FAQ <http://wiki.xfce.org/faq>`_.
es: `XFCE <http://www.xfce.org/>`_ es un entorno de escritorio ligero que intenta usar pocos recursos del sistema y rápido, y ser atractivo a la vista y amigable con el usuario. Más información sobre XFCE, incluyendo tips para su uso, puesden encontrarse en las `FAQ de XFCE <http://wiki.xfce.org/faq>`_.

source: The first time you start XFCE4, you will see the message shown in :numref:`Figure %s: Panel Welcome Message <xfce1>`.
es: La primera vez que inicie XFCE4, verá el mensaje mostrado en la :numref:`Figura %s: Mensaje del Panel de Bienvenida <xfce1>`.

source: In XFCE, a `panel <http://docs.xfce.org/xfce/xfce4-panel/start>`_ is a bar which can hold many items such as application launchers, window lists, a clock, a notification area, and application menus. Your initial panel setup options are:
es: En XFCE, un `panel <http://docs.xfce.org/xfce/xfce4-panel/start>`_ es una barra que puede contener muchos elementos como lanzadores de aplicaciones, listas de ventanas, un reloj, un área de notificación, y menús de aplicación. Sus opciones iniciales de configuración del panel son:

source: **Migrate old config:** select this option if you wish to have a single panel with an application launcher and other icons as shown in :numref:`Figure %s: XFCE with Complete Panel Migrated From Old Config <xfce2>`. The application launcher menu may be accessed by the fireball icon in the lower left, or by right-clicking the desktop.
es: **Migrar configuración anterior:** selecciones esta opción si quiere tener un solo panel con un lanzador de aplicaciones y otros iconos como se muestra en la :numref:`Figura %s: XFCE con un Panel Completo Migrado Desde una Configuración Anterior <xfce2>`. El menú del lanzador de aplicaciones puede accesarse mediant el icono de bola de fuego en la parte inferior izquierda, o presionando botón derecho en el escritorio.

source: **Use default config:** this option will install a small, minimal panel centered on the bottom, as seen in :numref:`Figure %s: XFCE with Minimal Panel Using Default Config <xfce3>`. The application launcher menu may be accessed by the fireball icon in the top bar, or by a right-click on the desktop.
es: **Usar configuración predeterminada:** esta opción instalará un pequeño y mínimo panel centrado en la parte baja, como se muestra en la :numref:`Figura %s: XFCE con un Panel Mínimo Usando la Configuración Predeterminada <xfce3>`. El menú del lanzador de aplicaciones puede ser accesado mediante el icono de bola de fuego en la barra superior, o haciendo clic derecho en el escritorio.

source: **One empty panel:** this option will install a panel with no icons. The application menu is available by right-clicking the desktop.
es: **Un panel vacío:** esta opción instalará un panel sin iconos. El menú de aplicaciones está disponible haciendo clic derecho en el escritorio.

source: If you wish to change your configuration choice at a later time, reset the panel using :menuselection:`Applications --> Settings --> Settings Editor`, shown in :numref:`Figure %s: Using Settings Editor to Reset Panel <xfce4a>`. Right-click the entry for "xfce4-panel" and click "Reset Channel".
es: Si quiere cambiar sus opciones de configuración en el futuro, reinicie el panel usando menuselection:`Aplicaciones --> Configuraciones --> Editor de Configuraciones`, mostrado en la :numref:`Figura %s: Usando el Editor de Configuraciones para Reiniciar el Panel <xfce4a>`. Haga clic derecho en la entrada para "xfce4-panel" y presione en "Reiniciar Canal".

source: In addition to the PC-BSD® utilities, XFCE provides the following utilities:
es: En adición a las utilerías de PC-BSD®, XFCE proporciona las siguientes utilerías:

source: `Xfdesktop <http://docs.xfce.org/xfce/xfdesktop/start>`_: desktop manager found in :menuselection:`Settings --> Desktop`. Sets the background image, provides a right-click menu to launch applications, and can show files (including application launchers) or iconified windows.
es: `Xfdesktop <http://docs.xfce.org/xfce/xfdesktop/start>`_: administrador de escritorio localizado en :menuselection:`Configuraciones --> Escritorio`. Pone la imágen de tapíz, proporciona un menú de clic derecho para lanzar aplicaciones, y puede mostrar archivos (incluyendo lanzadores de aplicación) o ventanas iconificadas.

source: `Xfwm4 <http://docs.xfce.org/xfce/xfwm4/start>`_: window manager found in :menuselection:`Settings --> Window Manager`. It provides window decorations, virtual desktops, multiscreen mode, transparency and a keyboard shortcuts editor.
es: `Xfwm4 <http://docs.xfce.org/xfce/xfwm4/start>`_: gestor de ventanas localizado en :menuselection:`Configuraciones --> Gestor de Ventanas`. Proporciona decoraciones para ventanas, escritorios virtuales, modo multipantalla, transparencias y editor de atajos de teclado.

source: `Ristretto <http://goodies.xfce.org/projects/applications/ristretto>`_: fast and light-weight picture viewer found in :menuselection:`Graphics --> Ristretto Image Viewer`.
es: `Ristretto <http://goodies.xfce.org/projects/applications/ristretto>`_: visor de imágenes veloz y ligero localizado en :menuselection:`Gráficos --> Visor de Imágenes Ristretto`.

source: `Midori <http://www.twotoasts.de/index.php/midori/>`_: light-weight graphical browser found in :menuselection:`Internet --> Midori`.
es: `Midori <http://www.twotoasts.de/index.php/midori/>`_: navegador gráfico ligero localizado en :menuselection:`Internet --> Midori`.

source: `Xfburn <http://goodies.xfce.org/projects/applications/xfburn>`_: CD/DVD burning tool found in :menuselection:`Multimedia --> Xfburn`.
es: `Xfburn <http://goodies.xfce.org/projects/applications/xfburn>`_: Herramienta para grabación de CD/DVD localizada en :menuselection:`Multimedia --> Xfburn`.

source: `Orage <http://www.kolumbus.fi/~w408237/orage/>`_: calendar and reminder daemon found in :menuselection:`Office --> Orage Calendar`.
es: `Orage <http://www.kolumbus.fi/~w408237/orage/>`_: calendario y demonio de recordatorios localizado en :menuselection:`Oficina --> Calendario Orage`.

source: `Thunar <http://docs.xfce.org/xfce/thunar/start>`_: file manager found in :menuselection:`System --> Thunar File Manager`.
es: `Thunar <http://docs.xfce.org/xfce/thunar/start>`_: administrador de archivos localizado en :menuselection:`Sistema --> Administrador de Archivos Thunar`.

source: A list of recommended applications for XFCE can be found on the `XFCE wiki <http://wiki.xfce.org/recommendedapps>`_.
es: Una lista de aplicaciones recomendadas para XFCE puede encontrarse en el `Wiki de XFCE <http://wiki.xfce.org/recommendedapps>`_.

source: XFCE Plugins
es: Plugins de XFCE

source: XFCE supports many plugins which provide additional applications that are separate from the official XFCE distribution. You can browse for plugins and read descriptions for each at the XFCE `goodies website <http://goodies.xfce.org/projects/start>`_.
es: XFCE soporta muchos plugins que proporcionan aplicaciones adicionales que están separadas de la distribución oficial de XFCE. Puede examinar plugins y leer sus descripciones en el `sitio de goodies de XFCE <http://goodies.xfce.org/projects/start>`_.

source: After installing a plugin, go to :menuselection:`Settings --> Panel --> Items` and click the "+" button in the right column to see the "Add New Items" screen shown in :numref:`Figure %s: Adding a Plugin to the Panel <xfce5>`.
es: Después de instalar un plugin, vaya a :menuselection:`Configuraciones --> Panel --> Elementos` y presione el botón "+" en la columna de la derecha para ver la pantalla "Añadir Nuevos Elementos" mostrada en la :numref:`Figura %s: Añadiendo un Plugin al Panel <xfce5>`.

source: Select your new plugin from the list, and click the "+Add" button. It will immediately be added as an icon in the panel.
es: Seleccione su nuevo plugin de la lista, y presione el botón "+Añadir". Se añadirá inmediatamente como un icono en el panel.
