Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/desktops.po
Languages: es

source: Desktops
es: Escritorios

source: Once you have installed PC-BSD®, you will want to become familiar with your desktop environment. This chapter provides an overview of the desktops which can be selected during the installation of PC-BSD® or installed afterwards using :ref:`AppCafe®`. Desktops, when installed, will appear in the list of available desktops when a user logs in.
es: Una vez que ha instalado PC-BSD®, usted querrá sentirse familiarizado con su entorno de escritorio. Este capítulo provee un vistazo a los escritorios que pueden seleccionarse durante la instalación de PC-BSD® o instalados usando :ref:`AppCafe®`. Los escritorios, una vez instalados, aparecerán en la lista de escritorios disponibles cuando un usuario acceda al sistema.

source: Fluxbox is always installed and available in the login menu of a PC-BSD® system.
es: Fluxbox siempre se instala y está disponible en el menú de acceso del sistema PC-BSD®.

source: For the desktops that support desktop icons, three PC-BSD® icons will appear on the desktop:
es: Para los escritorios que soportan iconos de escritorio, tres iconos de PC-BSD® aparecerán en el escritorio:

source: **AppCafe®:** graphical utility used to install, uninstall, and upgrade software. See the section on :ref:`AppCafe®` for more details.
es: **AppCafe®:** utilería gráfica usada para instalar, desinstalar, y actualizar software. Vea la sección sobre :ref:`AppCafe®` para más detalles.

source: **PC-BSD® Control Panel:** contains applications for administering the computer. See the section on :ref:`Control Panel` for more details.
es: **Panel de Control de PC-BSD®:** contiene aplicaciones para administrar la computadora. Vea la sección sobre :ref:`Panel de Control` para más detalles.

source: **PC-BSD® Handbook:** the HTML version of the PC-BSD® |version| Users Handbook (this document).
es: **El Manual de PC-BSD®:** la versión HTML de la Guía del Usuario de PC-BSD® |version| (este documento).

source: Even more desktops are available for installation from :ref:`AppCafe®`. These can be browsed in the "X11 - Window Managers" category. Note that if the desktop is not described in this chapter, it will not automatically be added to the login menu.
es: Existen aún más escritorios para instalar desde :ref:`AppCafe®`. Los mismos pueden examinarse en la categoría "X11 - Gestores de Ventanas". Note que si el escritorio no está descrito en este capítulo, no se añadirá automáticamente al menú de inicio de sesión.

source: The `awesome window manager <https://awesomewm.org/>`_ is highly configurable and primarily targeted at power users who prefer to use the command line within their graphical environment.
es: El `gestor de ventanas awesome <https://awesomewm.org/>`_ es altamente configurable y principalmente orientrado a usuarios experimentados que prefieren usar la línea de comandos dentro de su entorno gráfico.

source: :numref:`Figure %s: Awesome Window Manager on PC-BSD® <awesome1>` shows a screenshot of Awesome running on PC-BSD® |version|. The user has right-clicked the desktop in order to launch the awesome application manager.
es: La :numref:`Figura %s: Gestor de Ventanas Awesome en PC-BSD® <awesome1>` muestra una captura de pantalla de Awesome corriendo en PC-BSD® |version|. El usuario ha hecho clic derecho en el escritorio para lanzar el gestor de aplicaciones de awesome.

source: If you click :menuselection:`awesome --> manual`, the man page for awesome will open in a terminal. If you click :menuselection:`awesome --> edit config`, the awesome configuration file will open in the :command:`nano` text editor. The numbers in the upper left corner represent virtual desktops. For example, you can have different terminals open in each virtual desktop.
es: Si presiona :menuselection:`awesome --> manual`, la página del manual para awesome se abrirá en una terminal. Si presiona :menuselection:`awesome --> edit config`, el archivo de configuración de awesome se abrirá en el editor de texto :command:`nano`. Los números en la esquina superior izquierda representan los escritorios virtuales. Por ejemplo, puede tener diferentes terminales abiertas en cada escritorio virtual.

source: If you wish to access :ref:`Control Panel`, open a terminal and type :command:`pc-controlpanel`. To launch :ref:`AppCafe®`, type :command:`appcafe` in a terminal. To exit this desktop and return to the login screen, use :menuselection:`awesome --> quit`.
es: Si desea acceder al :ref:`Panel de Control`, abra una terminal e introduzca :command:`pc-controlpanel`. Para lanzar :ref:`AppCafe®`, introduzca :command:`appcafe` en una terminal. Para salir de este escritorio y volver a la pantalla de acceso use :menuselection:`awesome --> quit`.

source: Cinnamon requires 3D acceleration. If your video driver does not support this, you should not install Cinnamon.
es: Cinnamon requiere accelaración 3D. Si su controlador de video no soporta esto, no debería instalar Cinnamon.

source: The `Cinnamon desktop environment <http://cinnamon.linuxmint.com/>`_ is developed by the Linux Mint project. :numref:`Figure %s: Cinnamon Desktop on a PC-BSD® System <cinnamon1>` shows a screenshot of Cinnamon on a PC-BSD® |version| system with the applications "Menu" open.
es: El `Entorno de escritorio Cinnamon <http://cinnamon.linuxmint.com/>`_ es desarrollado por el proyecto Linux Mint. La :numref:`Figura %s: Escritorio Cinnamon en un Sistema PC-BSD® <cinnamon1>` muestra una captura de pantalla de Cinnamon en un sistema PC-BSD® |version| con el "Menú" de aplicaciones abierto.

source: Hover over a category in the menu to see its available applications. Alternately, use the search bar to find a specific application.
es: Pase por encima de una categoría en el menú para ver sus aplicaciones disponibles. Alternativamente, use la barra de búsqueda para encontrar una aplicación específica.

source: Click the wrench icon in the upper left corner to access the "Cinnamon Settings" menu, where you can configure backgrounds, desktop effects, themes, applets, desklets, extensions, menu items, the screensaver, and so on. Additional themes, applets, desklets, and extensions can be downloaded from the `Cinnamon website <http://cinnamon.linuxmint.com/>`_.
es: Presione en el icono de la llave en la esquina superior izquierda para accesar el menú "Configuraciones de Cinnamon", donde puede configurar los fondos, efectos de escritorio, temas, applets, desklets, extensiones, elementos del menú, el protector de pantalla, y más. Temas, applets, desklets, y extensiones adicionales pueden descargarse desde el `Sitio de Cinnamon <http://cinnamon.linuxmint.com/>`_.

source: The `Fluxbox window manager <http://fluxbox.org/>`_ is light-weight and fast. Regardless of the window managers that you have selected to install, Fluxbox is always available as an option in the login menu.
es: El `entorno de escritorio Fluxbox <http://fluxbox.org/>`_ es ligero y rápido. Independientemente de los entornos de escritorio que haya seleccionado instalar, Fluxbox siempre estará disponible como una opción en el menú de acceso.

source: :numref:`Figure %s: Fluxbox on PC-BSD® <fluxbox1>` shows a screenshot of Fluxbox running on PC-BSD®. In this example, the user has launched the "Application" menu by right-clicking on the desktop.
es: La :numref:`Figura %s: Fluxbox en PC-BSD® <fluxbox1>` muestra una captura de pantalla de Fluxbox corriendo en PC-BSD®. En este ejemplo, el usuario ha lanzado el menú de "Aplicaciones" haciendo clic derecho en el escritorio.

source: Fluxbox provides many configuration files which can be edited in order to customize the desktop. The `Features <http://www.fluxbox.org/features/>`_ page of the Fluxbox website lists the available configuration files and links to instructions for getting the most out of Fluxbox.
es: Fluxbox proporciona muchos archivos de configuración que pueden ser editados para personalizar el escritorio. La página de `Características <http://www.fluxbox.org/features/>`_ del sitio web de Fluxbox lista los archivos de configuración disponibles y vínculos a instrucciones para sacar el máximo provecho de Fluxbox.

source: The following resources are useful when customizing Fluxbox:
es: Los siguientes recursos son útiles para personalizar Fluxbox:

source: `Creating the Perfect Fluxbox Desktop on Linux <https://www.linux.com/learn/tutorials/467792-creating-the-perfect-fluxbox-desktop-on-linux>`_
es: `Creando el Escritorio Fluxbox Perfecto en Linux <https://www.linux.com/learn/tutorials/467792-creating-the-perfect-fluxbox-desktop-on-linux>`_

source: `Fluxconf How-To at Tux Magazine <http://www.tuxmagazine.com/node/1000191>`_
es: `Fluxconf How-To de Tux Magazine <http://www.tuxmagazine.com/node/1000191>`_

source: `Fluxbox wiki <http://fluxbox-wiki.org/>`_
es: `Wiki de Fluxbox <http://fluxbox-wiki.org/>`_

source: `Fluxbox FAQ <http://fluxbox-wiki.org/FAQ_en.html>`_
es: `FAQ de Fluxbox <http://fluxbox-wiki.org/FAQ_en.html>`_

source: The `FVWM window manager <http://fvwm.org/>`_ is powerful and highly configurable. It supports any number of virtual desktops, each divided into multiple pages. It also supports side title bars, including vertical text.
es: El `entorno de escritorio FVWM <http://fvwm.org/>`_ es poderoso y altamente configurable. Soporta cualquier número de escritorios virtuales, cada uno dividido en múltiples páginas. También soporta barras de título laterales, incluyendo texto vertical.

source: When you install FVWM on PC-BSD®, it also installs `FVWM-Crystal <http://gna.org/projects/fvwm-crystal/>`_. Both window managers will be added to the login menu.
es: Cuando instala FVWM en PC-BSD®, también instala `FVWM-Crystal <http://gna.org/projects/fvwm-crystal/>`_. Los dos entornos de escritorio se añadirán al menú de acceso.

source: :numref:`Figure %s: FVWM Running on PC-BSD® <fvwm1>` shows the default PC-BSD® desktop if you select FVWM from the login menu. The application menu was opened by clicking the mouse anywhere on the desktop.
es: La :numref:`Figura %s: FVWM Corriendo en PC-BSD® <fvwm1>` muestra el escritorio PC-BSD® predeterminado si selecciona FVWM desde el menú de acceso. El menú de aplicaciones se abrió presionando con el ratón en cualquier parte del escritorio.

source: :numref:`Figure %s: FVWM-Crystal Running on PC-BSD® <fvwm2>` shows the default PC-BSD® desktop if you select FVWM-Crystal from the login menu. To open an xterm in FVWM-Crystal, right-click any area of the desktop.
es: La :numref:`Figura %s: FVWM-Crystal Corriendo en PC-BSD® <fvwm2>` muestra el escritorio PC-BSD® predeterminado si selecciona FVWM-Crystal desde el menú de acceso. Para abrir una xterm en FVWM-Crystal, haga clic derecho en cualquier parte del escritorio.

source: The `FVWM Documentation <http://fvwm.org/doc/unstable/index.html>`_ provides information about configuring FVWM.
es: La `Documentación de FVWM <http://fvwm.org/doc/unstable/index.html>`_ proporciona información acerca de la configuración de FVWM.

source: When you install GNOME on PC-BSD®, it installs both GNOME2 and GNOME3. GNOME2 will appear in the login menu as "GNOME Classic" and GNOME3 will be listed in the login menu as "GNOME".
es: Cuando usted instala GNOME en PC-BSD®, instala GNOME2 y GNOME3. GNOME2 aparecerá en el menú de acceso como "GNOME Classic" y GNOME3 se listará en el menú de acceso como "GNOME".

source: GNOME3 requires 3D acceleration. If your video driver does not support this, you should use GNOME2 instead.
es: GNOME3 requiere aceleración 3D. Si su controlador de video no soporta esto, debería usar GNOME2 en su lugar.

source: `GNOME3 <https://www.gnome.org/>`_ is a popular desktop environment that provides many built-in utilities. :numref:`Figure %s: GNOME3 Desktop on a PC-BSD® System <gnome1>` shows a screenshot of GNOME3 on a PC-BSD® |version| system. To access the icons shown in this screen, click "Activities" then the 9-dot icon at the bottom of the left-hand panel. Alternately, if you know the name of an application to open, click "Activities" and type the application's name into the search bar.
es: `GNOME3 <https://www.gnome.org/>`_ es un entorno de escritorio popular que proporciona muchas utilerías incluidas. La :numref:`Figura %s: Escritorio GNOME3 en un Sistema PC-BSD® <gnome1>` muestra una captura de pantalla de GNOME3 en un sistema PC-BSD® |version|. Para accesar los iconos mostrados en la pantalla, presione en "Actividades" y luego en el icono de 9 puntos en la parte baja del panel izquierdo. Alternativamente, si sabe el nombre de la aplicación a ejecutar, presione en "Actividades" e ingrese el nombre de la aplicación en la barra de búsqueda.

source: :numref:`Figure %s: GNOME2 Desktop on a PC-BSD® System <gnome2>` shows a screenshot of GNOME2 on a PC-BSD® |version| system with the "Applications" menu open.
es: La :numref:`Figura %s: Escritorio GNOME2 en un Sistema PC-BSD® <gnome2>` muestra una captura de pantalla de GNOME2 en un sistema PC-BSD® |version| con el menú "Aplicaciones" abierto.

source: If you are new to GNOME, take some time to discover which applications best suit your needs. Some of the applications which are provided by GNOME include:
es: Si es nuevo en GNOME, tome su tiempo para descubrir que aplicaciones cubren mejor sus necesidades. Algunas de las aplicaciones proporcionadas por GNOME incluyen:

source: `Image Viewer <https://wiki.gnome.org/Apps/EyeOfGnome>`_: Eye of GNOME image viewer.
es: `Visor de Imágenes <https://wiki.gnome.org/Apps/EyeOfGnome>`_: Visor de imágenes Eye of GNOME.

source: `Web <https://wiki.gnome.org/Apps/Web>`_: web browser.
es: `Web <https://wiki.gnome.org/Apps/Web>`_: Navegador.

source: `Brasero <https://wiki.gnome.org/Apps/Brasero>`_: CD/DVD burning software.
es: `Brasero <https://wiki.gnome.org/Apps/Brasero>`_: Software de grabación de CD/DVD.

source: `Videos <https://wiki.gnome.org/Apps/Videos>`_: movie player.
es: `Videos <https://wiki.gnome.org/Apps/Videos>`_: Reproductor de Vídeo.

source: `Evolution <https://wiki.gnome.org/Apps/Evolution>`_: email client with address book and calendar.
es: `Evolution <https://wiki.gnome.org/Apps/Evolution>`_: Cliente de correo con libreta de direcciones y calendario.

source: `Files: <https://wiki.gnome.org/action/show/Apps/Nautilus?action=show&redirect=Nautilus>`_ Nautilus file manager.
es: `Archivos: <https://wiki.gnome.org/action/show/Apps/Nautilus?action=show&redirect=Nautilus>`_ Administrador de Archivos Nautilus.

source: some games, such as Lights Off, Quadrapassel, and Swell Foop, require 3D acceleration. If your video driver does not support this, you will not be able to launch those games.
es: Algunos juegos, tales como Lights Off, Quadrapassel, y Swell Foop, requieren aceleración 3D. Si su controlador de video no soporta esto, no le será posible correr esos juegos.

source: You can find additional themes and wallpapers at `gnome-look.org <http://gnome-look.org/>`_.
es: Puede encontrar temas adicionales y fondos de escritorio en `gnome-look.org <http://gnome-look.org/>`_.

source: The `i3 tiling window manager <http://i3wm.org/>`_ is extremely lightweight and designed for users who prefer to work from the command line. Keyboard shortcuts are provided to open xterms in order to start applications from the command line.
es: El `Gestor de Ventanas i3 <http://i3wm.org/>`_ es extremadamente ligero y diseñado para usuarios que prefieren trabajar desde la línea de comandos. Los accesos directos del teclado se proporcionan para abrir xterms y poder ejecutar aplicaciones desde la línea de comandos.

source: :numref:`Figure %s: i3 Window Manager on PC-BSD® <i3a>` shows a screenshot of i3 running on PC-BSD® |version|.
es: La :numref:`Figura %s: Gestor de Ventanas i3 en PC-BSD® <i3a>` muestra una captura de pantalla de i3 corriendo en PC-BSD® |version|.

source: If you used :ref:`AppCafe®` to install i3, it automatically installed a default, system-wide configuration that is usually generated by :command:`i3-config-wizard`. If you would like to use :kbd:`Win` as a modifier key and the Dvorak layout, run :command:`pc-extractoverlay i3dvorak`. If you instead installed using :command:`pkg` and do not want the Dvorak layout, run :command:`pc-extractoverlay ports`.
es: Si usó :ref:`AppCafe®` para instalar i3, instaló automáticamente una configuración predeterminada para todo el sistema que generalmente se genera con :command:`i3-config-wizard`. Si quiere usar la tecla :kbd:`Win` como un modificador y el diseño Dvorak, ejecute :command:`pc-extractoverlay i3dvorak`. Si por el contrario, realizó la instalación usando :command:`pkg` y no quiere el diseño Dvorak, ejecute :command:`pc-extractoverlay ports`.

source: To open an xterm, use :kbd:`Alt` :kbd:`Enter`. Windows do not provide minimize, maximize, or close buttons, so type :command:`exit` when you are finished using an xterm. To leave the window manager and return to the login screen, type :command:`killall i3` from within an xterm.
es: Para abrir una xterm, use :kbd:`Alt` :kbd:`Intro`. Las ventanas no proporcionan botones de minimizar, maximizar, o cerrar, así que ingrese :command:`exit` cuando termine de usar una xterm. Para dejar el gestor de ventanas y regresar a la pantalla de acceso, ingrese :command:`killall i3` desde dentro de una xterm.

source: The `i3 Users Guide <http://i3wm.org/docs/userguide.html>`_ contains the default key bindings and instructions for customizing i3.
es: La `Guía del Usuario de i3 <http://i3wm.org/docs/userguide.html>`_ contiene las combinaciones de teclas predeterminadas e instrucciones para personalizar i3.

source: The `IceWM window manager <http://www.icewm.org>`_ is light-weight. :numref:`Figure %s: IceWM on PC-BSD® <icewm1>` shows a screenshot of IceWM running on PC-BSD®. In this example, the user has launched the "Application" menu by clicking on the "BSD" button in the lower left corner. This menu can also be launched by right-clicking anywhere on the desktop.
es: El `gestor de ventanas IceWM <http://www.icewm.org>`_ es muy ligero. La :numref:`Figura %s: IceWM en PC-BSD® <icewm1>` muestra una captura de pantalla de IceWM corriendo en PC-BSD®. En este ejemplo, el usuario ha lanzado el menú de “Aplicación” presionando en el botón “BSD” en la esquina inferior izquierda. Este menú también puede lanzarse haciendo clic derecho en cualquier parte del escritorio.

source: If you are new to IceWM, refer to the `IceWM FAQ and Howto <http://www.sosst.sk/doc/icewm/FAQ/>`_ for more information about configuration, customization, and keyboard shortcuts.
es: Si usted es nuevo en IceWM, consulte el `FAQ y Howto de IceWM <http://www.sosst.sk/doc/icewm/FAQ/>`_ para más información sobre configuración, personalización y accesos directos de teclado.

source: The `KDE <https://www.kde.org/>`_ desktop environment provides many features and applications. However, it is hardware intensive and may run slowly on a computer with an older processor or a small amount of RAM. :numref:`Figure %s: Applications Menu of KDE4 <kde1>` shows a screenshot of KDE4 running on PC-BSD® |version| with the "Applications" menu open.
es: El entorno de escritorio `KDE <https://www.kde.org/>`_ proporciona muchas características y aplicaciones. Pero requiere de mucho hardware y puede que corra lentamente en una computadora con un procesador antiguo o con poca RAM. La :numref:`Figura %s: Menú de Aplicaciones de KDE4 <kde1>` muestra una captura de pantalla de KDE4 corriendo en PC-BSD® |version| con el menú de "Aplicaciones" abierto.

source: Each category in the "Applications" menu contains many applications and the "Settings" and "System" categories contain many utilities for configuring your system. If you are new to KDE4, take some time to discover which applications best suit your needs. Some of the applications which are provided by KDE4 include:
es: Cada categoría en el menú contiene muchas aplicaciones y las categorías "Configuraciones" y "Sistema" contienen muchas utilerías para configurar su sistema. Si usted es nuevo en KDE4, tómese su tiempo para descubrir cuáles aplicaciones cubren mejor sus necesidades. Algunas de las aplicaciones que acompañan a KDE4 incluyen:

source: `Konqueror <https://docs.kde.org/stable4/en/applications/konqueror/index.html>`_: file manager, web browser, and SSH client found in :menuselection:`Internet --> Web Browser`.
es: `Konqueror <https://docs.kde.org/stable4/en/applications/konqueror/index.html>`_: Administrador de archivos, navegador web, y cliente SSH localizado en :menuselection:`Internet --> Navegador Web`.

source: `Okular <https://docs.kde.org/stable4/en/kdegraphics/okular/index.html>`_: document viewer and annotator found in :menuselection:`Office --> Document Viewer`. Supports PDF, OpenOffice, and Postscript files.
es: `Okular <https://docs.kde.org/stable4/en/kdegraphics/okular/index.html>`_: Visor de documentos y buscador de anotaciones en :menuselection:`Oficina --> Visor de Documentos`. Soporta PDF, OpenOffice, y archivos Postscript.

source: `Dolphin <https://docs.kde.org/trunk5/en/applications/dolphin/>`_: file manager found in :menuselection:`System --> File Manager`. Dolphin provides many features for manipulating files such as comments, tags, search, encryption, and archival (zip/unzip) functions.
es: `Dolphin <https://docs.kde.org/trunk5/en/applications/dolphin/>`_: Administrador de archivos localizado en :menuselection:`Sistema --> Administrador de Archivos`. Dolphin proporciona muchas características para manipular archivos así como comentarios, tags, busqueda, encriptación, y funciones de archivado (zip/unzip).

source: By default, desktop effects are disabled as not all video cards support them. If your video card supports 3D effects and you would like to enable them in KDE, go to :menuselection:`System Settings --> Desktop Effects --> General` and check the box "Enable desktop effects at startup".
es: Por defecto, los efectos del escritorio están deshabilitados ya que no todas las tarjetas de video los soportan. Si su tarjeta de video soporta efectos 3D y quiere habilitarlos en KDE, vaya a :menuselection:`Configuraciones del Sistema --> Efectos de Escritorio --> General` y marque la casilla "Habilitar efectos de escritorio al iniciar".

source: Some of KDE's games require 3D support. If your video card does not support 3D, these games will fail to start.
es: Algunos juegos de KDE requieren soporte de 3D. Si su tarjeta de video no soporta 3D, estos juegos no funcionarán.

source: If you have KDE installed and are currently logged into a different window manager, you can still run any KDE application by specifying its name. For example, type :command:`konqueror` to run the Konqueror web browser or :command:`dolphin` to access the Dolphin file manager.
es: Si usted tiene KDE instalado y su sesión está iniciada en un gestor de ventanas diferente, puede seguir corriendo cualquier aplicación de KDE especificando su nombre. Por ejemplo, ingrese :command:`konqueror` para correr el navegador web Konqueror o :command:`dolphin` para accesar el administrador de archivos Dolphin.

source: `KDE Applications <https://www.kde.org/applications/>`_ includes descriptions and screenshots of all of KDE's applications as well as links to their handbooks.
es: El sitio de `Aplicaciones KDE <https://www.kde.org/applications/>`_ incluye descripciones e instantáneas de todas las aplicaciones de KDE así como enlaces a sus manuales.

source: `kde-look.org <http://KDE-Look.org/>`_ contains additional themes and wallpapers.
es: `kde-look.org <http://KDE-Look.org/>`_ contiene temas adicionales y tapices.
