Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/help.po
Languages: es

source: PC-BSD® uses FreeBSD as its underlying operating system, so everything in the `FreeBSD Handbook <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/>`_ and `FreeBSD FAQ <http://www.freebsd.org/doc/en/books/faq/>`_ applies to PC-BSD® as well. Both documents are comprehensive and cover nearly every task you can accomplish on a FreeBSD system. They are also an excellent resource for learning how things work under the hood of your PC-BSD® system.
es: PC-BSD® usa FreeBSD como sistema operativo subyacente, así que todo lo que se encuentra en el `Manual de FreeBSD <http://www.freebsd.org/doc/en_US.ISO8859-1/books/handbook/>`_ y en las `FAQ de FreeBSD <http://www.freebsd.org/doc/en/books/faq/>`_ aplica a PC-BSD® también. Ambos doumentos son exhaustivos y cubren casi cualquier tarea que se puede realizar en un sistema FreeBSD. También son un excelente recurso para aprender cómo funcionan las cosas tras bambalinas en su sistema PC-BSD®.

source: some configurations described in the FreeBSD Handbook already "just work" on your PC-BSD® system as they have been pre-configured for you. In these instances, reading that FreeBSD Handbook section can help you to understand how your system is configured and why it works.
es: Algunas configuraciones descritas en el Manual de FreeBSD actualmente "funcionan" en su sistema PC-BSD® ya que han sido preconfiguradas para usted. Para estas instancias, leer esa sección del Manual de FreeBSD puede ayudarle a entender cómo está configurado su sistema y por qué funciona.

source: Social Media
es: Redes Sociales

source: The PC-BSD® project maintains several social media sites to help users keep up-to-date with what is happening and to provide venues for developers and users to network with each other. Anyone is welcome to join.
es: El proyecto PC-BSD® mantiene algunos sitios de redes sociales para ayudar a los usuarios a mantenerse al día con lo que está pasando y proveer lugares para desarrolladores y usuarios para conectarse entre ellos. Cualquiera es bienvenido a unirse.

source: `Official PC-BSD® Blog <https://blog.pcbsd.org/>`_
es: `Blog Oficial de PC-BSD® <http://blog.pcbsd.org/>`_

source: `PC-BSD® on Twitter <https://twitter.com/PCBSD/>`_
es: `PC-BSD® en Twitter <https://twitter.com/PCBSD/>`_

source: `PC-BSD® Facebook Group <https://www.facebook.com/groups/4210443834/>`_
es: `Grupo de Facebook de PC-BSD® <https://www.facebook.com/groups/4210443834/>`_

source: `PC-BSD® Google+ page <https://plus.google.com/u/0/+pcbsd/posts>`_
es: `Página de Google+ de PC-BSD® <https://plus.google.com/u/0/+pcbsd/posts>`_

source: `PC-BSD® LinkedIn Group <http://www.linkedin.com/groups?gid=1942544>`_
es: `Grupo de LinkedIn de PC-BSD® <http://www.linkedin.com/groups?gid=1942544>`_

source: Search and Portals
es: Búsqueda y Portales

source: Many BSD related search portals exist. If you can not find the answer that you are looking for in the forums or mailing lists, try searching these websites:
es: Existen muchos portales de búsqueda relativos a BSD. Si no puede encontrar la respuesta que está buscando en los foros o listas de correos, intente buscando en estos sitios web:

source: `FreeBSD Search <http://www.freebsd.org/search/index.html>`_ (includes mailing list archives, man pages, and web pages)
es: `FreeBSD Search <http://www.freebsd.org/search/index.html>`_ (incluye archivos de listas de correos, páginas del manual, y páginas web)

source: `Slashdot BSD <https://bsd.slashdot.org/>`_
es: `Slashdot BSD <http://bsd.slashdot.org/>`_

source: Other Resources
es: Otros Recursos

source: The following BSD sites and resources may also contain useful information:
es: Los siguientes sitios y recursos BSD también puede contener información útil:

source: `PC-BSD® YouTube channel <https://www.youtube.com/channel/UCyd7MaPVUpa-ueUsGjUujag>`_
es: `Canal de YouTube de PC-BSD® <https://www.youtube.com/channel/UCyd7MaPVUpa-ueUsGjUujag>`_

source: `BSD YouTube channel <https://www.youtube.com/user/bsdconferences>`_
es: `Canal de YouTube de BSD <https://www.youtube.com/user/bsdconferences>`_

source: `BSD Magazine <https://bsdmag.org/>`_ (free, monthly download)
es: `BSD Magazine <http://bsdmag.org/>`_ (descarga gratuita, mensual)

source: `FreeBSD Journal <http://www.freebsdjournal.com/>`_ (bi-monthly magazine)
es: `FreeBSD Journal <http://www.freebsdjournal.com/>`_ (revista bimestral)

source: `BSD Hacks <http://shop.oreilly.com/product/9780596006792.do>`_ (book)
es: `BSD Hacks <http://shop.oreilly.com/product/9780596006792.do>`_ (libro)

source: `The Best of FreeBSD Basics <http://reedmedia.net/books/freebsd-basics/>`_ (book)
es: `The Best of FreeBSD Basics <http://reedmedia.net/books/freebsd-basics/>`_ (libro)

source: `Definitive Guide to PC-BSD® <http://www.apress.com/9781430226413>`_ (book)
es: `Definitive Guide to PC-BSD® <http://www.apress.com/9781430226413>`_ (libro)
