Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/help.po
Languages: es

source: Finding Help
es: Buscando Ayuda

source: The PC-BSD® Project strives to make using PC-BSD® as easy as possible for newcomers. Should you need help, there are plenty of ways to get in touch with the PC-BSD® community. This chapter describes the available resources.
es: El proyecto PC-BSD® se esfuerza en hacer el uso de PC-BSD® tan fácil como sea posible para los nuevos usuarios. Si necesita ayuda, hay muchas formas de entrar en contacto con la comunidad PC-BSD®. Este capítulo describe los recursos disponibles.

source: As your teacher may have told you, "Do or Do Not, there is no try", or more likely, that "there is no such thing as a stupid question". However, there are better ways to ensure that you receive the response you seek and that it will be a productive exchange for all parties involved. The two articles below describe how and why it is important to follow certain protocols when requesting help:
es: Como su maestro debió decirle, "Hazlo o No Lo Hagas, pero no lo intentes", o mejor dicho, que "no hay preguntas estúpidas". De cualquier forma, hay mejores formas de asegurarse que recibe la respuesta que está buscando y que será un intercambio productivo para todas las partes involucradas. Los dos artículos siguientes describen cómo y por qué es importante seguir ciertos protocolos cuando busque ayuda:

source: `How to Ask Smart Questions (PDF) <http://divajutta.com/doctormo/foo/ask-smart-questions.pdf>`_
es: `Cómo Hacer Preguntas Inteligentes (PDF) <http://divajutta.com/doctormo/foo/ask-smart-questions.pdf>`_

source: `How To Ask Questions The Smart Way <http://catb.org/~esr/faqs/smart-questions.html>`_
es: `Cómo Hacer Preguntas De La Forma Correcta <http://catb.org/~esr/faqs/smart-questions.html>`_

source: PC-BSD® Forums
es: Foros de PC-BSD®

source: `The PC-BSD® Forums <https://forums.pcbsd.org/>`_ contain a wealth of information, tips and solutions which you can access from a web browser. There are many active members and you will find that most questions are quickly answered. If you are having problems with something on your PC-BSD® system, try using the forum's search utility. You will often find that someone else has posted a similar question and that other users have responded with a fix or a how-to.
es: Los `Foros de PC-BSD® <https://forums.pcbsd.org/>`_ contienen bastante información, tips y soluciones que puede accesar desde su navegador web. Hay muchos miembros activos y se dará cuenta que la mayoría de las preguntas se responden muy rápido. Si está teniendo problemas con algo en su sistema PC-BSD®, intente usar la utilería de búsqueda del foro. Casi siempre encontrará que alguien más ha posteado una pregunta similar y que otros usuarios han respondido con una solución o con instrucciones.

source: The Forums have been categorized, allowing users to skim through the categories that interest them while learning some new information along the way. You do not have to create a login account in order to search or read through the forums. However, if you wish to ask or answer a question on a forum or subscribe to a forum in order to be automatically notified when a new post is added, you will need to be logged in. To subscribe to a forum, open the page for the forum and click the "Subscribe to this Forum" link in the far right end of the bar that contains the forum's name. If you would like to view new posts, click your username near the upper right corner and either click "View New Posts" or "View Today's Posts".
es: Los Foros se han categorizado, permitiendo a los usuarios echar un vistazo a las categorías que les interesan mientras aprenden algunas cosas en el proceso. No necesita crear una cuenta de acceso para poder buscar o leer los foros. De cualquier forma, si quiere preguntar o responder una pregunta en un foro o suscribirse en un foro para ser notificado automáticamente cuando un nuevo tema se añade, necesitará accesar. Para suscribirse en un foro, abra la página del foro y presione en el enlace “Suscribirse a este Foro” en la extrema derecha de la barra que contiene el nombre del foro. Si quiere ver nuevos temas, presione en su nombre de usuario cerca de la esquina superior derecha y ya sea que presione en “Ver Nuevos Temas” o “Ver Temas de Hoy”.

source: The current categories and the forum descriptions are described below:
es: Las siguientes categorías y las descripciones del foro se describen a continuación:

source: **The General Forum** contains the following sub-forums:
es: **El Foro General** contiene los siguientes sub-foros:

source: `Announcements <https://forums.pcbsd.org/forum-16.html>`_: contains announcements of new releases and news related to PC-BSD®. Subscribing to this forum is a good way to keep up-to-date with the latest news about PC-BSD®.
es: `Anuncios <https://forums.pcbsd.org/forum-16.html>`_: contiene anuncios de nuevas versiones y noticias relacionadas a PC-BSD®. Suscribiéndose a este foro es una buena manera de mantenerse al día con las últimas noticias sobre PC-BSD®.

source: `Desktop Questions and Support <https://forums.pcbsd.org/forum-13.html>`_: use this forum if your question does not fit into any of the other forum categories.
es: `Preguntas y Soporte de Escritorio <https://forums.pcbsd.org/forum-13.html>`_: use este foro si su pregunta no encaja en cualquier otra de las categorías del foro.

source: `Server Questions and Support <https://forums.pcbsd.org/forum-15.html>`_: this forum is for discussion of server related topics.
es: `Preguntas y Soporte de Servidor <https://forums.pcbsd.org/forum-15.html>`_: este foro es para discusiones de temas relacionados a servidores.

source: `Hardware Support and Questions <https://forums.pcbsd.org/forum-83.html>`_: if you are having problems with any hardware devices, post the details of your problem to this forum.
es: `Soporte y Preguntas de Hardware <https://forums.pcbsd.org/forum-83.html>`_: si está teniendo problemas con cualquier dispositivo de hardware, ponga los detalles de su problema en este foro.

source: `Lumina <https://forums.pcbsd.org/forum-26.html>`_: this forum is for the discussion of the :ref:`Lumina` desktop.
es: `Lumina <https://forums.pcbsd.org/forum-26.html>`_: este foro es para discusiones del escritorio :ref:`Lumina`.

source: `Developers Corner <https://forums.pcbsd.org/forum-84.html>`_: a discussion area for PC-BSD® developers and for discussing improvements to the operating system.
es: `El Rincón de los Desarrolladores <https://forums.pcbsd.org/forum-84.html>`_: un área de discusión para desarrolladores PC-BSD® y para discutir mejoras al sistema operativo.

source: `Tips, Tricks, and Guides <https://forums.pcbsd.org/forum-17.html>`_: this forum contains suggestions and how-tos for configuring and tweaking your PC-BSD® system.
es: `Tips, Trucos, y Guías <https://forums.pcbsd.org/forum-17.html>`_: este foro contiene sugerencias y COMOs para configurar y afinar su sistema PC-BSD®.

source: `Ports, Packages, and Software <https://forums.pcbsd.org/forum-82.html>`_: a general discussion area regarding software which can be installed on PC-BSD®.
es: `Ports, Paquetes, y Software <https://forums.pcbsd.org/forum-82.html>`_: un área de discusión general dedicada al software que puede ser instalado en PC-BSD®.

source: `Documentation Project <https://forums.pcbsd.org/forum-41.html>`_: this is a discussion area for those who wish to help with PC-BSD® documentation.
es: `Proyecto de Documentación <https://forums.pcbsd.org/forum-41.html>`_: esta es un área de discusión para aquellos que quieran ayudar con la documentación de PC-BSD®.

source: `Books on BSD <https://forums.pcbsd.org/forum-19.html>`_: this forum contains errata and discussion for published books about BSD.
es: `Libros sobre BSD <https://forums.pcbsd.org/forum-19.html>`_: este foro contiene errores y discusión sobre libros publicados sobre BSD.

source: `Advocacy <https://forums.pcbsd.org/forum-20.html>`_: this is a brainstorming area for promoting PC-BSD®.
es: `Apoyo <https://forums.pcbsd.org/forum-20.html>`_: esta es un área de lluvia de ideas para promover PC-BSD®.

source: `The Lounge <https://forums.pcbsd.org/forum-14.html>`_: this is a general discussion area for PC-BSD® users. Posts in this forum are not of a technical nature. Posts should be of interest to other PC-BSD® users and not contain any mature or slanderous content.
es: `El Lounge <https://forums.pcbsd.org/forum-14.html>`_: esta es un área de discusión general para usuarios de PC-BSD®. Los temas en este foro no son de naturaleza técnica. Los temas deberán ser de interés a otros usuarios de PC-BSD® y no llevar ningún contenido inapropiado.

source: **The International Forum** contains forums for non-English speakers for PC-BSD® related discussions in their native language. Each forum has its own categories for organizing posts. The following forums are available:
es: **El Foro Internacional** contiene foros para personas que no hablan inglés para discusiones relacionadas con PC-BSD® en su idioma natal. Cada foro tiene sus propias categorías para organizar los temas. Los siguientes foros están disponibles:

source: `Translations <https://forums.pcbsd.org/forum-40.html>`_: this is a discussion area for translators who localize PC-BSD® menus or translate PC-BSD® documentation.
es: `Traducciones <https://forums.pcbsd.org/forum-40.html>`_: esta es un área de discusión para traductores que adaptan menús de PC-BSD® o traducen la documentación de PC-BSD®.

source: `Chinese <https://forums.pcbsd.org/forum-47.html>`_
es: `Chino <https://forums.pcbsd.org/forum-47.html>`_

source: `French <https://forums.pcbsd.org/forum-45.html>`_
es: `Francés <https://forums.pcbsd.org/forum-45.html>`_

source: `German <https://forums.pcbsd.org/forum-46.html>`_
es: `Alemán <https://forums.pcbsd.org/forum-46.html>`_

source: `Italian <https://forums.pcbsd.org/forum-85.html>`_
es: `Italiano <https://forums.pcbsd.org/forum-85.html>`_

source: `Japanese <https://forums.pcbsd.org/forum-50.html>`_
es: `Japonés <https://forums.pcbsd.org/forum-50.html>`_

source: `Russian <https://forums.pcbsd.org/forum-49.html>`_
es: `Ruso <https://forums.pcbsd.org/forum-49.html>`_

source: `Slovenian <https://forums.pcbsd.org/forum-48.html>`_
es: `Esloveno <https://forums.pcbsd.org/forum-48.html>`_

source: `Spanish <https://forums.pcbsd.org/forum-44.html>`_
es: `Español <https://forums.pcbsd.org/forum-44.html>`_

source: While logged into the forums, you can click your username towards the upper right corner to edit your profile, options, avatar, signature, or buddy list.
es: Mientras esté en su sesión dentro de los foros, puede presionar su nombre de usuario en la esquina superior derecha para editar su perfil, opciones, avatar, firma, o lista de amigos.

source: Before asking a question on the forums or starting a new thread, first use the search utility to see if a similar thread already exists. If one does, you can add to the conversation by using the "Reply to this topic" button. If you find a thread useful, feel free to click the "Add Thank You" button to let the original poster know that you benefited from their knowledge.
es: Antes de hacer una pregunta en los foros o comenzar un nuevo tema, use primero la utilería de búsqueda para ver si un tema similar ya existe. Si es así, puede añadir a la conversación usando el botón "Contestar a este tema". Si encuentra un tema útil, siéntase libre de presionar el botón "Agregar Agradecimiento" para hacerle saber al autor original que usted se ha beneficiado de su conocimiento.

source: If a similar thread does not already exist, review the forum categories to determine which one is the best fit for your post. When creating a new thread, use a useful "Thread Subject" to describe your problem or question--remember, other users may be researching a similar issue and you want them to find your thread. Include enough details in your message so that others can quickly understand what you are experiencing--otherwise, they will have to ask you additional questions to understand your problem. Make sure you are subscribed to your thread so that you will receive a notification when someone responds to it.
es: Si un tema similar no existe aún, revise las categorías del foro para determinar cuál es la que mejor se adapta a su tema. Cuando cree un nuevo tema, use un "Título del Tema" útil para describir su problema o pregunta--recuerde, otros pueden estar buscando un problema similar y usted querrá que encuentren su tema. Incluya suficientes detalles en su mensaje para que otros puedan rápidamente entender lo que le está pasando--de otra forma, tendrán que hacerle preguntas adicionales para entender su problema. Asegúrese de estar suscrito a su tema para que reciba una notificación en caso de que alguien responda.

source: You can ask a question by clicking on the "Start new topic" button in the forum category that most closely matches your question. If you do not see a category that matches your question, try the "Desktop Questions and Support" category.
es: Puede hacer una pregunta presionando en el botón "Empezar nuevo tema" en la categoría del foro que más se acerque a su pregunta. Si no ve una categoría que sea adecuada para su pregunta, intente en la categoría "Preguntas y Soporte del Escritorio".

source: In addition to the forums available from the PC-BSD® Forums website, the following forums may assist you in troubleshooting your PC-BSD® system:
es: Adicionalmente a los foros disponibles en el sitio de los Foros de PC-BSD®, los siguientes foros pueden ayudarle a resolver problemas de su sistema PC-BSD®.

source: `FreeBSD Forums <https://forums.freebsd.org/>`_: many PC-BSD® problems are related to the underlying FreeBSD operating system. The FreeBSD forums are very active and full of useful information that can apply to your PC-BSD® system.
es: `FreeBSD Forums <https://forums.freebsd.org/>`_: muchos problemas de PC-BSD® están relacionados al sistema operativo subyacente FreeBSD. Los foros de FreeBSD están muy activos y llenos de información útil que se puede aplicar a su sistema PC-BSD®.

source: `BSD Foren <http://www.bsdforen.de/index.php>`_: these forums are in German and contain many categories for each of the BSD operating systems.
es: `BSD Foren <http://www.bsdforen.de/index.php>`_: estos foros están en Alemán y contienen muchas categorías para cada uno de los sistemas operativos BSD.

source: `BSD Guru PC-BSD® Forum <http://www.bsdguru.org/dyskusja/viewforum.php?f=45>`_: this forum is in Polish and is specific to PC-BSD®, forums for the other BSD operating systems are also available at `BSD Guru <http://www.bsdguru.org/dyskusja/>`_.
es: `BSD Guru PC-BSD® Forum <http://www.bsdguru.org/dyskusja/viewforum.php?f=45>`_: este foro está en Polaco y es específico a PC-BSD®, los foros para otros sistemas operativos BSD también están disponibles en `BSD Guru <http://www.bsdguru.org/dyskusja/>`_.

source: PC-BSD® IRC Channel
es: Canal IRC de PC-BSD®

source: Like many open source projects, PC-BSD® has an :wikipedia:`Internet Relay Chat` (IRC) channel so that users can chat and get help in real time. To get connected, use the following information in your IRC client:
es: Al igual que muchos proyectos open source, PC-BSD® tiene un Canal IRC para que los usuarios puedan platicar y obtener ayuda en tiempo real. Para conectarse, use la información siguiente en su cliente de IRC:

source: **Server name:** irc.freenode.net
es: **Nombre del Servidor:** irc.freenode.net

source: **Channel name:** #pcbsd (note that the # is required)
es: **Nombre del Canal:** #pcbsd (note que se requiere #)

source: :ref:`AppCafe®` has an IRC category where you can find IRC client software. If you do not wish to install an IRC client, you can instead use the `web interface to #pcbsd <http://irc.lc/freenode/pcbsd>`_.
es: :ref:`AppCafe®` tiene una categoría IRC donde puede encontrar clientes de IRC. Si no quiere instalar un cliente de IRC, puede entonces usar la `interfaz web de #pcbsd <http://irc.lc/freenode/pcbsd>`_.

source: IRC is a great way to chat with other users and get answers to your questions. A few things to keep in mind if you ask a question on IRC:
es: El IRC es un gran medio para platicar con otros usuarios y obtener respuestas a sus preguntas. Algunas cosas a tener en cuenta si hace una pregunta en el IRC:

source: Most of the regular users are always logged in, even when they are away from their computer or are busy doing other things. If you do not get an answer right away, do **not** get mad, leave the channel, and never come back again. Stick around for a while to see if anyone responds.
es: La mayoría de los usuarios regulares siempre están conectados, aún cuando están lejos de su computadora o están ocupados haciendo otras cosas. Si no obtiene una respuesta al momento, **no** se moleste, deje el canal, o no vuelva jamás. Manténgase en el canal por un tiempo para ver si alguien responde.

source: IRC users represent many different time zones. It is quite possible that it is late at night or very early in the morning for some users when you ask a question.
es: Los usuarios del IRC representan a muchas zonas horarias. Es muy posible que sea muy tarde en la noche o muy temprano en la mañana para muchos usuarios cuando haga su pregunta.

source: Do not post error messages in the channel as the IRC software will probably kick you out for flooding and it is considered to be bad etiquette. Instead, use a pasting service such as `pastebin <http://pastebin.com/>`_ and refer to the URL on channel.
es: No escriba sus mensajes de error en el canal ya que el software de IRC probablemente lo sacará por inundar el canal con mensajes y esto es considerado como mala etiqueta. En cambio, use un servicio de pegado como `pastebin <http://pastebin.com/>`_ y refierase a la URL en el canal.

source: Be polite and do not demand that others answer your question.
es: Sea educado y no exija a los demás que respondan a su pregunta.

source: It is considered rude to DM (direct message) someone who does not know you. If no one answers your question, do not start DMing people you do not know.
es: Está considerado como ofensivo el hacer DM (mensajes directos) a alguien que no le conoce. Si nadie contesta a su pregunta, no comience a mandar DMs a personas que no conoce.

source: The first time you join a channel, it is okay to say hi and introduce yourself.
es: La primera vez que entra en un canal, está bien el decir hola y presentarse.

source: Mailing Lists
es: Listas de Correo

source: Mailing lists are a handy way to discuss problems, solutions, and requested features as they create a searchable archive of discussions. The PC-BSD® Project offers the following mailing lists to cover a wide variety of discussion topics:
es: Las listas de correos son una forma muy cómoda de discutir problemas, soluciones, y solicitud de características ya que crean un archivo navegable de discusiones. El proyecto PC-BSD® ofrece las siguientes listas de correo para cubrir una gran variedad de temas de discusión:

source: `Announce <http://lists.pcbsd.org/mailman/listinfo/announce>`_: a read-only, low frequency list used by the PC-BSD® team to make announcements to the community.
es: `Announce <http://lists.pcbsd.org/mailman/listinfo/announce>`_: una lista de solo lectura y baja frecuencia usada por el equipo de PC-BSD® para hacer anuncios a la comunidad.

source: `Commits <http://lists.pcbsd.org/mailman/listinfo/commits>`_: lists commits as PC-BSD® code is added or modified by developers.
es: `Commits <http://lists.pcbsd.org/mailman/listinfo/commits>`_: lista las contribuciones cada que código de PC-BSD® es añadido o modificado por los desarrolladores.

source: `Dev <http://lists.pcbsd.org/mailman/listinfo/dev>`_: for discussion related to PC-BSD® technical development.
es: `Dev <http://lists.pcbsd.org/mailman/listinfo/dev>`_: para discusiones relacionadas al desarrollo técnico de PC-BSD®.

source: `Docs <http://lists.pcbsd.org/mailman/listinfo/docs>`_: for communications between those who are involved, or interested in contributing to, the PC-BSD® documentation effort.
es: `Docs <http://lists.pcbsd.org/mailman/listinfo/docs>`_: para comunicaciones entre aquellos que están involucrados, o interesados en contribuir al esfuezo de documentación de PC-BSD®.

source: `Testing <http://lists.pcbsd.org/mailman/listinfo/testing>`_:for those wishing to participate in PC-BSD® beta testing and feedback.
es: `Testing <http://lists.pcbsd.org/mailman/listinfo/testing>`_: para aquellos que quieran participar en las pruebas y retroalimentación de PC-BSD®.

source: `Translations <http://lists.pcbsd.org/mailman/listinfo/translations>`_: for those involved in translating for PC-BSD®.
es: `Translations <http://lists.pcbsd.org/mailman/listinfo/translations>`_: para aquellos involucrados en la traducción de PC-BSD®.

source: `Translations-notifications <http://lists.pcbsd.org/mailman/listinfo/translations-notifications>`_: lists documentation commits that affect translations
es: `Translations-notifications <http://lists.pcbsd.org/mailman/listinfo/translations-notifications>`_: lista las contribuciones a la documentación que afectan a las traducciones.

source: Each mailing list includes a description of topics suitable for discussion on that list and indicates if it is read only or available for user discussion. Anyone can read the archives of a list. If you wish to send an email to a mailing list, you will need to first subscribe to the list. The link for each mailing list provides an interface for subscribing to that list. When you send an email to the list, remember to use the mailing address that you used when you subscribed to the list.
es: Cada lista de correos incluye una descripción de temas apropiados para la discusión en esa lista e indica si es de solo lectura o disponible para discusión por parte de los usuarios. Cualquiera puede leer los archivos de cualquier lista. Si quiere mandar un correo a una lista de correos, necesitará primero suscribirse a la lista. El enlace para cualquier lista de correos proporciona una interface para suscribirse a esa lista. Cuando mande un correo a la lista, recuerde usar la dirección de la lista de correos que usó cuando se suscribió a la lista.

source: Several of the mailing lists are archived at `gmane <http://dir.gmane.org/index.php?prefix=gmane.os.pcbsd>`_. Gmane allows you to read the archives in several different formats. It also provides RSS feeds in various formats for keeping up-to-date on new messages and topics.
es: Algunas de las listas de correo están archivadas en `gmane <http://dir.gmane.org/index.php?prefix=gmane.os.pcbsd>`_. Gmane permite leer los archivos en diferentes formatos. También proporciona feeds RSS en varios formatos para mantenerse al día con los nuevos mensajes y temas.

source: In addition to the official mailing lists, there are mailing lists set up by PC-BSD® users. Many of these lists are designed for discussion in other languages. A list of alternative PC-BSD® mailing lists can be found at `Google groups <https://groups.google.com/forum/#!search/pc-bsd>`_.
es: Adicionalmente a las listas de correo oficiales, hay listas de correos creadas por usuarios de PC-BSD®. La mayoría de estas listas están designadas para discutir en otros idiomas. Una lista de listas de correo alternativas de PC-BSD® se puede encontrar en los `grupos de Google <https://groups.google.com/forum/#!search/pc-bsd>`_.

source: FreeBSD Handbook and FAQ
es: El Manual de FreeBSD y FAQ
