Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/introduction.po
Languages: de, fr

source: **Preface**
de: **Vorwort**
fr: **Préface**

source: Written by users of the PC-BSD® operating system.
de: Geschrieben von den Benutzerinnen und Benutzern des Betriebssystems PC-BSD®.
fr: Écrit par les utilisateurs du système d'exploitation PC-BSD®.

source: Copyright © 2005 - 2016 The PC-BSD® Project.
de: Copyright © 2005 - 2016 Das Projekt PC-BSD®.
fr: Copyright © 2005 - 2016 Le Projet PC-BSD®.

source: Welcome to PC-BSD®! This Handbook covers the installation and use of PC-BSD® |version|. This Handbook is a work in progress and relies on the contributions of many individuals. If you are interested in assisting with the Handbook, refer to the documentation `README <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. If you use IRC Freenode, you are welcome to join the #pcbsd channel where you will find other PC-BSD® users.
de: Willkommen zu PC-BSD®! Dieses Handbuch beschreibt die Installation und die Benutzung von PC-BSD® |version|. Dieses Handbuch ist in ständiger Bearbeitung und gründet sich auf die Beiträge vieler Einzelpersonen. Wenn Sie daran interessiert sind beim Handbuchs zu unterstützen, beziehen Sie auf die Dokumentation `README <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. Wenn Sie IRC Freenode nutzen, sind Sie eingeladen dem Kanal #pcbsd beizutreten, wo Sie auch andere Benutzerinnen und Benutzer von PC-BSD® finden werden.
fr: Bienvenue sur PC-BSD®! Ce guide couvre l'installation et l'utilisation de PC-BSD® |version|. Ce guide est continuellement mis à jour par la contribution de nombreux utilisateurs. Si vous désirez apporter votre aide, consulter la documentation `README <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_. Si vous utilisez IRC Freenode, vous pouvez nous rejoindre sur le canal #pcbsd où vous trouverez d'autres utilisateurs de PC-BSD®.

source: Previous versions of the Handbook in various formats and languages are available from `here <ftp://ftp.pcbsd.org/pub/handbook/>`_.
de: Vorherige Versionen des Handbuches sind in verschiedensten Formaten und Sprachen von ftp://ftp.pcbsd.org/pub/handbook/ `hier <ftp://ftp.pcbsd.org/pub/handbook/>`_ verfügbar.
fr: Les versions précédentes de ce guide, dans divers formats et langues, sont disponibles `ici <ftp://ftp.pcbsd.org/pub/handbook/>`_.

source: The PC-BSD® Users Handbook is freely available for sharing and redistribution under the terms of the `Creative Commons Attribution License <https://creativecommons.org/licenses/by/4.0/>`_. This means that you have permission to copy, distribute, translate, and adapt the work as long as you attribute the PC-BSD® Project as the original source of the Handbook.
de: Das Benutzungshandbuch von PC-BSD® ist frei verfügbar zum Verteilen und Neuverbreiten unter den Bedingungen der `Creative Commons Namensnennung Lizenz International <https://creativecommons.org/licenses/by/4.0/>`_. Das bedeutet, dass Sie die Berechtigung zum Kopieren, Verbreiten, Übersetzen und Übernehmen haben solange Sie das PC-BSD® Project als orginale Quelle des Handbuches benennen.
fr: Le guide utilisateur de PC-BSD® peut être librement partagé et redistribué sous les termes de la licence `Creative Commons Attribution License <https://creativecommons.org/licenses/by/4.0/>`_. Cela signifie que vous avez l'autorisation de copier, distribuer, traduire et adapter ce travail tant que vous attribuez le projet PC-BSD® comme source originelle du guide.

source: PC-BSD® and the PC-BSD® logo are registered trademarks of `iXsystems <https://www.ixsystems.com/>`_. If you wish to use the PC-BSD® logo in your own works, ask for permission first from marketing@ixsystems.com.
de: PC-BSD® und das PC-BSD® Logo sind registrierte Markenzeichen von `iXsystems <https://www.ixsystems.com/>`_. Wenn Sie das Logo von PC-BSD® in eigenen Arbeiten nutzen möchten, fragen Sie bitte um Erlaubnis unter folgender Adresse marketing@ixsystems.com.
fr: PC-BSD® et le logo PC-BSD® sont des marques déposées de `iXsystems <https://www.ixsystems.com/>`_. Si vous souhaitez utiliser le logo PC-BSD® dans vos propres travaux, demandez l'autorisation préalable à marketing@ixsystems.com.

source: AMD is a trademark of Advanced Micro Devices, Inc.
de: AMD ist eine eingetragene Marke von Advanced Micro Devices, Inc.
fr: AMD est une marque de Advanced Micro Devices, Inc.

source: Apache is a trademark of The Apache Software Foundation.
de: Apache ist eine eingetragene Marke von The Apache Software Foundation.
fr: Apache est une marque de The Apache Software Foundation.

source: AppCafe® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
de: AppCafe® ist ein registriertes Markenzeichen von `iXsystems <https://www.ixsystems.com/>`_.
fr: AppCafe® est une marque déposée de `iXsystems <https://www.ixsystems.com/>`_.

source: Asus® and Eee PC® are registered trademarks of ASUSTeK® Computer Inc.
de: Asus® und Eee PC® sind eingetragene Marke von ASUSTeK® Computer Inc.
fr: Asus® et Eee PC® sont des marques déposées de ASUSTeK® Computer Inc.

source: Facebook® is a registered trademark of Facebook Inc.
de: Facebook® ist eine eingetragene Marke von Facebook Inc.
fr: Facebook® est une marque déposée de Facebook Inc.

source: Flash® is a registered trademark of Adobe Systems Incorporated in the United States and/or other countries.
de: Flash® ist eine eingetragene Marke von Adobe Systems Incorporated in den Vereinigte Staaten von Amerika und/oder anderen Ländern.
fr: Flash® est une marque déposée de Adobe Systems Incorporate aux États-Unis et/ou dans d'autres pays.

source: FreeBSD® is a registered trademark of the `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.
de: FreeBSD® ist ein registriertes Markenzeichen von `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.
fr: FreeBSD® est une marque déposée de `FreeBSD Foundation <https://www.freebsdfoundation.org/>`_.

source: FreeNAS® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
de: FreeNAS® ist ein registriertes Markenzeichen von `iXsystems <https://www.ixsystems.com/>`_.
fr: FreeNAS® est une marque déposée de `iXsystems <https://www.ixsystems.com/>`_.

source: IBM® is a registered trademark of International Business Machines Corporation.
de: IBM® ist eine eingetragene Marke von International Business Machines Corporation.
fr: IBM® est une marque déposée de International Business Machines Corporation.

source: Intel, the Intel logo, Pentium Inside, and Pentium are trademarks of Intel Corporation in the U.S. and/or other countries.
de: Intel, das Intel-Logo, Pentium Inside und Pentium sind eingetragene Marken von Intel Corporation in den Vereinigten Staaten und/oder anderen Ländern.
fr: Intel, le logo Intel, Pentium Inside, et Pentium sont des marques déposées de Intel Corporation aux États-Unis et/ou autres pays.

source: Java™ is a trademark of Oracle America and/or its affiliates in the United States and other countries.
de: Java™ ist eine Marke von Oracle America und/oder seinen verbundenen Unternehmen in den Vereinigten Staaten und in anderen Ländern.
fr: Java™ est une marque déposée de Oracle America et/ou ces filiales aux États-Unis et autres pays.

source: Lenovo® is a registered trademark of Lenovo.
de: Lenovo® ist eine eingetragene Marke von Lenovo.
fr: Lenovo® est une marque déposée de Lenovo.

source: LinkedIn® is a registered trademark of LinkedIn Corporation.
de: LinkedIn® ist eine eingetragene Marke von LinkedIn Corporation.
fr: LinkedIn® est une marque déposée de LinkedIn Corporation.

source: Linux® is a registered trademark of Linus Torvalds.
de: Linux® ist eine eingetragene Marke von Linus Torvalds.
fr: Linux® est une marque déposée de Linus Torvalds.

source: Mac and Mac OS are trademarks of Apple Inc., registered in the U.S. and other countries.
de: Mac und Mac OS sind eingetragene Marken von Apple Inc. in den USA und anderen Ländern.
fr: Mac et Mac OS sont des marques de Apple Inc., enregistrés aux États-Unis et autres pays.

source: MacBook® is a registered trademark of Apple Inc.
de: MacBook® ist eine eingetragene Marke von Apple Inc.
fr: MacBook® est une marque déposée de Apple Inc.

source: MySQL is a trademark of Oracle.
de: MySQL ist eine eingetragene Marke von Oracle.
fr: MySQL est une marque de Oracle.

source: NVIDIA® is a trademark and/or registered trademark of NVIDIA Corporation in the U.S. and other countries.
de: NVIDIA® ist eine eingetragene Marke von NVIDIA Corporation in den USA und anderen Ländern.
fr: NVIDIA® est une marque et/ou une marque déposée de NVIDIA Corporation aux États-Unis et autres pays.

source: PostgreSQL® is a registered trademark of the PostgreSQL Global Development Group.
de: PostgreSQL® ist eine eingetragene Marke von PostgreSQL Global Development Group.
fr: PostgreSQL® est une marque déposée de PostgreSQL Global Development Group.

source: ThinkPad® is a registered trademark of Lenovo.
de: ThinkPad® ist eine eingetragene Marke von Lenovo.
fr: ThinkPad® est une marque déposée de Lenovo.

source: TrueOS® is a registered trademark of `iXsystems <https://www.ixsystems.com/>`_.
de: TrueOS® ist ein registriertes Markenzeichen von `iXsystems <https://www.ixsystems.com/>`_.
fr: TrueOS® est une marque déposée de `iXsystems <https://www.ixsystems.com/>`_.

source: Twitter is a trademark of Twitter, Inc. in the United States and other countries.
de: Twitter ist eine eingetragene Marke von Twitter Inc. in den Vereinigten Staaten und anderen Ländern.
fr: Twitter est une marque de Twitter, Inc. aux États-Unis et autres pays.

source: UNIX® is a registered trademark of The Open Group.
de: UNIX® ist eine eingetragene Marke von The Open Group.
fr: UNIX® est une marque déposée de The Open Group.

source: VirtualBox® is a registered trademark of Oracle.
de: VirtualBox® ist eine eingetragene Marke von Oracle.
fr: VirtualBox® est une marque déposée de Oracle.

source: VMWare® is a registered trademark of VMWare, Inc.
de: VMWare® ist eine eingetragene Marke von VMWare, Inc.
fr: VMWare® est une marque déposée de VMWare, Inc.

source: Windows® is a registered trademark of Microsoft Corporation in the United States and other countries.
de: Windows® ist eine eingetragene Marke von Microsoft Corporation in den Vereinigten Staaten und anderen Ländern.
fr: Windows® est une marque déposée de Microsoft Corporation aux États-Unis et autres pays.

source: **Typographic Conventions**
de: **Typographische Konventionen**
fr: **Conventions Typographiques**

source: Names of graphical elements such as buttons, icons, fields, columns, and boxes are enclosed within quotes. For example: click the "Browse Categories" button.
de: Namen von grafischen Elementen, wie Schaltflächen, Symbole, Spalten und Kästen sind von Anführungszeichen eingeschlossen. Zum Beispiel: klicke die Schaltfläche "Durchsuche Kategorien".
fr: Les noms des éléments graphiques comme les boutons, icônes, champs, colonnes et boites de dialogue sont entourés avec des guillemets. Par exemple: cliquez sur le bouton "Parcourir les catégories".

source: Menu selections are italicized and separated by arrows. For example: :menuselection:`Control Panel --> About`.
de: Auswahlen beim Menü sind kursiv und getrennt mit Pfeilen: Zum Beispiel: :menuselection:`Systemsteuerung --> Über`.
fr: Les sélections des menus sont mises en italiques et séparées par des flèches. Par exemple :menuselection:`Panneau de contrôle --> A propos`.

source: Commands that are mentioned within text are highlighted in :command:`bold text`. Command examples and command output are contained in green code blocks.
de: Kommandos, die innerhalb eines Textes genannt werden, sind in :command:`fetten Text`hervorgehoben. Beispiele für ein Kommando und die Ausgabe für ein Kommando sind in grünen Blöcken für Code enthalten.
fr: Les commandes mentionnées dans le texte sont surlignés en :command:`gras`. Les exemples de commande et les sorties de commande sont contenues dans des blocs de code verts.

source: File names are enclosed in a blue box :file:`/like/this`.
de: Dateinamen sind in einem blauen Kasten :file:`/like/this` eingeschlossen.
fr: Les noms de fichiers sont contenus dans des boites bleues :file:`/comme/ceci`.

source: Keystrokes are formatted in a blue box. For example: press :kbd:`Enter`.
de: Tastendrücke sind in einem blauen Kasten formatiert. Zum Beispiel: Drücke :kbd:`Eingabe`.
fr: Les touches sont désignées par des boites bleues. Par exemple: pressez :kbd:`Entrée`.

source: **bold text** is used to emphasize an important point.
de: **fetter Text** wird verwendet, um einen wichtigen Punkt zu betonen.
fr: **le texte en gras** est utilisé pour mettre en valeur un point important.

source: *italic text* is used to represent device names or text that is input into a GUI field.
de: *italic text* is used to represent device names or text that is input into a GUI field.*kursiver Text* wird verwendet, um den Namen eines Gerätes darzustellen oder Text, der Eingabe im Feld einer GUI ist.
fr: *le texte en italique* est utilisé pour représenter le nom d'un périphérique ou du texte entré dans un champ graphique.

source: Introduction
de: Einführung

source: Welcome to PC-BSD®!
de: Willkommen zu PC-BSD®!
fr: Bienvenue sur PC-BSD® !

source: `PC-BSD® <http://www.pcbsd.org/>`_ began in 2005 when Kris Moore presented the first beta version of a FreeBSD operating system pre-configured for desktop use. Since then, PC-BSD® has matured into a polished, feature-rich, free-of-charge, open source operating system that meets the desktop or server needs of the beginner to the advanced user alike.
de: `PC-BSD® <http://www.pcbsd.org/>`_ begann 2005, als Kris Moore die erste Beta-Version eines für die Desktop-Benutzung vorkonfigurierten FreeBSD-Betreibssytems präsentierte. Seitdem hat PC-BSD® zu einem ausgefeilten, reichhaltigen, gebührenfreien, quelloffenen Betriebssystem entwickelt, das die Bedürfnisse zum Desktop von Einsteigerinnen und Einsteigern bis zu fortgeschrittenen Benutzerinnen und Benutzern gleichermaßen trifft.
fr: `PC-BSD® <http://www.pcbsd.org/>`_ est né en 2005 quand Kris Moore présenta la première version beta d'un système d'exploitation basé sur FreeBSD pré-configuré pour une utilisation d'ordinateur de bureau. Depuis, PC-BSD® est devenu un système d'exploitation open-source, raffiné, riche en fonctionnalités et gratuit qui répond aux besoins des débutants et des utilisateurs confirmés pour une utilisation comme ordinateur de bureau ou comme serveur.

source: PC-BSD® is essentially a customized installation of FreeBSD, not a forked derivative. Since the underlying FreeBSD system has been kept intact, you have a fully functional FreeBSD system under the hood. PC-BSD® provides a graphical installer which can be used to easily install a desktop or a server version of FreeBSD, known as TrueOS®. Other differences from FreeBSD include:
de: Bei PC-BSD® handelt es sich im Wesentlichen eine angepasste Installation von FreeBSD, nicht um ein abgespaltenes Derivat. Da das zugrundeliegende FreeBSD-System intakt gehalten wurden, haben Sie ein voll funktionsfähiges FreeBSD-System unter der Haube. PC-BSD® bietet eine grafische Installation, welche zum leichten Installieren einer Desktop- oder einer Serverversion von FreeBSD, bekannt als TrueOS®, verwendet werden kann. Andere Unterschiede zu FreeBSD beinhalten:
fr: PC-BSD® est essentiellement une installation customisée de FreeBSD, et non une branche dérivée. Le système sous-jacent FreeBSD étant laissé intacte, vous avez un système FreeBSD sous le capots. PC-BSD® fournit un installeur graphique qui peut être utilisé pour installer facilement un ordinateur de bureau ou un serveur nommé TrueOS®. Les autres différences avec FreeBSD sont:

source: PC-BSD® pre-configures at least one desktop environment during a desktop installation. Installed desktop environments appear in the login menu, allowing the user to select which environment to log into.
de: PC-BSD® konfiguriert mindestens eine Arbeitsoberfläche während der Installation vor. Installierte Arbeitsoberflächen erscheinen im Anmeldemenü, was der Benutzerin oder dem Benutzer erlaubt auszuwählen in welche Oberfläche sich angemeldet wird.
fr: PC-BSD® pré-configure au moins un environnement de bureau pendant une installation d'ordinateur de bureau. Les environnements installés apparaissent dans le menu de connexion, ce qui permet à l'utilisateur de sélectionner l'environnement dans lequel il souhaite se connecter.

source: The PC-BSD® graphical installer supports additional features such as configuring ZFS and encryption during installation.
de: Die grafische Installationsprogramm von PC-BSD® unterstützt zusätzliche Funktionen wie z.B. die Konfiguration von ZFS und Verschlüsslung während der Installation.
fr: L'installateur graphique de PC-BSD® donne accès à des fonctionnalités additionnelles comme la configuration de ZFS ou le chiffrement.

source: PC-BSD® provides a graphical software management system for the desktop and a command line equivalent for the server.
de: PC-BSD® bietet ein grafisches Softwareverwaltungssystem für die Desktop- und einer Befehlszeilenversion für den Server.
fr: PC-BSD® fournit un système graphique de gestion de logiciels pour l'installation d'ordinateur de bureau et l'équivalent en ligne de commande pour l'installation du serveur.

source: PC-BSD® provides a :ref:`Control Panel` of utilities for configuring the system. The graphical versions of these utilities are available on both versions, the desktop and server.
de: PC-BSD® bietet eine :ref:`Systemsteuerung` mit Werkzeugen zur Konfiguration des Systems. Die grafische Version von diesen Werkzeugen sind für beide Versionen, die für den Desktop und die für den Server, verfügbar.
fr: PC-BSD® fournit un :ref:`Panneau de Contrôle` d'utilitaires pour configurer le système. Les versions graphiques de ces utilitaires sont disponibles sur les deux versions, ordinateur et serveur.

source: PC-BSD® comes pre-configured with a number of automatic scripts to perform tasks such as connecting digital cameras or USB memory sticks.
de: PC-BSD® kommt mit einer Reihe von automatischen Skripten, um Aufgaben wie den Anschluss von Digitalkameras oder USB-Memory-Sticks durchzuführen.
fr: PC-BSD® est pré-configuré avec de nombreux scripts automatiques pour réaliser des tâches comme connecter des appareils photos numériques ou des clés USB.

source: The PC-BSD® boot menu supports boot environments, or snapshots of the operating system, and the PC-BSD® Update Manager automatically adds a new boot environment to the boot menu before updating the operating system or software. This means that if an update fails, you can reboot into the previous version of the operating system, before the update occurred.
de: Das Boot-Menü von PC-BSD® unterstützt Boot-Umgebungen – oder auch Schnappschüsse vom Betriebssystem – und die Aktualisierungsverwaltung von PC-BSD® fügt automatisch eine neue Boot-Umgebung zum Boot-Menü hinzu bevor das Betriebssystem oder Software aktualisiert wird.
fr: Le menu de démarrage de PC-BSD® comporte des environnements de démarrages, ou des instantanés du système d'exploitation, et le gestionnaire de mise à jour de PC-BSD® ajoute automatiquement de nouveaux environnements au menu de démarrage avant de mettre à jour le système d'exploitation ou les logiciels. Cela signifie que si une mise à jour échoue, vous pouvez redémarrer dans la version précédente du système d'exploitation, avant la mise à jour.

source: PC-BSD® started off as an independent project, but since October, 2006 PC-BSD® is financially backed and supported by the enterprise-class hardware solutions provider `iXsystems <https://www.ixsystems.com/>`_.
de: PC-BSD® war zu Beginn ein eigenständiges Projekt, doch seit Oktober 2006 wird PC-BSD® vom Anbieter für professionelle Hardwarelösungen `iXsystems <https://www.ixsystems.com/>`_ unterstützt und mitfinanziert.
fr: PC-BSD® débuta en tant que projet indépendant, mais depuis octobre 2006, PC-BSD® est soutenu et supporté financièrement par le fournisseur de solutions matérielles `iXsystems <https://www.ixsystems.com/>`_.

source: Goals and Features
de: Ziele und Funktionen
fr: Objectifs et Fonctionnalités

source: PC-BSD® provides the following features:
de: PC-BSD® bietet folgende Funktionen:
fr: PC-BSD® fournit les fonctionnalités suivantes:

source: **Easy installation:** to install either a graphical desktop or command-line server version of PC-BSD®, simply insert the installation media, reboot the system to start the installer, and answer a few questions in the installation menus.
de: **Einfache Installation:** um eine Version, entweder als grafischen Desktop oder als Server mit Kommandozeile, von PC-BSD® zu installieren, einfach das Medium für die Installation einführen, das System neu booten, um das Installationsprogramm starten, und einige Fragen in den grafischen Menüs beantworten.
fr: **Installation facile:** pour installer une version de PC-BSD® soit d'ordinateur de bureau graphique soit de serveur à ligne de commande, insérer simplement le media d'installation, redémarrer le système pour lancer l'installeur, et répondez à quelques questions dans les menus d'installation.

source: **Automatically configured hardware:** video, sound, network, and other devices are automatically configured for you.
de: **Automatisch konfigurierte Hardware:** Video-, Sound-, Netzwerk- und andere Geräte sind automatisch für Sie konfiguriert.
fr: **Matériel configuré automatiquement:** vidéo, son, réseau, et autres périphériques sont automatiquement configurés pour vous.

source: **Intuitive desktop interface:** PC-BSD® comes with a choice of :ref:`Desktops` to support your day-to-day computing needs.
de: **Intuitive Schnittstelle zur Arbeitsoberfläche:** PC-BSD® kommt mit einer Auswahl an :ref:`Arbeitsoberflächen`, um Ihre tagtäglichen Bedürfnisse am Computer zu unterstützen.
fr: **Interface de bureau intuitive:** PC-BSD® comprends un choix de :ref:`bureaux` pour répondre à vos besoins informatiques de tous les jours.

source: **Easy software management:** with :ref:`AppCafe®`, installing, upgrading, and uninstalling software is safe and easy.
de: **Einfache Verwaltung der Software:** mit :ref:`AppCafe®` ist Installieren, Aktualisieren und Deinstallieren von Software sicher und einfach.
fr: **Gestion des logiciels facilitée:** avec :ref:`AppCafe®`, installer, mettre à jour et désinstaller les logiciels est simple et sans risque.

source: **Lots of software available:** in addition to its own software, PC-BSD® can install software that has been ported to FreeBSD (currently over 24,700 applications).
de: **Vielzahl von Software verfügbar:** in Ergänzung zu seiner eigenen Software, kann PC-BSD® Software installieren, die für FreeBSD portiert wurde (aktuell über 24.700 Anwendungen).
fr: **De nombreux logiciels disponibles:** en plus de ses propres logiciels, PC-BSD® peut installer les logiciels qui ont été portés sur FreeBSD (26000 applications actuellement).
