Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/introduction.po
Languages: de, fr

source: **Easy to update:** PC-BSD® provides a built-in :ref:`Update Manager` that will notify you of available updates and allow you to apply operating system security fixes, bug fixes, and system enhancements as well as upgrade to newer versions of the operating system or installed software.
de: **Einfach zu aktualisieren:** PC-BSD® bietet eine eingebaute :ref:`Aktualisierungsverwaltung`, die Sie zu verfügbare Aktualisierungen benachrichtigt und es Ihnen erlaubt Behebungen von Fehlern bei der Sicherheit des Betriebssystems, Behebung von Defekten, Erweiterungen des Systems, wie auch das Hochrüsten auf neuere Versionen des Betriebssystems oder der installierten Software anzuwenden.
fr: **Facile à mettre à jour:** PC-BSD® fournit un :ref:`Gestionnaire de mises à jour` qui vous notifie des mises à jour possibles et vous permet d'appliquer les correctifs de sécurité, de bug, les améliorations du système ainsi que les mises à niveau vers les nouvelles versions du système d'exploitation ou des logiciels installés.

source: **Virus-free:** PC-BSD® is not affected by viruses, spyware, or other malware.
de: **Virusfrei:** PC-BSD® ist nicht von Viren, Spionagesoftware oder anderer Schadsoftware befallen.
fr: **Sans virus:** PC-BSD® n'est pas affecté par les virus, les logiciels espions et autres logiciels malveillants.

source: **No defragmentation:** PC-BSD® hard drives do not need to be defragmented and do not slow down over time. PC-BSD® uses OpenZFS which is a self-healing filesystem.
de: **Keine Defragmentierung:** Festplatten bei PC-BSD® brauchen nicht defragmentiert werden und verlangsamen sich nicht über die Zeit. PC-BSD® benutzt OpenZFS, was ein selbstheilendes Dateisystem ist.
fr: **Aucune défragmentation:** avec PC-BSD®, les disques durs n'ont pas besoin d'être défragmentés et ne ralentissent pas avec le temps. PC-BSD® utilise OpenZFS qui est un système de fichiers auto-réparable.

source: **Laptop support:** provides power saving and swap space encryption and automatically switches between wired and wifi network connections.
de: **Unterstützung von Laptops:** bietet Energiesparen und die Verschlüsslung von SWAP-Speicher sowie automatisches Umschalten zwischen kabelgebundenen und drahtlosen Netzwerkverbindungen.
fr: **Support des ordinateurs portables:** PC-BSD® fournit un mécanisme de gestion de l'énergie, propose un espace swap chiffrée et bascule automatiquement entre les réseaux wifi et filaires.

source: **Secure environment:** PC-BSD® provides a pre-configured firewall and a built-in host-based Intrusion Detection System.
de: **Sichere Umgebung:** PC-BSD® bietet eine vorkonfigurierte Firewall sowie ein eingebautes, auf den Host basierendes Angrifferkennungssystem.
fr: **Environnement sécurisé:** PC-BSD® fournit un pare-feu pré-configuré et intègre un système de détection des intrusions.

source: **Easy system administration:** PC-BSD® provides a :ref:`Control Panel` containing many graphical tools for performing system administration tasks.
de: **Einfache Administration vom System:** PC-BSD® bietet ein :ref:`Systemsteuerung`, welches viele grafischen Werkzeuge zum Ausführen von administrativen Aufgaben beinhaltet.
fr: **Administration système simplifiée:** PC-BSD® fournit un :ref:`Panneau de contrôle` qui contient de nombreux outils graphiques permettant d'effectuer les tâches d'administration système.

source: **Localization:** PC-BSD® supports a number of native languages and locales.
de: **Regionalisierung:** PC-BSD® unterstützt eine Vielzahl von grundsätzlichen Sprachen und Regionales.
fr: **Localisation:** PC-BSD® supporte de nombreuses langues et paramètres régionaux.

source: **Vibrant community:** PC-BSD® has a friendly and helpful community.
de: **Lebhafte Gemeinschaft:** PC-BSD® hat eine freundliche und hilfreiche Gemeinschaft.
fr: **Une communauté vibrante:** la communauté PC-BSD® est serviable et amicale.

source: **Professional support:** professional email and phone support is available from `iXsystems <https://www.ixsystems.com/support/>`_.
de: **Professionelle Unterstützung:** professionelle Unterstützung per E-Mail und Telefon sind von `iXsystems <https://www.ixsystems.com/support/>`_ verfügbar.
fr: **Support professionnel:** un courriel professionnel ainsi qu'un support téléphonique est disponible depuis `iXsystems <https://www.ixsystems.com/support/>`_.

source: What's New in |version|
de: Was ist neu bei |version|
fr: Quoi de neuf dans la version |version|

source: The following features or enhancements were introduced for PC-BSD® |version|:
de: Die folgenden Funktionalitäten oder Erweiterungen wurden wurden bei PC-BSD® |version|:
fr: Les fonctionnalités et améliorations suivantes ont été introduites dans la version |version| de PC-BSD®:

source: Based on FreeBSD 10.3 which adds these `features <https://www.freebsd.org/releases/10.3R/relnotes.html>`_.
de: Basiert auf FreeBSD 10.3, das um `diese Funktionen <https://www.freebsd.org/releases/10.3R/relnotes.html>`_ erweitert wurde.
fr: Basé sur FreeBSD 10.3 qui ajoute ces `fonctionnalités <https://www.freebsd.org/releases/10.3R/relnotes.html>`_.

source: The initial boot menu has changed on the :file:`PC-BSD10.3-*` boot media.
de: Das Bootmenü auf den :file:`PC-BSD10.3-*` Datenträgern wurde geändert.
fr: Le menu de démarrage initial a changé sur le media de démarrage :file:`PC-BSD10.3-*`.

source: The LibreOffice and Office role packages have been removed from installation media in order to reduce their download size. These can be installed post-installation using :ref:`AppCafe®`.
de: LibreOffice und die Rolle "Büro" wurde von den Installationsmedien entfernt, um deren Downloadgröße zu verringern. Diese Pakete konnen nach der Installation über das :ref:`AppCafe®` nachinstalliert werden.
fr: Les paquets LibreOffice et Office role ont été supprimés des médias d'installation de manière à réduire leurs tailles de téléchargement. Ils peuvent être installés après l'installation en utilisant :ref:`AppCafe®`.

source: EasyPBI has been removed as it is no longer needed to add meta-data to packages.
de: EeasyPBI wurde entfernt, da es nicht länger benötigt wird um Metadaten zu Paketen hinzuzufügen.
fr: EasyPBI a été supprimé car il n'est plus nécessaire pour ajouter des méta-data aux paquets.

source: PC-BSD® for Linux Users
de: PC-BSD® für Benutzer von Linux
fr: PC-BSD® pour les utilisateurs Linux

source: PC-BSD® is based on FreeBSD, meaning that it is not a Linux distribution. If you have used Linux before, you will find that some features that you are used to have different names on a BSD system and that some commands are different. This section covers some of these differences.
de: PC-BSD® basiert auf FreeBSD, ist also keine Linux-Distribution. Wenn Sie zuvor Linux verwendet haben, werden Sie feststellen, dass einige bekannte Funktionen unter BSD Systemen einen anderen Namen haben und sich manche Kommandos unterscheiden. Dieser Abschnitt behandelt einige dieser Unterschiede.
fr: PC-BSD® est basé sur FreeBSD, signifiant que ce n'est pas une distribution Linux. Si vous avez utilisé Linux par le passé, vous trouverez que certaines fonctionnalités que vous avez utilisées ont des noms différents sur un système BSD et que certaines commandes sont différentes. Cette section couvre quelques unes de ces différences.

source: BSD and Linux use different filesystems during installation. Many Linux distros use EXT2, EXT3, EXT4, or ReiserFS, while PC-BSD® uses OpenZFS. This means that if you wish to dual-boot with Linux or access data on an external drive that has been formatted with another filesystem, you will want to do a bit of research first to see if the data will be accessible to both operating systems.
de: BSD und Linux benutzen unterschiedliche Dateisysteme während der Installation. Viele Linux-Distributionen verwenden EXT2, EXT3, EXT4 oder ReiserFS, während PC-BSD® OpenZFS nutzt. Möchten Sie ein Dualboot-System mit Linux einrichten oder externe Datenträger nutzen, die mit einem anderen Dateisystem formatiert wurden, sollten Sie sich vorab Informieren ob die Daten mit beiden Betriebssystemen zugänglich sein werden.
fr: BSD et Linux utilisent des systèmes de fichier différents durant l'installation. De nombreuses distributions Linux utilisent EXT2, EXT3, EXT4, ou ReiserFS, alors que PC-BSD® utilise OpenZFS. Cela signifie que si vous souhaitez un double démarrage avec Linux ou accéder à des données sur un disque externe qui a été formaté avec un autre système de fichier, vous devrez d'abord faire quelques recherches pour savoir si les données seront accessibles aux deux systèmes d'exploitation.

source: Table 1.3a summarizes the various filesystems commonly used by desktop systems. Most of the desktop managers available from PC-BSD® should automatically mount the following filesystems: FAT16, FAT32, EXT2, EXT3 (without journaling), EXT4 (read-only), NTFS5, NTFS6, and XFS. See the section on :ref:`Files and File Sharing` for more information about available file manager utilities.
de: Die Tabelle 1.3a fasst die verschiedenen Dateisysteme zusammen, die häufig von Desktop-Systemen eingesetzt werden. Die meisten in PC-BSD® verfügbaren Desktopoberflächen sollten die folgenden Dateisysteme automatisch einbinden: FAT16, FAT32, EXT2, EXT3 (ohne Journaling), EXT4 (read-only), NTFS5, NTFS6 und XFS. Beachten Sie den Abschnitt :ref:`Dateien und Teilen von Dateien` für weitere Informationen über die verfügbaren Werkzeuge für die Dateiverwaltung.
fr: Le tableau 1.3a regroupe différents systèmes de fichier communément utilisés par les ordinateurs de bureau. La plupart des gestionnaires de bureau disponibles sous PC-BSD® devraient monter automatiquement les systèmes de fichier suivants: FAT16, FAT32, EXT2, EXT3 (sans journalisation), EXT4 (lecture seule), NTFS5, NTFS6, et XFS. Se reporter à la section :ref:`Fichiers et Partage de Fichier` pour plus d'information sur les utilitaires de gestionnaire de fichier disponibles.

source: **Table 1.3a: Filesystem Support on PC-BSD®**
de: **Tabelle 1.3a: Dateisystemunterstützung in PC-BSD®**
fr: **Tableau 1.3a: Support des systèmes de fichier sous PC-BSD®**

source: Filesystem
de: Dateisystem
fr: Système de fichier

source: Native to
de: Nativ für
fr: Natif sur

source: Type of non-native support
de: Typ von nicht nativer Unterstützung
fr: Type de support non-natif

source: **Usage notes**
de: **Anmerkungen zur Benutzungen**
fr: **Notes d'utilisation**

source: none
de: nein
fr: Aucun

source: requires a license from Microsoft
de: benötigt eine Lizenz von Microsoft
fr: Requiert une licence Microsoft

source: r/w support loaded by default
de: Unterstützung für r/w (lesen/schreiben) wird als Voreinstellung geladen
fr: support en lecture/écriture activé par défaut

source: since EXT3 journaling is not supported, you will not be able to mount a filesystem requiring a journal replay unless you :command:`fsck` it using an external utility such as `e2fsprogs <http://e2fsprogs.sourceforge.net>`_
de: seit Journalisieren (journaling) von EXT3 nicht unterstützt ist, wird es Ihnen nicht möglich sein ein Dateisystem einzuhängen, was die Wiedergabe eines Journals benötigt, solange Sie es nicht mit :command:`fsck` behandeln indem Sie externe Dienstprogramme wie `e2fsprogs <http://e2fsprogs.sourceforge.net>`_ benutzen

source: r/o support loaded by default
de: Unterstützung für r/o (nur lesen) wird als Voreinstellung geladen
fr: Support en lecture activé par défaut

source: EXT3 journaling, extended attributes, and inodes greater than 128 bytes are not supported; EXT3 filesystems converted to EXT4 may have better performance
de: Journalisieren (journaling) von EXT3, erweiterte Attribute, und Inodes größer als 128 Bytes sind nicht unterstützt; Dateisysteme EXT3 zu EXT4 konvertiert könnten bessere Leistung haben
fr: EXT4

source: older Mac versions might work with `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_
de: ältere Versionen von Mac könnten mit `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_ funktionieren
fr: d'anciennes versions de Mac OS X peuvent éventuellement fonctionner avec `hfsexplorer <http://www.catacombae.org/hfsexplorer>`_

source: full r/w support loaded by default
de: volle Unterstützung für r/w (lesen/schreiben) wird als Voreinstellung geladen
fr: support complet en lecture/écriture activé par défaut

source: r/o support is loaded by default
de: Unterstützung für r/o (nur lesen) wird als Voreinstellung geladen
fr: support en lecture seule activé par défaut

source: check if your Linux distro provides ufsutils; r/w support on Mac; UFS Explorer can be used on Windows
de: prüfen Sie, ob Ihre Linux-Distribution ufsutils anbietet; Unterstützung r/w (lesen und schreiben) bei Mac; UFS Explorer kann bei Windows benutzt werden
fr: Vérifiez que votre distribution Linux fournit le paquet ufsutils; lecture/écriture sur Mac OS X; sur Windows vous pouvez utilisez UFS Explorer

source: changed to r/o support in Mac Lion
de: geändert auf Unterstützung r/o (nur lesen) bei Mac Lion
fr: Modifié en lecture seule depuis Mac OS X Lion

source: Linux and BSD use different naming conventions for devices. For example:
de: Linux und BSD verwenden unterschiedliche Namenskonventionen für Geräte. Zum Beispiel:
fr: Linux et BSD utilisent différentes conventions de nommage pour les périphériques. Par exemple:

source: in Linux, Ethernet interfaces begin with :file:`eth`; in BSD, interface names indicate the name of the driver. For example, an Ethernet interface may be listed as :file:`re0`, indicating that it uses the Realtek :file:`re` driver. The advantage of this convention is that you can read the **man 4** page for the driver (e.g. type :command:`man 4 re`) to see which models and features are provided by that driver.
de: bei Linux beginnen Schnittstellen für Ethernet mit :file:`eth`, bei BSD, weisen Namen für eine Schnittstelle auf den Treiber hin. Zum Beispiel könnte eine Schnittstelle für Ethernet als :file:`re0` gelistet, darauf hinweisen, dass sie den Treiber Realtek :file:`re` benutzt. Der Vorteil dieser Konvention ist, dass Sie die Seite **man 4** für den Treiber lesen können (z.B. tippen Sie :command:`man 4 re`), um zu sehen welche Modelle und Funktionalitäten bei diesem Treiber angeboten werden.
fr: Avec Linux, les interface Ethernet commencent par :file:`eth`. Avec BSD, le nom de l'interface indique le nom du pilote. Par exemple, une interface Ethernet pourrait être :file:`re0`, signifiant qu'elle utilise le pilote Realtek :file:`re`. L'avantage de cette convention est que vous pouvez lire la page de **manuel 4** pour ce pilote (tapez :command:`man 4 re`) pour voir quels modèles sont supportés et quelles fonctionnalités sont fournies par ce pilote.

source: BSD disk names differ from Linux. IDE drives begin with :file:`ad` and SCSI and USB drives begin with :file:`da`.
de: Festplattenbezeichnungen bei BSD unterscheiden sich zu Linux. IDE-Laufwerke beginnen mit :file:`ad` und SCSI- und USB-Laufwerke beginnen mit :file:`da`.
fr: Les noms des disques sous BSD diffèrent de ceux sous Linux. Les disques IDE commencent par :file:`ad` et les périphériques SCSI et USB commencent par :file:`da`.

source: Some of the features used by BSD have similar counterparts to Linux, but the name of the feature is different. Table 1.3b provides some common examples:
de: Einige der vom BSD verwendeten Funktionalitäten haben ähnliche Gegenstücke zu Linux, aber die Namen der Funktion ist unterschiedlich. Tabelle 1.3b bietet einige übliche Beispiele:
fr: Certaines fonctionnalités utilisées par BSD ont des équivalences sous Linux, mais leur nom est différent. Le tableau 1.3b en donne quelques exemples:

source: **Table 1.3b: Names for BSD and Linux Features**
de: **Table 1.3b: Namen für Funktionalitäten für BSD und Linux**
fr: **Tableau 1.3b: Noms des fonctionnalités sur BSD et Linux**

source: **Description**
de: **Beschreibung**

source: default firewall
de: voreingestellte Firewall
fr: Pare-feu par défaut

source: :file:`/etc/rc.d/` for operating system and :file:`/usr/local/etc/rc.d/` for applications
de: :file:`/etc/rc.d/` fürs Betriebssystem und :file:`/usr/local/etc/rc.d/` für Anwendungen
fr: :file:`/etc/rc.d/` pour le système d'exploitation et :file:`/usr/local/etc/rc.d/` pour les applications

source: in PC-BSD the directories containing the startup scripts do not link to runlevels as there are no runlevels; system startup scripts are separated from third-party application scripts
de: bei PC-BSD beinhalten die Verzeichnisse die Scripte zum anfänglicher Starten welche nicht zu den Runlevels verweisen, als wären da keine Runlevels; Scripte zum anfänglicher Starten des Systems sind von Scripten für Anwendungen von Dritten getrennt

source: :file:`/etc/ttys` and :file:`/etc/rc.conf`
de: :file:`/etc/ttys` und :file:`/etc/rc.conf`
fr: :file:`/etc/ttys` et :file:`/etc/rc.conf`

source: terminals are configured in *ttys* and *rc.conf* indicates which services will start at boot time
de: Terminals sind in *ttys* konfiguriert und *rc.conf* weist darauf hin, welche Dienste zur Boot-Zeit gestartet werden
fr: les terminaux sont configurés dans *ttys* et le fichier *rc.conf* indiquent quels services seront lancés au démarrage

source: If you are comfortable with the command line, you may find that some of the commands that you are used to have different names on BSD. Table 1.3c lists some common commands and what they are used for.
de: Wenn Sie sich auf der Kommandozeile wohlfühlen, könnten Sie finden, dass einige der Kommandos die Sie benutzen, bei BSD andere Namen haben. Tabelle 1.3c listet einige übliche Kommandos auf und benennt wofür sie benutzt werden.

source: **Table 1.3c: Common BSD and Linux Commands**
de: **Table 1.3c: Übliche Kommandos bei BSD und Linux**

source: Command
de: Kommando
fr: Commande

source: **Used to:**
de: **Benutzt für:**
fr: **Utilisé pour:**

source: discover what hardware was detected by the kernel
de: deckt auf welche Hardware vom Kernel entdeckt wurde
fr: savoir quel matériel a été détecté par le noyau

source: display configured devices
de: zeige konfigurierte Geräte
fr: Afficher les périphériques configurés

source: show PCI devices
de: zeige PCI-Geräte
fr: Afficher les périphériques PCI

source: show USB devices
de: zeige USB-Geräte
fr: Afficher les périphériques USB

source: list all modules loaded in the kernel
de: liste alle Module, die in den Kernel geladen sind
fr: lister tous les modules chargés dans le noyau

source: load a kernel module for the current session
de: lade ein Kernelmodul für die aktuelle Sitzung
fr: charge un module noyau pour la session courante

source: install software from the command line
de: installiere Software von der Kommandozeile
fr: installer un logiciel depuis la ligne de commande

source: display hardware memory
de: zeige Hardware-Speicher

source: display CPU model
de: zeige Modell der CPU
fr: Afficher le modèle du CPU

source: display CPU Architecture
de: zeige Architektur der CPU
fr: Afficher l'architecture du CPU

source: display number of CPUs
de: zeige die Anzahl von CPUs
fr: afficher le nombre de CPU

source: get release version information
de: bekomme die Information zur Version der Veröffentlichung

source: show device partition information
de: zeige die Information zur Partitionierung des Gerätes

source: list IDs of all processes that have one or more files open
de: liste die IDs von allen Prozessen, die eine oder mehre Dateien geöffnet haben
fr: liste les identifiants de tous les processus qui ont au moins un fichier ouvert

source: The following articles and videos provide additional information about some of the differences between BSD and Linux:
de: Die folgenden Artikel und Videos bieten zusätzliche Informationen über einige der Unterschiede zwischen BSD und Linux:
fr: Les articles et vidéos ci-dessous donnent des informations supplémentaires sur les différences entre BSD et Linux:

source: `Comparing BSD and Linux <http://www.freebsd.org/doc/en/articles/explaining-bsd/comparing-bsd-and-linux.html>`_
de: `Ein Vergleich zwischen BSD und Linux <https://www.freebsd.org/doc/de/articles/explaining-bsd/comparing-bsd-and-linux.html>`_
fr: `Comparer BSD et Linux <https://www.freebsd.org/doc/fr/articles/explaining-bsd/comparing-bsd-and-linux.html>`_

source: `FreeBSD Quickstart Guide for Linux® Users <http://www.freebsd.org/doc/en/articles/linux-users/index.html>`_
de: `FreeBSD Quickstart Guide for Linux® Users (leider bisher nur in Englisch) <http://www.freebsd.org/doc/en/articles/linux-users/index.html>`_
fr: `Guide rapide pour débuter avec FreeBSD à l'attention des utilisateurs de Linux® <https://www.freebsd.org/doc/fr/articles/linux-users/index.html>`_

source: `BSD vs Linux <http://www.over-yonder.net/~fullermd/rants/bsd4linux/01>`_
de: `BSD vs Linux (Englisch) <http://www.over-yonder.net/~fullermd/rants/bsd4linux/01>`_

source: `Why Choose FreeBSD? <http://www.freebsd.org/advocacy/whyusefreebsd.html>`_
de: `Why Choose FreeBSD? (Englisch) <http://www.freebsd.org/advocacy/whyusefreebsd.html>`_

source: `Interview: BSD for Human Beings <http://www.unixmen.com/bsd-for-human-beings-interview/>`_
de: `Interview: BSD for Human Beings (Englisch) <http://www.unixmen.com/bsd-for-human-beings-interview/>`_

source: `Video: BSD 4 Linux Users <https://www.youtube.com/watch?v=xk6ouxX51NI>`_
de: `Video: BSD 4 Linux Users (Englisch) <https://www.youtube.com/watch?v=xk6ouxX51NI>`_

source: `Why you should use a BSD style license for your Open Source Project <http://www.freebsd.org/doc/en/articles/bsdl-gpl/article.html>`_
de: `Why you should use a BSD style license for your Open Source Project (Englisch) <http://www.freebsd.org/doc/en/articles/bsdl-gpl/article.html>`_

source: `A Sysadmin's Unixersal Translator (ROSETTA STONE) <http://bhami.com/rosetta.html>`_
de: `A Sysadmin's Unixersal Translator (ROSETTA STONE) (Englisch) <http://bhami.com/rosetta.html>`_

source: The "Plugins" tab has been removed from :ref:`AppCafe®` as this functionality is being rewritten for the upcoming 11-RELEASE. In the interim, refer to :ref:`Managing Jails from the CLI` if you wish to manage jails on your PC-BSD® system.
fr: L'onglet "Modules" a été supprimé de :ref:`AppCafe®` car cette fonctionnalité a été ré-écrite pour la prochaine version 11-RELEASE. Entre temps, se référer à :ref:`Gestion des Jails à la ligne de commande` si vous souhaitez gérer des jails sur votre système PC-BSD®.

source: The "Search all available PBIs and packages" checkbox has been renamed to "Search all available software" in :menuselection:`AppCafe® --> App Search`.
fr: La case à cochée "Rechercher tous les PBI et paquets disponibles" a été renommée "Rechercher tous les logiciels disponibles" dans :menuselection:`AppCafe® --> Rechercher Appli`.

source: The "Auto-play optical disks" checkbox has been added to :menuselection:`Mount Tray --> More Options --> Change Settings`.
fr: La case à cochée "Lecture automatique du disque optique" a été ajoutée à :menuselection:`Panneau de Montage --> Plus d'Options --> Modifier Réglages`.
