Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/lumina.po
Languages: es

source: Some applications, such as web browsers, keep their own internal lists of default applications for opening particular types of files. If you set that application to use the :command:`lumina-open` or :command:`xdg-open` utilities, it will use the default applications that are set here so that there is only a single list of default applications for the system.
es: Algunas aplicaciones, como los navegadores web, mantienen su propia lista interna de aplicaciones predeterminadas para abrir tipos de archivos particulares. Si establece esa aplicación para usar las utilerías :command:`lumina-open` o :command:`xdg-open`, usará las aplicaciones predeterminadas que está establecidas aquí para que solo exista una sola lista de aplicaciones predeterminadas para el sistema.

source: Shortcuts
es: Accesos Directos

source: The "Shortcuts" tab, shown in :numref:`Figure %s: Lumina Shortcuts Configuration <lumina8a>`, is used to configure various keyboard shortcuts for system or window tasks. Most of these options relate to window and workspace management, such as moving windows between workspaces, but there are also options for changing the system audio volume or screen brightness.
es: La pestaña "Accesos Directos", mostrada en la :numref:`Figura %s: Configuración de Accesos Directos en Lumina <lumina8a>`, es usada para configurar varios accesos directos del teclado para tareas del sistema o de ventana. La mayoría de estas opciones se relacionan al manejo de ventanas y espacio de trabajo, como mover ventanas entre espacios de trabajo, pero también hay opciones para cambiar el volúmen del audio del sistema o el brillo de la pantalla.

source: To create a shortcut, click the desired entry, then "Change Shortcut", then the key combination you wish to set. Note that any entry that already has a defined shortcut showing in the "Keyboard Shortcut" column can **not** be assigned to another action. First, highlight that shortcut, click "Clear Shortcut", then "Save Changes". You can now create a new shortcut.
es: Para crear un acceso directo, presione en la entrada deseada, y luego en "Cambiar Acceso Directo", luego la combinación de teclas que quiera establecer. Note que cualquier entrada que ya tenga un acceso directo definido y que se muestre en la columna "Acceso Directo de Teclado" **no** puede ser asignada a otra acción. Primero, seleccione ese acceso directo, presione "Limpiar Acceso Directo", y "Guardar Cambios". Ahora puede crear un nuevo acceso directo.

source: Session
es: Sesión

source: The "Session" tab, shown in :numref:`Figure %s: Session General Options Tab <lumina12d>`, governs the general settings for the desktop session. These settings are usually not changed on a frequent basis.
es: La pestaña "Sesión", mostrada en la :numref:`Figura %s: Pestaña de Opciones Generales de la Sesión <lumina12d>`, gobierna las configuraciones generales para la sesión de escritorio. Estas configuraciones generalmente no se cambian frecuentemente.

source: The "General Options" tab can be used to automatically enable numlock, to play chimes when Lumina starts or exits, and to change the icon that appears in the login menu and the start menu button. It also has options to set the time format, date format, and time display format. Buttons are available to reset these options to either the system defaults or Lumina defaults.
es: La pestaña de "Opciones Generales" puede usarse para habilitar automáticamente la tecla blq num, para tocar sonidos cuando Lumina inicia o sale, y para cambiar el icono que aparece en el menú de inicio de sesión y en el botón del menú inicio. También tiene opciones para establecer el formato de la hora, formato de la fecha, y el formato de presentación de la hora. Hay botones disponibles para restablecer estas opciones ya sea a los predeterminados del sistema o a los predeterminados de Lumina.

source: The "Locale" tab is shown in :numref:`Figure %s: Session Locale Tab <lumina21a>`.
es: La pestaña "Localización" se muestra en la :numref:`Figura %s: Pestaña de Localización de la Sesión <lumina21a>`.

source: Lumina Utilities
es: Utilerías de Lumina

source: Lumina Screenshot
es: Captura de Pantalla de Lumina

source: Insight File Manager
es: Gestor de Archivos Insight

source: Lumina Open
es: Lumina Abrir

source: Lumina Search
es: Búsqueda Lumina
