Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/lumina.po
Languages: es

source: Each of the tabs at the top configures a different area of the system, with the most frequently changed options on the left side. As changes are made, the "Save Changes" button at the bottom of the window becomes active. This allows the user to setup multiple changes in any tab and apply them all at the same time.
es: Cada una de las pestañas en la parte superior configura un área diferente del sistema, con las opciones más cambiadas en el lado izquierdo. Mientras se hacen los cambios, el botón "Guardar Cambios" en la parte inferior de la ventana, se activa. Esto le permite al usuario ajustarr múltiples cambios en cualquier pestaña y aplicarlos todos al mismo tiempo.

source: If you make any changes in any of the tabs, remember to click "Save Changes" before exiting this utility in order to save them.
es: Si hace cualquier cambio en cualquiera de las pestañas, recuerde presionar "Guardar Cambios" antes de salir de esta utilería para que permanezcan.

source: The rest of this section describes the configurations that are available in each tab.
es: El resto de esta sección describe las configuraciones que están disponibles en cada pestaña.

source: Appearance
es: Apariencia

source: This tab is used to change the visual appearance and functionality of the desktop on a per-screen basis. The "Wallpaper" tab, shown in :numref:`Figure %s: Lumina Desktop Configuration <lumina3b>`, can be used to add a wallpaper ("+" button) or remove ("-" button) a wallpaper. When you click the "+" button, the drop-down menu can be used to select the file(s), a single directory, a directory and all of its subdirectories, or a solid color to use as the wallpaper. If multiple images are selected, the "Rotate Background" button can be selected as well as a specified time interval in minutes to rotate to the next image.
es: Esta pestaña es usada para cambiar la apariencia visual y funcionalidad del escritorio en una base por pantalla. La pestaña "Fonde de Escritorio", mostrada en la :numref:`Figura %s: Configuración del Escritorio de Lumina <lumina3b>`, puede usarse para añadir una imágen de fondo (botón "+") o eliminarla (botón "-"). Cuando presiona el botón "+", el menú desplegable puede usarse para seleccionar el/los archivo(s), un solo directorio, un directorio y todos sus subdirectorios, o un color sólido para usar como imágen de fondo. Si se seleccionan múltiples imágenes, el botón "Rotar Fondo" puede seleccionarse también como un intervalo de tiempo especificado en minutos para rotar a la siguiente imágen.

source: Click the "Layout" drop-down menu to change the default layout of "Automatic" to one of the following options: "Tile", "Center", "Top Left", "Top Right", "Bottom Left", or "Bottom Right".
es: Presione en el menú desplegable "Diseño" para cambiar al diseño predeterminado de "Automático" a una de las siguientes opciones: "Mosaico", "Centrado", "Superior Izquierda", "Superior Derecha", "Inferior Izquierda", o "Inferior Derecha".

source: The options that are available when you click :menuselection:`+ --> Solid Color` are shown in :numref:`Figure %s: Modifying the Wallpaper <lumina16a>`. If you select a color and click "OK", it will be added as a solid color background to the wallpaper selection drop-down menu.
es: Las opciones que están disponibles cuando presiona :menuselection:`+ --> Color Sólido` se muestran en la :numref:`Figura %s: Modificando el Fondo de Escritorio <lumina16a>`. Si selecciona un color y presiona "OK", se añadirá como un color sólido de fondo al menú desplegable de selección del fondo de escritorio.

source: The "Theme" tab, shown in :numref:`Figure %s: Modifying the Theme <lumina17b>`, can be used to change the default font, font size, theme template, color scheme, icon pack, and mouse cursors.
es: La pestaña "Tema", mostrada en la :numref:`Figura %s: Modificando el Tema <lumina17b>`, puede usarse para cambiar la fuente por defecto, tamaño de la misma, plantilla del tema, esquema de color, paquete de iconos, y cursores del ratón.

source: It is possible to create your own "Theme Template" or "Color Scheme" by clicking the "Edit" button next to those options and changing the settings as necessary. :numref:`Figure %s: Using the Theme Editor <lumina18a>` shows an example of clicking the "Edit" button with the "Lumina-default (System)" theme template selected. This action opened the "Theme Editor" and the user has clicked the color selector (dropper icon) in the upper right corner. After selecting an item in this menu, the template controlling that selection can be edited by changing the values in the theme editor box. Note that the theme templates are written as `Qt stylesheets <http://doc.qt.io/qt-5/stylesheet.html>`_, so some scripting experience may be helpful when configuring a theme. After making your changes, you can either click the "Save" button to save the theme without closing the editor, or click the "Apply" button which will both save the theme and close the theme editor.
es: Es posible crear su propia "Plantilla del Tema" o "Esquema de Color" presionando en el botón "Editar" junto a esas opciones y cambiar las configuraciones según sea necesario. La :numref:`Figura %s: Usando el Editor de Temas <lumina18a>` muestra un ejemplo de presionar el botón "Editar" con la plantilla del tema "Lumina-default (Sistema)" seleccionado. Esta acción abre el "Editor de Temas" y el usuario ha presionado el selector de color (icono del gotero) en la esquina superior derecha. Después de seleccionar un elemento en este menú, la plantilla controlando esa selección puede ser editado al cambiar los valores en la casilla del editor de temas. Note que las plantillas de temas están escritas como `Hojas de Estilo Qt <http://doc.qt.io/qt-5/stylesheet.html>`_, así que algo de experiencia en scripting podría ser de ayuda al configurar un tema. Despues de hacer sus cambios, usted puede presionar el botón "Guardar" para guardar el tema sin cerrar el editor, o presionar el botón "Aplicar" el cual guardará el tema y cerrará el editor de temas.

source: Interface
es: Interfaz

source: The "Interface" tab is used to configure the desktop right-click menu and panel. Its "Desktop" tab, shown in :numref:`Figure %s: Right-Click Menu Configuration <lumina4c>`, is used to configure which items appear in the right-click menu and which items are embedded onto the desktop.
es: La pestaña "Interfaz" se usa para configurar el menú de botón derecho del escritorio y el panel. Su pestaña "Escritorio", mostrada en la :numref:`Figura %s: Configuración del Menú de Botón Derecho <lumina4c>`, se usa para configurar qué elementos aparecerán en el menú de botón derecho y que elementos están embebidos en el escritorio.

source: To add an item to the right-click menu, click the "+" button under the "Quick-Access Menu". This will open the "Select a Plugin" screen where you can add an application, custom app, an entry for the :ref:`Insight File Manager`, a separator, a shortcut to Settings, a terminal, or a listing of currently open applications. To remove an item from the right-click menu, highlight it and click the "-" button. Use the arrow buttons to change the order of the items in the right-click menu.
es: Para añadir un elemento al menú de botón derecho, presione el botón "+" bajo el "Menú de Acceso Rápido". Esto abrirá la pantalla "Seleccione un Plugin" donde usted puede añadir una aplicación, aplicación personalizada, una entrada para el :ref:`Gestor de Archivos Insight`, un separador, un acceso directo a Configuraciones, una terminal, o una lista de aplicaciones abiertas actualmente. Para eliminar un elemento del menú de botón derecho, selecciónelo y presione el botón "-". Use los botones de flechas para cambiar el orden de los elementos en el menú de botón derecho.

source: To embed a utility onto the desktop, click the "+" button under the "Embedded Utilities" frame. The following plugins can be added as an icon on the desktop: Application Launcher (opens a menu that lists which applications can be launched), Audio Player, Calendar, Desktop Icons View, Note Pad, Sample (an example of a QtQuick/QML plugin), and System Monitor (displays CPU temperature/usage, memory usage, and disk I/O). Once you click the "Save Changes" button, any utilities you added will appear on top of the desktop. To remove an embedded utility from the desktop, highlight its entry under "Embedded Utilities", click the "-" button, and click "Save Changes". Alternately, right-click the icon for the utility and select "Remove Item" from the right-click menu.
es: Para embeber una utilería en el escritorio, presione el botón "+" bajo el marco "Utilerías Embebidas". Los siguientes plugins pueden ser añadidos como un icono en el escritorio: Lanzador de Aplicaciones (abre un menú que lista qué aplicaciones pueden lanzarse), Reproductor de Audio, Calendario, Vista de Iconos de Escritorio, Bloc de Notas, Muestra (un ejemplo de un plugin QtQuick/QML), y Monitor del Sistema (despliega el uso/temperatura del CPU, uso de memoria, y E/S de disco). Una vez que presione el botón "Guardar Cambios", cualquier utilería que haya añadido, aparecerá encima del escritorio. Para eliminar una utilería embebida del escritorio, seleccione su entrada bajo "Utilerías Embebidas", presione el botón "-", y presione en "Guardar Cambios". Alternativamente, haga clic derecho sobre el icono de la utilería y seleccione "Eliminar Elemento" desde el menú del botón derecho.

source: The following options are also available when you right-click an icon on the desktop, allowing you to customize the location and appearance of desktop icons: "Start Moving Item" (click the icon to lock it in place once you have moved it to the desired location), "Start Resizing Item" (use the mouse to increase/decrease size and click when you are finished), "Increase Desktop Icon Sizes" (increases all desktop icons, repeat as necessary), and "Decrease Desktop Icon Sizes" (decreases all desktop icons, repeat as necessary).
es: Las siguientes opciones también están disponibles cuando hace clic derecho en un icono del escritorio, permitiéndole personalizar la posición y la apariencia de los iconos del escritorio: "Mover Elemento" (presione el icono para fijarlo en su lugar una vez que lo ha movido al lugar deseado), "Dimensionar Elemento" (use el ratón para maximizar/minimizar el tamaño y presione cuando haya terminado), "Aumentar el Tamaño de los Iconos del Escritorio" (aumenta todos los iconos del escritorio, repita tanto como sea necesario), y "Reduzca el Tamaño de los Iconos del Escritorio" (reduce todos los iconos del escritorio, repita tanto como sea necesario).

source: The "Display Desktop Folder Contents" option is used to display each item stored in :file:`~/Desktop` as an icon on the desktop. By default, this option is selected as its box is black. If you de-select this option and click "Save Changes", the icons for the contents of :file:`~/Desktop` will be removed from the desktop.
es: La opción "Mostrar Contenidos de la Carpeta Escritorio" es usada para desplegar cada elemento guardado en :file:`~/Escritorio` como un icono en el escritorio. Por defecto, esta opción es seleccionado ya que su casilla es negra. Si desmarca esta opción y presiona "Guardar Cambios", los iconos para los contenidos de :file:`~/Escritorio` serán eliminados del escritorio.

source: To configure the panel, click the "Panels" tab which will open the screen shown in :numref:`Figure %s: Panels Tab <lumina5d>`.
es: Para configurar el panel. presione la pestaña "Paneles", que abrirá la pantalla mostrada en la :numref:`Figura %s: Pestaña Paneles <lumina5d>`.

source: This screen can be used to customize the location, alignment, size, theme, and plugins for an existing panel. The "+" and "-" icons towards the top, next to "Panel 1" can be used to add or remove additional panels. Panels must be aligned along a screen edge, opposite screen edges in the case of two panels, and may have any width, color, or transparency.
es: Esta pantalla puede usarse para personalizar la localización, alineación, tamaño, tema, y plugins para un panel existente. Los iconos de "+" y "-" hacia la parte superior, junto a "Panel 1" pueden usarse para añadir o eliminar paneles adicionales. Los paneles deben estar alineados a lo largo de un borde de la pantalla, en los bordes opuestos de la pantalla en el caso de dos paneles, y pueden tener cualquier ancho, color, o transparencia.

source: If you add additional panels, a frame, similar to "Panel 1", will be created for each panel, and will be labeled "Panel 2", "Panel 3", and so on. This allows you to configure each panel separately. The configuration tabs available for a panel are described below. Be sure to select the tab in the panel that you wish to customize.
es: Si añade paneles adicionales, un marco, similar al "Panel 1", se creará para cada panel, y se llamará "Panel 2", "Panel 3", y así sucesivamente. Esto le permite configurar cada panel por separado. Las pestañas de configuración disponibles para el panel se describen a continuación. Asegúrese de seleccionar la pestaña en el panel que quiera personalizar.

source: The "Location" tab (4 arrow icon) contains the following items:
es: La pestaña "Localización" (icono de 4 flechas) contiene los siguientes elementos:

source: **Edge:** this drop-down menu can be used to set the location of the panel which can be "Top", "Bottom", "Left", or "Right".
es: **Borde:** este menú desplegable puede usarse para establecer la localización del panel, la cual puede ser "Arriba", "Abajo", "Izquierda", o "Derecha".

source: **Alignment:** this drop-down menu can be used to center the panel on the edge or pin it to one of the corners.
es: **Alineación:** este menú desplegable puede usarse para centrar el panel en el borde o pegarlo en una de las esquinas.

source: **Size:** can be used to specify the panel width in pixels and the panel length.
es: **Tamaño:** puede usarse para especificar el ancho del panel en pixeles y el largo del panel.

source: The "Appearance" tab (monitor icon) is shown in :numref:`Figure %s: Panels Appearance Tab <lumina19b>`.
es: La pestaña "Apariencia" (icono del monitor) se muestra en la :numref:`Figura %s: Pestaña de Apariencia de los Paneles <lumina19b>`.

source: If you would like the panel to be hidden unless the mouse is hovered over it, check the "Auto-hide Panel" box. The "Custom Color" option can be used to fine-tune the panel color. Click its box, then the paint icon to select the panel color.
es: Si quiere que el panel esté escondido a menos que el ratón pase sobre el, seleccione la casilla "Ocultar Panel Automáticamente". La opción de "Color Personalizado" puede usarse para afinar el color del panel. Presione su caja, y luego el icono de pintura para seleccionar el color del panel.

source: The "Plugins" tab (puzzle icon) is shown in :numref:`Figure %s: Panels Plugins Tab <lumina20b>`.
es: La pestaña "Plugins" (icono de rompecabezas) se muestra en la :numref:`Figura %s: Pestaña de Plugins de los Paneles <lumina20b>`.

source: To add a plugin as an icon to the panel, click the "+" button below the listed plugins and select a plugin from the list that appears. The available plugins include:
es: Para añadir un plugin como un icono en el panel, presione el botón "+" debajo de los plugins listados y seleccione un plugin de la lista que aparece. Los plugins disponibles incluyen:

source: **Application Launcher:** when you select this plugin, it will prompt you to select the application to launch. This will add a shortcut for launching the selected application to the panel.
es: **Lanzador de Aplicaciones:** cuando selecciona este plugin, le pedirá que seleccione la aplicación a lanzar. Esto añadirá un acceso directo en el panel para lanzar la aplicación seleccionada.

source: **Application Menu:** adds an application menu that contains a shortcut to your home directory, a shortcut to the operating system's graphical software management utility (if there is one), a shortcut to the operating system's Control Panel (if it provides one), and a list of installed software sorted by categories.
es: **Menú de Aplicaciones:** añade un menú de aplicaciones que contiene un acceso directo a su directorio personal, un acceso directo a la utilería gráfica de gestión de software del sistema operativo (si es que la hay), un acceso directo al Panel de Control del sistema operativo (si se proporciona uno), y una lista de software instalado, ordenado por categorías.

source: **Battery Monitor:** hover over this icon to view the current charge status of the battery. When the charge reaches 15% or below, the low battery icon will flash intermittently and will change to a low battery icon when there is less than 5% charge left.
es: **Monitor de la Batería:** pase el ratón sobre este icono para ver el estado actual de carga de la batería. Cuando la carga llega a 15% o menos, el icono de batería baja comenzará a parpadear intermitentemente y cambiará a un icono de batería baja cuando quede menos del 5% de carga.

source: **Desktop Bar:** adds a "star" button for automatically displaying entries for anything in the :file:`~/Desktop` folder and alternately launching the selected entry.
es: **Barra del Escritorio:** añade un botón de "estrella" para desplegar automáticamente entradas para todo en la carpeta :file:`~/Escritorio` y alternativamente lanzar la entrada seleccionada.

source: **Line:** adds a separator line to the panel.
es: **Linea:** añade una línea para separar en el panel.

source: **Show Desktop:** this button will hide all open windows so that only the desktop is visible. This is useful for touch screens or small devices.
es: **Mostrar Escritorio:** este botón ocultará todas las ventanas abiertas para que solo el escritorio sea visible. Esto es útil para pantallas táctiles o dispositivos pequeños.

source: **Spacer:** adds a blank area to the panel.
es: **Espaciador:** añade un área en blanco al panel.

source: **Start Menu:** adds a classic start menu as seen on other operating systems.
es: **Menú de Inicio:** añade el clásico menú de inicio como se muestra en otros sistemas operativos.

source: **System Dashboard:** used to view/modify audio volume, screen brightness, battery life, and virtual desktops.
es: **Dashboard del Sistema:** usado para ver/modificar el volúmen de audio, brillo de pantalla, vida de la batería, y los escritorios virtuales.

source: **System Tray:** provides a display area for dockable applications.
es: **Bandeja del Sistema:** proporciona un área para desplegar aplicaciones empotrables.

source: **Task Manager (No Groups):** ensures that every window gets its own button. This uses a lot more space on the panel since it needs to put part of the window title on each button.
es: **Gestor de Tareas (No Grupos):** se asegura de que cada ventana obtiene su propio botón. Esto usa más espacio en el panel ya que necesita poner parte del título de la ventana en cada botón.

source: **Task Manager:** is added by default. Its behavior is to group windows by application.
es: **Gestor de Tareas:** se añade por defecto. Su comportamiento es agrupar ventanas por aplicación.

source: **Time/Date:** displays the current time and date.
es: **Hora/Fecha:** muestra la hora y fecha actuales.

source: **User Button:** main button for accessing applications, directories, settings, and log out.
es: **Botón de Usuario:** botón principal para accesar aplicaciones, directorios, configuraciones, y salir de la sesión.

source: **Workspace Switcher:** used to switch between virtual desktops.
es: **Alternar Espacios de Trabajo:** usado para cambiar entre escritorios virtuales.

source: To remove a plugin, highlight it and click the "-" button below the listed plugins. The arrow buttons can be used to move the location of the plugin on the panel. The top of an ordered list corresponds to either the top of a vertical panel or the left side of a horizontal panel.
es: Para eliminar un plugin, selecciónelo y presione el botón "-" bajo la lista de plugins. Los botones de flechas pueden usarse para mover el lugar del plugin en el panel. El inicio de una lista ordenada corresponde ya sea al inicio de un panel vertical o al lado izquierdo de un panel horizontal.

source: Applications
es: Aplicaciones

source: The "Applications" tab, shown in :numref:`Figure %s: Lumina Applications Configuration <lumina6b>`, is used to configure which applications start when you login to Lumina as well as the default applications and file types.
es: La pestaña "Aplicaciones", mostrada en la :numref:`Figura %s: Configuración de las Aplicaciones de Lumina <lumina6b>`, se usa para configurar cuáles aplicaciones se iniciarán cuando inicie sesión en Lumina, así como las aplicaciones predeterminadas y los tipos de archivo.

source: To prevent an application from starting automatically, uncheck its box.
es: Para prevenir que una aplicación se inicie automáticamente, desmarque su casilla.

source: To add an application to the auto-start configuration , click "Application" to select the application's name from a drop-down menu or click "Binary" or "File" to browse to the location of the application or file to open. If you select a file name, Lumina will automatically open it in an application that is capable of reading the file type.
es: Para añadir una aplicación a la configuración de auto inicio, presione "Aplicación" para seleccionar el nombre de la aplicación desde un menú desplegable o presione "Binario" o "Archivo" para buscar la localización de la aplicación o archivo a abrir. Si selecciona un nombre de archivo, Lumina automáticamente lo abrirá en una aplicación capaz de leer el tipo de archivo.

source: To configure the default applications and file types, click the "File Defaults" tab. In the screen shown in :numref:`Figure %s: Lumina Defaults Configuration <lumina7c>`, you can configure the default web browser, email client, file manager, and virtual terminal.
es: Para configurar las aplicaciones predeterminadas y tipos de archivo, presione la pestaña "Predeterminados para Archivos". En la pantalla mostrada en la :numref:`Figura %s: Configuraciones Predeterminadas de Lumina <lumina7c>`, puede configurar el navegador web predeterminado, cliente de correo, gestor de archivos, y terminal virtual.

source: Click the gear icon or the name of the existing application to select the desired application from a menu of available applications. If you wish to go back to the default application, click the current application's name, then click "Restore Defaults".
es: Presione el icono del engrane o el nombre de la aplicación existente para seleccionar la aplicación deseada desde un menú de aplicaciones disponibles. Si quiere regresar a la aplicación predeterminada, presione el nombre de la aplicación actual, y presione "Restaurar Predeterminados".

source: This screen can also be used to set the default application for several categories of file types. To add an application, select the file type and either click "Set App", which will open a drop-down menu of common applications, or "Set Binary", which will open a file browser so that you can browse to the path of the application.
es: Esta pantalla también puede ser usada para establecer la aplicación predeterminadas para varias categorías de tipos de archivos. Para añadir una aplicación, seleccione el tipo de archivo y ya sea que presione "Establecer Aplicación", lo que abrirá un menú desplegable de aplicaciones comunes, o en "Establecer Binario", lo que abrirá un navegador de archivos para que pueda buscar la ruta a la aplicación.
