Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/lumina.po
Languages: es

source: The Lumina Desktop
es: El Escritorio Lumina

source: Beginning with |version|, the PC-BSD® installer installs the Lumina Desktop Environment (Lumina for short). Additional window managers can be installed using :ref:`AppCafe®`. This chapter describes the Lumina Configuration utility and the various utilities which are built into Lumina. For instructions on how to install Lumina on other operating systems or how to contribute to the Lumina Project, refer to the documentation at the `Lumina website <http://www.lumina-desktop.org>`_.
es: Comenzando con |version|, el instalador de PC-BSD® instala el Entorno de Escritorio Lumina (Lumina para abreviar). Gestores de ventanas adicionales pueden instalarse usando :ref:`AppCafe®`. Este capitulo describe la utilería de Configuración de Lumina y las diversas utilerías que están construidas dentro de Lumina. Para instrucciones sobre como instalar Lumina en otros sistemas operativos o cómo contribuir con el Proyecto Lumina, refiérase a la documentación en el `sitio web de Lumina <http://www.lumina-desktop.org>`_.

source: Lumina is a lightweight, XDG-compliant, BSD-licensed desktop environment that focuses specifically on streamlining the ability to get work done while minimizing system overhead. It is specifically designed for PC-BSD® and FreeBSD, but has also been ported to many other BSD and Linux operating systems. It is based on the Qt graphical toolkit and the Fluxbox window manager, and uses a small number of X utilities for various tasks, such as :command:`numlockx` and :command:`xscreensaver`.
es: Lumina es un entorno ligero, compatible con XDG, y de licencia BSD que se enfoca específicamente en mejorar la habilidad de dejar el trabajo hecho, a la vez que minimiza la sobrecarga en el sistema. Está diseñado específicamente para PC-BSD® y FreeBSD, pero también ha sido portado a muchos otros sistemas operativos BSD y Linux. Esta basado en el toolkit gráfico QT y el gestor de ventanas Fluxbox, y usa un pequeño conjunto de utilidades de X tales como :command:`numlockx` y :command:`xscreensaver` para llevar a cabo varias tareas.

source: Lumina's features include:
es: Las características de Lumina incluyen:

source: Very little system overhead.
es: Mínima sobrecarga del sistema.

source: Does not require any of desktop implementation frameworks such as DBUS, policykit, consolekit, systemd, or HALD.
es: No requiere ninguno de los frameworks de implementación de escritorios como DBUS, policykit, consolekit, systemd, o HALD.

source: Does not come bundled with any applications such as web browsers, email clients, multimedia software, or office suites. Instead, it provides utilities for configuring the desktop environment.
es: No viene empaquetado con ninguna aplicación como navegadores web, clientes de correo, software multimedia, o suites de oficina. En su lugar, proporciona utilerías para configurar el entorno de escritorio.

source: Uses a simple, `text-based configuration file for setting system-wide defaults <https://github.com/pcbsd/lumina/blob/master/lumina-desktop/defaults/luminaDesktop.conf>`_. This allows Lumina distributors to easily pre-set the Lumina defaults and interface for their distribution.
es: Usa un simple, `archivo de configuración basado en texto para establecer valores predeterminados a nivel del sistema <https://github.com/pcbsd/lumina/blob/master/lumina-desktop/defaults/luminaDesktop.conf>`_. Esto le permite a los distribuidores de Lumina, preconfigurar fácilmente los valores predeterminados y la iterface de Lumina para su distribución.

source: Provides a plugin-based interface design. This allows the user to make the desktop as light or heavy as desired by choosing which plugins to have running on their desktop and panels. This plugin-based system is similar to Android or other modern operating systems.
es: Proporciona un diseño de interfaz basado en plugins. Esto le permite al usuario hacer el escritorio tan ligero o pesado como lo desee, al elegir qué plugins estarán corriendo en su escritorio y paneles. Este sistema basado en plugins es similar a Android u otros sistemas operativos modernos.

source: Single, easy-to-use :ref:`Lumina Configuration` utility controls all the different configuration options for the desktop in one location.
es: Sencilla, fácil de usar, la utilería de :ref:`Configuración de Lumina` controla todas las diferentes opciones de configuración para el escritorio en un solo lugar.

source: Intelligent "favorites" system for creating quick shortcuts to applications, files, and directories.
es: Sistema inteligente de "favoritos" para crear accesos rápidos a aplicaciones, archivos, y directorios.

source: ZFS file restore functionality through the :ref:`Insight File Manager`.
es: Funcionalidad ZFS para restaurar archivos a través del :ref:`Gestor de Archivos Insight`.

source: Simple access to operating system-specific functionality such as screen brightness, audio volume, and battery status.
es: Acceso simple para funcionalidades específicas del sistema como brillo de pantalla, volúmen del audio, y estado de la batería.

source: Multi-monitor support includes the :ref:`Lumina Xconfig` graphical utility for adding or removing monitors from the Lumina session.
es: El soporte multi monitor incluye la utilería gráfica :ref:`Lumina Xconfig` para añadir o remover monitores de la sesión de Lumina.

source: Simple system controls through the system menu for configuring audio volume, screen brightness, battery status/notifications, and workspace switching.
es: Controles simples del sistema a través del menú de sistema para configurar el volúmen del audio, brillo de pantalla, estado/notificaciones de la batería, y cambio de espacios de trabajo.

source: Total system search capabilities through :ref:`Lumina Search`, without a daemon eating memory in the background.
es: Capacidades de búsqueda total en el sistema mediante :ref:`Búsqueda de Lumina`, sin un demonio consumiendo la memoria en segundo plano.

source: Screenshot functionality through :ref:`Lumina Screenshot` which is also tied to the “Print Screen” key by default.
es: Funcionalidad de captura de pantalla mediante :ref:`Captura de Pantalla de Lumina` el cual también está vinculado a la tecla “Impr Pant” por defecto.

source: Start Menu
es: Menú de Inicio

source: :numref:`Figure %s: Lumina Desktop <lumina1c>` shows a screenshot of Lumina on a PC-BSD® system. The user has clicked the "fireball" icon in order to open the start menu.
es: La :numref:`Figura %s: Escritorio Lumina <lumina1c>` muestra una captura de pantalla de Lumina en un sistema PC-BSD®. El usuario a presionado el icono de "bola de fuego" para abrir el menú de inicio.

source: The start menu provides quick access for user interaction with the system. The top frame indicates which user is logged in. Hover over the battery icon to display the current status of the battery, if your system has one, and the estimated time remaining if that battery is discharging.
es: El menú de inicio proporciona acceso rápido para la interacción del usuario con el sistema. El marco superior indica qué usuario está conectado. Pase el ratón sobre el icono de la batería para mostrar el estado actual de la batería, si su sistema tiene una, y el tiempo restante estimado si la batería se está descargando.

source: The next frame contains a list of "Favorites". Click an entry to launch that application. Right-click an entry to "Remove from Favorites" or to "Add to Quicklaunch". In Lumina, "Favorites" appear in this section of the start menu and "QuickLaunch" adds a button for the application to the panel that is next to the start menu button.
es: El siguiente marco contiene una lista de "Favoritos". Presione en una entrada para lanzar la aplicación. De botón derecho en una entrada para "Eliminar de los Favoritos" o para "Añadir a Ejecución Rápida". En Lumina, "Favoritos" aparece en esta sección del menú inicio y "Ejecución Rápida" añade un botón para la aplicación al panel que está enseguida al botón del menú inicio.

source: The remainder of the start menu contains the following:
es: El resto del menú inicio contiene lo siguiente:

source: **Browse Files:** used to browse for files and directories using the :ref:`Insight File Manager`. One of the actions available in this file manager is the ability to add a file or directory to the list of Favorites. Simply select the file or directory and click the star icon in Insight.
es: **Buscar Archivos:** usado para buscar archivos y directorios usando el :ref:`Gestor de Archivos Insight`. Una de las acciones disponibles en este gestor de archivos, es la habilidad de añadir un archivo o directorio a la lista de Favoritos. Simplemente seleccione el archivo o directorio y presione el icono de la estrella en Insight.

source: **Browse Applications:** click this entry to browse all the applications currently registered on the system. Applications are listed alphabetically by category and the "Show Categories" button has three modes. Click "Show Categories" to toggle between showing just the category names (black box icon), just the contents of the categories (white box icon), or the categories and their contents (1/2 black 1/2 white icon). Click an application's name to start that application. If you right-click an application's name, you can "Pin to Desktop", "Add to Favorites", or "Add to Quicklaunch". If you are running PC-BSD® or another operating system that has a pre-defined application store, click "Manage Applications" at the top of the list of applications in order to open that application store. For example, on a PC-BSD® system, "Manage Applications" opens AppCafe®. Click the "Back" button to return to the start menu.
es: **Buscar Aplicaciones:** presione en esta entrada para buscar todas las aplicaciones actualmente registradas en el sistema. Las aplicaciones están listadas alfabéticamente por categoría y el botón "Mostrar Categorías" tiene tres modos. Presione "Mostrar Categorías" para cambiar entre mostrar solo los nombres de las categorías (icono de la caja blanca), o las categorías y sus contenidos (icono 1/2 negro 1/2 blanco). Presione en el nombre de una aplicación para iniciar la aplicación. Si da botón derecho en el nombre de una aplicación, usted puede "Pegarla al Escritorio", "Añadir a Favoritos", o "Añadir a Ejecución Rápida". Si está corriendo PC-BSD® u otro sistema operativo que tenga una tienda de aplicaciones predefinida, presione en "Gestionar Aplicaciones" en la parte superior de la lista de aplicaciones para abrir esa tienda de aplicaciones. Por ejemplo, en un sistema PC-BSD®, "Gestionar Aplicaciones" abre AppCafe®. Presione el botón "Atrás" para regresar al menú de inicio.

source: **Control Panel:** if you are on PC-BSD®, or an operating system which provides a control panel, click this entry to open that operating system's control panel.
es: **Panel de Control:** si está en PC-BSD®, o en un sistema operativo que proporciona un panel de control, presione esta entrada para abrir el panel de control de ese sistema operativo.

source: **Preferences:** click this entry to access the following:
es: **Preferencis:** presione en esta entrada para acceder a lo siguiente:

source: **Configure Desktop:** click this entry to open the :ref:`Lumina Configuration` utility.
es: **Configurar Escritorio:** presione en esta entrada para abrir la utilería de :ref:`Configuración de Lumina`

source: **Lumina Desktop Information:** click the "?" icon to determine the installed version of Lumina.
es: **Información del Escritorio Lumina:** presione el icono de "?" para determinar la versión instalada de Lumina.

source: **System Volume:** use your mouse to move the volume control slider to change the system audio volume from 0% to 100%. Click the sound icon on the left to mute or unmute the speaker. If the operating system provides a mixer utility, click the speaker icon on the right to launch that mixer utility for advanced control of the audio system.
es: **Volúmen del Sistema:** use su ratón para mover el botón deslizable del control de volúmen para cambiar el volúmen del audio del sistema desde 0% a 100%. Presione el icono de sonido a la izquierda para silenciar o abrir la bocina. Si el sistema operativo proporciona una utilería de mezclador, presione el icono de la bocina a la derecha para lanzar esa utilería de mezclador para un control avanzado del sistema de audio.

source: **Screen Brightness:** use your mouse to move the brightness control slider from 10% to 100%.
es: **Brillo de Pantalla:** use su ratón para mover el botón deslizable del control del brillo desde 10% hasta 100%.

source: **Workspace:** the number of available virtual workspaces are listed. Click the right or left arrow to switch between workspaces.
es: **Espacio de Trabajo:** el número de espacios de trabajo virtuales disponibles está listado. Presione la flecha derecha o izquierda para cambiar entre espacios de trabajo.

source: **Locale:** this will only appear if the lumina-i18n package is installed. The current locale will be displayed as the title of the drop-down menu. Click the drop-down menu to select another locale for this session. Refer to :ref:`Session` for more information on fine-tuning the locale settings.
es: **Localización:** esto solo aparecerá si el paquete lumina-i18n está instalado. La localización actual se desplegará como el título del menú desplegable. Presione el menú desplegable para seleccionar otra localización para esta sesión. Refiérase a :ref:`Sesión` para más información sobre como ajustar las configuraciones de localización.

source: **Back:** click to return to the start menu.
es: **Atrás:** presione para regresar al menú de inicio.

source: **Leave:** click this entry in order to "Suspend System" (if the operating system supports it, press the system's power button to login and resume operation) "Restart System" (if the user has permission), "Power Off system" (if the user has permission), "Sign Out User", or to go "Back" to the system menu. Alternately, click the "lock" icon next to "Leave" to lock the system and return it to a login prompt.
es: **Salir:** presione esta entrada para "Suspender el Sistema" (si el sistema operativo lo soporta, presione el botón de encendido del sistema para inicar sesión o salir de la sesión) "Reiniciar Sistema" (si el usuario tiene permisos), "Apagar el Sistema" (si el usuario tiene permisos), "Desloguear Usuario", o para ir "Atrás" al menú del sistema. Alternativamente, presione el icono del "candado" junto a "Salir" para bloquear el sistema y regresarlo a la pantalla de acceso.

source: On a PC-BSD system which is in the middle of applying updates, the shutdown and restart options will be disabled until the updates are complete and a note will indicate that updates are in progress.
es: En un sistema PC-BSD que está en el proceso de aplicar actualizaciones, las opciones de apagado y reinicio estarán deshabilitadas hasta que las actualizaciones sean completadas y una nota le indicará que las actualizaciones están en progreso.

source: Panel and System Tray
es: Panel y Bandeja del Sistema

source: By default, Lumina provides a panel at the bottom of the screen with a system tray at the far right of the panel. This section describes the default layout. For instructions on how to configure the panel to suit your needs, refer to the "Panels" tab :ref:`Interface` section.
es: Por defecto, Lumina proporciona un panel en la parte inferior de la pantalla con una bandeja del sistema en el extremo derecho del panel. Esta sección describe el diseño predeterminado. Para instrucciones sobre cómo configurar el panel para ajustarse a sus necesidades, refiérase a la pestaña "Paneles" sección :ref:`Interface`.

source: As you open windows or applications, a button will be added to the section of the panel near the system menu. If the application provides an icon, the button will appear as that icon and if you mouse over it, the tooltip will show the name of the application. If you have multiple copies of an application running, it will combine all those entries into a single button and list the number of windows after the icon. If you click on a button, it will automatically make that window active and if you click it again, it will automatically minimize it. If there are multiple windows, you can select the particular window you want to activate from a drop-down menu.
es: Mientras abre ventanas o aplicaciones, un botón será añadido a la sección del panel cercano al menú sistema. Si la aplicación proporciona un icono, el botón aparecerá como ese icono y si pase el puntero del ratón sobre el, un mensaje mostrará el nombre de la aplicación. Si tiene múltiples copias de una aplicación corriendo, combinará todas esas entradas en un solo botón y listará el número de ventanas después del icono. Si presiona en un botón, automáticamente convertirá esa ventana en activa y si vuelve a presionar de nuevo, automáticamente la minimizará. Si hay múltiples ventanas, puede seleccionar la ventana en particular que quiera activar desde el menú desplegable.

source: If you right-click the title of an open window, a menu of options will appear so that you can shade, stick, maximize, iconify, raise, lower, set the window title, send the window to a workspace, layer/dock the window, set the window's transparency, remember a specified setting, or close the window.
es: Si presiona el botón derecho en el título de una ventana abierta, un menú de opciones aparecerá para que usted pueda sombrearla, pegarla, maximizarla, iconificarla, levantarla, bajarla, establecer el título de la ventana, mandar la ventana a un espacio de trabajo, poner la ventana en un dock o capa, establecer la transparencia de la ventana, recordar una configuración específica, o cerrar la ventana.

source: The system tray is located in the right portion of the panel. Any applications that register a tray icon will appear in this area. For example, on a PC-BSD system, icons will appear for Life Preserver, Mount Tray, and Update Manager. Click or right-click an icon to interact with that application directly. The current system time shown by the clock is in the default format for the current locale. If you click the clock icon and then click "Time Zone", a menu will open where you can select to either "Use System Time" or click a country name in order to select a city to change to that city's time zone.
es: La bandeja del sistema está localizada en la porción derecha del panel. Cualquier aplicación que registre, un icono de bandeja aparecerá en esta área. Por ejemplo, en un sistema PC-BSD, aparecerán iconos para Life Preserver, Bandeja de Montaje, y el Administrador de Actualizaciones. Presione o haga botón derecho en el icono para interactuar con esa aplicación directamente. La hora actual del sistema mostrada por el reloj está en el formato predeterminado para la localización actual. Si presiona el icono del reloj y presiona en "Zona Horaria", un menú se abrirá y podrá seleccionar ya sea "Usar la Hora del Sistema" o presionar un nombre de un país para seleccionar una ciudad y cambiar a la zona horaria de ese lugar.

source: Right-Click Menu
es: Menú del Botón Derecho

source: If you right-click the desktop, a menu of quick shortcuts will appear and the title of the menu will indicate the name of the current workspace. This section describes the default menu items. For instructions on how to configure the right-click panel to suit your needs, refer to the "Desktop" tab :ref:`Interface` section.
es: Si hace botón derecho en el escritorio, un menú de accesos rápidos aparecerá y el título del menú indicará el nombre del espacio de trabajo actual. Esta sección describe los elementos predeterminados del menú. Para instrucciones sobre cómo configurar el panel del botón derecho para ajustarse a sus necesidades, refiérase a la pestaña "Escritorio" de la sección :ref:`Interface`.

source: By default, the right-click menu contains the following items:
es: Por defecto, el menú del botón derecho contiene los siguientes elementos:

source: **Terminal:** used to launch a system terminal. The default is :command:`xterm`, but this can be customized.
es: **Terminal:** usado para lanzar una terminal del sistema. El predeterminado es :command:`xterm`, pero esto puede personalizarse.

source: **Browse Files:** launches the default, and recommended, file manager, the :ref:`Insight File Manager`.
es: **Buscar archivos:** lanza el gestor de archivos predeterminado, y recomendado, el :ref:`Gestor de Archivos Insight`.

source: **Applications:** provides shortcuts to the operating system's graphical software management utility (if available), the control panel (if the operating system provides one), and the applications currently registered on the system, arranged by system category.
es: **Aplicaciones:** proporciona accesos directos a la utilería gráfica de gestión de software del sistema operativo (si está disponible), el panel de control (si el sistema operativo proporciona uno), y las aplicaciones actualmente registradas en el sistema, ordenadas por categoría del sistema.

source: **Preferences:** contains shortcuts to the screensaver preferences, :ref:`Lumina Configuration` utility, display configuration (:ref:`Lumina Xconfig`), the operating system's control panel, and for determining the version of Lumina.
es: **Preferencias:** contiene accesos a las preferencias del protector de pantalla, a la utilería de :ref:`Configuración de Lumina`, desplegar configuración (:ref:`Lumina Xconfig`), al panel de control del sistema operativo, y para determinar la versión de Lumina.

source: **Leave:** opens the system log out window, with options to log out of the desktop session, restart the system (if the user has permission), shutdown the system (if the user has permission), cancel the log out window, lock the system, or suspend the system (if the operating system supports suspend mode).
es: **Salir:** abre la ventana de salida del sistema, con opciones para salir de la sesión del escritorio, reiniciar el sistema (si el usuario tiene permisos), apagar el sistema (si el usuario tiene permisos), cancelar la pantalla de salida, bloquear el sistema, o suspender el sistema (si el sistema operativo soporta el modo de suspensión).

source: Lumina Configuration
es: Configuración de Lumina

source: The Lumina Configuration utility, shown in :numref:`Figure %s: Lumina Desktop Configuration <lumina3b>`, can be used to configure every aspect of the desktop and is the recommended way to make changes. To launch this utility, click the start menu then :menuselection:`Preferences --> Configure Desktop`, right-click the desktop and click :menuselection:`Preferences --> Desktop`, or type :command:`lumina-config` from an xterm.
es: La utilería de Configuración de Lumina, mostrada en la :numref:`Figura %s: Configuración del Escritorio de Lumina <lumina3b>`, puede usarse para configurar cada aspecto del escritorio y es la forma recomendada de realizar cambios. Para lanzar esta utilería, presione el menú inicio, después :menuselection:`Preferencias --> Configurar Escritorio`, de botón derecho en el escritorio y presione :menuselection:`Preferencias --> Escritorio`, o ingrese :command:`lumina-config` desde una xterm.
