Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/support.po
Languages: es

source: Supporting PC-BSD®
es: Soporte para PC-BSD®

source: PC-BSD® is a community project which relies on involvement from its users and supporters. This section lists some ideas for becoming involved.
es: PC-BSD® es un proyecto comunitario que se basa en la participación de sus usuarios y patrocinadores. Esta sección lista algunas ideas para involucrarse.

source: Become a Beta Tester
es: Conviértase en Tester de Versiones Beta

source: If you like playing around with operating systems and have a bit of spare time, one of the most effective ways you can assist the PC-BSD® community is by reporting problems you encounter while using PC-BSD®.
es: Si le gusta jugar con los sistemas operativos y tiene un poco de tiempo libre, una de las maneras más efectivas en la que puede ayudar a la comunidad de PC-BSD® es informando de los errores que encuentre mientras utiliza PC-BSD®.

source: If you have a spare system or virtual machine, you can also download and try out the latest release candidate snapshots. These versions are still in testing and have not been officially released yet. Having as many people as possible using PC-BSD® on many different hardware configurations assists the Project in finding and fixing bugs. This makes using PC-BSD® better for everyone. Subscribing to the `PC-BSD® blog <https://blog.pcbsd.org/>`_ is a good way to keep up-to-date on the availability of testing snapshots and any major bugs that affect users.
es: Si tiene un sistema libre o una máquina virtual, puede también descargar y probar la imagen candidata más reciente. Estas versiones están todavía en pruebas y aún no se ha liberado oficialmente. Tener a tantas personas como sea posible utilizando PC-BSD® en muchas configuraciones diferentes de hardware ayuda al proyecto a encontrar y arreglar errores. Esto hace que usar PC-BSD® sea mejor para todos. Suscribirse al `blog de PC-BSD® <https://blog.pcbsd.org/>`_ es una buena manera de mantenerse informado sobre las últimas imágenes disponibles y sobre cualquier error que afecte a los usuarios.

source: If becoming a tester interests you, subscribe to the `testing mailing list <http://lists.pcbsd.org/mailman/listinfo/testing>`_. As new testing versions become available they will be announced on this list. You will also be able to see what problems other testers are finding and can check to see if the problem exists on your hardware as well. You can also subscribe to `these RSS feeds <http://dir.gmane.org/gmane.os.pcbsd.testing>`_ if you want a quick way to keep up with the subjects being discussed on the testing mailing list.
es: Si le interesa convertirse un tester suscríbase a la `lista de correo de los testers <http://lists.pcbsd.org/mailman/listinfo/testing>`_. Cuando esté disponible una versión de prueba se anunciará en esta lista. También podrá ver qué problemas están encontrando otros testers y pude comprobar si el problema también existe en su hardware. También se puede suscribirse a `estos RSS <http://dir.gmane.org/gmane.os.pcbsd.testing>`_ si quiere una manera rápida de enterarse de los asuntos que se están discutiendo en la lista de noticias de los testers.

source: Anyone can become a beta tester. Follow these tips so that you can accurately describe your findings so they can be fixed as soon as possible:
es: Cualquiera puede convertirse en un tester de versiones beta. Siga estos consejos para que pueda describir sus descubrimientos de manera precisa de manera que puedan ser solucionados tan pronto como sea posible:

source: Before you :ref:`Report a bug`, skim through the archives of the `testing mailing list <http://lists.pcbsd.org/mailman/listinfo/testing>`_ to see if anyone else has reported a similar problem.
es: Antes de :ref:`Informar de un Error`, eche un vistazo a los archivos de la `lista de correo de los testers <http://lists.pcbsd.org/mailman/listinfo/testing>`_para ver si alguien ha informado de un problema similar.

source: When reporting a new issue, use a descriptive subject that includes the error and the version of PC-BSD®. Ideally, the subject is short (8 words or less) and contains key words about the error. An example would be "AppCafe on 10.2-RELEASE-p1 fails to create jail".
es: Cuando informe de un nuevo problema utilice un título descriptivo que incluya el error y la versión de PC-BSD®. Idealmente el título es corto (8 palabras o menos) y contiene palabras clave sobre el error. Por ejemplo podría ser "AppCafe en 10.2-RELEASE-p1 no crea una jaula (jail)".

source: Ensure that the body of the bug report includes the PC-BSD® version.
es: Asegúrese de que el cuerpo del informe del error incluya la versión PC-BSD®.

source: Give a short (2-3 sentences) description of how to recreate the error. If there is an error message, include its complete text.
es: De una descripción corta (2-3 frases) de cómo recrear el error. Si hay un mensaje de error incluya su texto completo.

source: Include any other info that may be useful (e.g. this used to work on 10.0).
es: Incluya cualquier otra información que pueda ser útil (por ejemplo, esto solía funcionar en 10.0)

source: If the problem appears to be hardware related, include a copy of :file:`/var/run/dmesg.boot` as this file shows the hardware that was probed the last time the PC-BSD® system booted.
es: Si el problema parece estar relacionado con el hardware incluya una copia de :file:`/var/run/dmesg.boot`, ya que este archivo muestra el hardware que se estaba probando la última vez que se inició el sistema PC-BSD®.

source: Become a Translator
es: Conviértase en un Traductor

source: If you are interested in translating PC-BSD® into your native language, there are three translation areas that you can choose to become involved in:
es: Si está interesado en traducir PC-BSD® a su lengua materna hay tres áreas de traducción que puede elegir para participar:

source: Translate the graphical menus within the PC-BSD® operating system.
es: Traducir los menús gráficos del sistema operativo PC-BSD®.

source: Translate the documentation that is published with PC-BSD®.
es: Traducir los documentos que se publican con PC-BSD®.

source: Translate the PC-BSD® website.
es: Traducir el sitio web de PC-BSD®.

source: This section describes each of these translation areas in more detail and how to get started as a translator.
es: Esta sección describe cada una de estas áreas de traducción de forma más detallada y cómo empezar como traductor.

source: Regardless of the type of translation you are interested in, you should first join the `translations mailing list <http://lists.pcbsd.org/mailman/listinfo/translations>`_. When you join, send an email to introduce yourself and indicate which language(s) and which type(s) of translations you can assist with. This will allow you to meet other volunteers as well as keep abreast of any notices or updates that affect translators.
es: Independientemente del tipo de traducción en la que esté interesado debería subscribirse primero a la `lista de correo de traducciones <http://lists.pcbsd.org/mailman/listinfo/translations>`_. Cuando se haya suscrito envíe un correo de presentación indicando en qué idioma(s) y en qué traducciones puede ayudar. Esto le permitirá conocer a otros voluntarios así como mantenerse al día de cualquier noticia o actualización que afecte a los traductores.

source: Interface Translation
es: Interfaz de Traducción

source: PC-BSD® uses :wikipedia:`Pootle` for managing localization of the menu screens used by the installer and the PC-BSD® utilities. Pootle makes it possible to find out if your native language has been fully localized for PC-BSD®. Pootle also makes it easy for users to check and submit translated text as it provides a web editor and commenting system. This means that translators can spend their time making and reviewing translations rather than learning how to use a translation tool.
es: PC-BSD® utiliza :wikipedia:`Pootle` para gestionar el idioma de las pantallas con menús empleadas por el instalador y por las herramientas de PC-BSD®. Pootle posibilita averiguar si hay una traducción completa a su idioma nativo de PC-BSD®. Pootle también facilita a los usuarios comprobar y enviar textos traducidos ya que proporciona un editor web y un sistema para comentarios. Esto significa que los traductores pueden dedicar su tiempo a hacer y revisar traducciones en vez de aprender a cómo usar una herramienta de traducción.

source: To see the status of a localization, open up the `translation website <http://translate.pcbsd.org/>`_ in a web browser, as seen in :numref:`Figure %s: The PC-BSD® Pootle Translation System <translate1>`.
es: Para ver el estado de una localización, abra el `sitio de traducciones <http://translate.pcbsd.org/>`_ en un navegador web, como se muestra en la :numref:`Figura %s: El Sistema de Traducción Pootle de PC-BSD® <translate1>`.

source: The localizations PC-BSD® users have requested are listed alphabetically on the left. If your language is missing and you would like to help in its translation, send an email to the `translations mailing list <http://lists.pcbsd.org/mailman/listinfo/translations>`_ so it can be added.
es: Las traducciones de PC-BSD® que los usuarios han solicitado están listadas alfabéticamente a la izquierda. Si su idioma no está, y a usted le gustaría ayudar en su traducción, envíe un correo a la `lista de correo de traducciones <http://lists.pcbsd.org/mailman/listinfo/translations>`_ para que se pueda añadir.

source: The green bar in the "Progress" column indicates the percentage of PC-BSD® menus that have been localized. If a language is not at 100%, it means that the menus that currently are not translated will appear in English instead of in that language.
es: Las barra verde de la columna de "Progreso" indica el porcentaje de menús de PC-BSD® que ya han sido traducidos. Si un idioma no está al 100% significa que los menús que no están ya traducidos aparecerán en inglés en vez de en ese idioma.

source: If you click on a language name then click on the "PC-BSD" hyperlink under the "Name" column, you will see each menu item that is available for translation. The example shown in :numref:`Figure %s: Viewing a Language's Available Menus <translate2>` is for the Greek localization. In this example, the menu for "ethernetconfig" is complete, but the one for "LifePreserver" is not.
es: Si presiona en el nombre de un idioma y luego presiona en el link de "PC-BSD" bajo la columna "Nombre", usted verá cada elemento del menú que está disponible para su traducción. El ejemplo mostrado en la :numref:`Figura %s: Viendo los Menús Disponibles para un Idioma <translate2>` es para el idioma Griego. En este ejemplo, el menú para "ethernetconfig" está completo, pero el de "LifePreserver" no.

source: In order to edit a translation, you need to first create a Pootle login account. Once you are logged in to Pootle, navigate to the menu item that you wish to translate. In :numref:`Figure %s: Using the Pootle Interface to Edit a Translation String <translate3>`, the translator has clicked on "LifePreserver.ts" then clicked the "Translate" tab.
es: Para editar una traducción, necesita primero crear una cuenta de acceso a Pootle. Una vez que ingrese a Pootle, muévase al elemento del menú que quiera traducir. En la :numref:`Figura %s: Usando la Interfaz de Pootle para Editar una Cadena de Traducción <translate3>`, el traductor ha presionado en "LifePreserver.ts" y luego en la pestaña "Traducir".

source: In this example, the first string, the phrase "Classic Home-Dir Backup" has not yet been translated. To add the translation, type the translated text into the white text field and click the "Submit" button. To translate another text field, click on the hyperlink associated with its name, or use the "Next" and "Previous" links to navigate between text fields. Sometimes, a text field exists in another screen and already has a translation. :numref:`Figure %s: Selecting a Suggested Translation <translate4>` provides an example where the translator clicked the hyperlink for "Filename" which displays three previous translations. The translator then clicked the first suggestion and it was automatically added to the white text field.
es: En este ejemplo, la primera cadena, la frase "Classic Home-Dir Backup" no ha sido traducida. Para añadir la traducción, ingrese el texto traducido en el campo de texto blanco y presione el botón "Aplicar". Para traducir otros campos de texto, presione en el link asociado con su nombre, o use los links de "Siguiente" y "Previo" para navegar entre los campos de texto. Algunas veces, existe un campo de texto en otra pantalla y ya tiene una traducción. La :numref:`Figura %s: Seleccionando una Traducción Sugerida <translate4>` proporciona un ejemplo donde el traductor presionó el link para "Filename" el cual despliega tres traducciones previas. El traductor entonces presiona en la primera sugerencia y se añade automáticamente el campo de texto blanco.

source: If you need help with a translation or using the Pootle system, you can ask for help on the translations mailing list or in the `translations forum <https://forums.pcbsd.org/forum-40.html>`_.
es: Si necesita ayuda con la traducción o cómo usar el sistema Pootle, puede buscar ayuda en las listas de correo de traducciones o en el `foro de traducciones <https://forums.pcbsd.org/forum-40.html>`_.

source: Documentation Translation
es: Traducción de Documentación

source: The source for the PC-BSD® Users Handbook is stored in the `PC-BSD® github repository <https://github.com/pcbsd/pcbsd/tree/master/src-qt5/docs>`_. This means that the documentation and any translations can be built with the operating system and updates to this documentation can be automatically installed when the system is updated using :ref:`Update Manager`. This has the added advantage of making sure that the installed version of the Handbook always matches the operating system version and that, as new features are added, that they are documented and appear as a local copy on the user's system. The local copy is stored in :file:`/usr/local/share/pcbsd/doc/html` and a desktop shortcut provides easy access to the documentation.
es: El código fuente del Manual de Usuario de PC-BSD® está almacenado en el `repositorio github de PC-BSD® <https://github.com/pcbsd/pcbsd/tree/master/src-qt5/docs>`_. Esto significa que la documentación y todas las traducciones pueden construirse con el sistema operativo y las actualizaciones a esta documentación pueden ser instaladas automáticamente cuando el sistema se actualiza usando el :ref:`Administrador de Actualizaciones`. Esto tiene la ventaja añadida de asegurarse que la versión instalada del Manual siempre es igual que la versión del sistema operativo y que, cuando nuevas características sean añadidas, han sido documentadas y aparece como una copia local en el sistema del usuario. La copia local está almacenada en :file:`/usr/local/share/pcbsd/doc/html` y un acceso directo en el escritorio proporciona acceso fácil a la documentación.

source: At this time, the PC-BSD® build server has been configured to automatically build the HTML version of the PC-BSD® Users Handbook. Over time, additional :file:`Makefiles` will be tested and added to provide the documentation in other formats, such as single HTML, PDF, and EPUB. Instructions for building your own HTML or PDF version can be found in this `README.md <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_.
es: En este momento, el servidor de compilación de PC-BSD® ha sido configurado para crear automáticamente la versión HTML del Manual de Usuario de PC-BSD®. Con el tiempo, :file:`Makefiles` adicionales serán probados y añadidos para proporcionar la documentación en otros formatos, como un solo HTML, PDF, y EPUB. Las instrucciones para compilar su propia versión de HTML o PDF pueden encontrarse en este `README.md <https://github.com/pcbsd/pcbsd/blob/master/src-qt5/docs/README.md>`_.

source: The documentation source files have been integrated into the Pootle translation system so that the PC-BSD® documentation can be translated using a web browser. The process is similar to :ref:`Interface Translation` except that you must first select "PC-BSD Handbook" from the "Projects" drop-down menu shown in :numref:`Figure %s: Selecting the Handbook Project <translate5>`.
es: Los archivos fuente de la documentación han sido integrados en el sistema de traducción Pootle para que la documentación de PC-BSD® pueda ser traducida usando un navegador web. El proceso es similar a la :ref:`Interfaz de Traducción` excepto en que debe seleccionar primero "PC-BSD Handbook" del menú desplegable "Proyectos" mostrado en la :numref:`Figura %s: Seleccionando el Proyecto del Manual <translate5>`.

source: You can then select the language to translate into from the available languages list. If the language that you want to translate is not listed, send an email to the `translations mailing list <http://lists.pcbsd.org/mailman/listinfo/translations>`_ and request that it be added.
es: Después puede seleccionar el idioma de traducción de la lista de idiomas disponible. Si el idioma al que quiere traducir no está listado, mande un correo a la `lista de traducciones <http://lists.pcbsd.org/mailman/listinfo/translations>`_ y pida que sea añadido.

source: When translating the documentation, be aware of the following:
es: Cuando esté traduciendo la documentación se consciente de lo siguiente:

source: At this time, some formatting tags are still displayed in raw text, as seen in the examples in :numref:`Figure %s: Do Not Remove Formatting Characters <translate6>` and :numref:`Figure %s: Another Formatting Characters Example <translate7>`. **It is IMPORTANT that you do not accidentally remove the formatting as this can break the documentation build for that language.** In the first example, it is OK to translate the phrase "Using the Text Installer" but care must be taken to not accidental remove any of the surrounding colons and backticks, or to change the text of the "ref" tag. In the second example, the asterisks are used to bold the word "install". It is OK to translate "install", but do not remove the asterisks.
es: En este momento, algunas etiquetas de formato son desplegadas en texto llano, como se muestra en los ejemplos en la :numref:`Figura %s: No Elimine los Caracteres de Formato <translate6>` y en la :numref:`Figura %s: Otro Ejemplo de Caracteres de Formato <translate7>`. **Es IMPORTANTE que no elimine accidentalmente el formato ya que se puede estropear la compilación de la documentación para ese idioma.** En el primer ejemplo, está bien traducir la frase "Using the Text Installer" pero se debe tener cuidado de no eliminar accidentalmente cualquiera de las dos puntos o comillas, o cambiar el texto de la etiqueta "ref". En el segundo ejemplo, los asteriscos son usados para poner en negritas la palabra "install". Está bien traducir "install", pero no elimine los asteriscos.

source: If you would like to receive notifications of documentation changes that affect translations, subscribe to the `Translation-notifications <http://lists.pcbsd.org/mailman/listinfo/translations-notifications>`_ mailing list.
es: Si quiere recibir notificaciones de cambios en la documentación que afectan sus traducciones, suscríbase a la lista de correos `Translation-notifications <http://lists.pcbsd.org/mailman/listinfo/translations-notifications>`_

source: If you would like to build a local HTML copy that includes the latest translations, either for your own use or to visualize the translated Guide, do the following from the command line. These instructions are for a PC-BSD® system::
es: Si quiere compilar una copia local en HTML que incluya las últimas traducciones, ya sea para su uso personal o para visualizar la Guía traducida, haga lo siguiente desde la línea de comandos. Estas instrucciones son para un sistema PC-BSD®:

source: This will make an HTML version of the Guide for each of the available translations. In this example, translations are available for English (in :file:`html`), Danish, German, Spanish, French, Indonesian, Brazilian Portuguese, Turkish, and UK English. To update the HTML at a later time::
es: Esto creará una versión HTML de la Guía para cada una de las traducciones disponibles. En este ejemplo, hay traducciones disponibles para Inglés (en :file:`html`), Danés, Alemán, Español, Francés, Indonesio, Portugués de Brasil, Turco, e Inglés del Reino Unido. Para actualizar el HTML después:

source: Website Translation
es: Traducción del Sitio Web

source: If you are interested in translating the PC-BSD® website, send an email to the `translations mailing list <http://lists.pcbsd.org/mailman/listinfo/translations>`_. Someone will introduce you to the webmaster who will get you started on website translation.
es: Si está interesado en traducir el sitio web de PC-BSD®, mande un correo a la `lista de correos de traducciones <http://lists.pcbsd.org/mailman/listinfo/translations>`_. Alguien le presentará al webmaster quien lo ayudará a comenzar con la traducción del sitio web.

source: Currently, the the website is being translated to several languages, including: Dutch, French, German, Polish, Spanish, Swedish, and Turkish.
es: Actualmente, el sitio web se está traduciendo a algunos idiomas, incluyendo: Holandés, Francés, Alemán, Polaco, Español, Sueco, y Turco.

source: Become a Developer
es: Conviértase en Desarrollador

source: If you like programming, and especially coding on FreeBSD, we would love to see you join the PC-BSD® team as a PC-BSD® committer. Developers who want to help improve the PC-BSD® codebase are always welcome! If you would like to participate in core development, subscribe to the `developers mailing list <http://lists.pcbsd.org/mailman/listinfo/dev>`_. Once you have signed up, feel free to browse the active tickets in the PC-BSD® `bug tracker <https://bugs.pcbsd.org/projects/pcbsd/>`_. If you see something that you want to work on, or have a proposal for a project you wish to add to PC-BSD®, please let us know via the developers list and we will be happy to help get you started.
es: Si le gusta programar, y especialmente desarrollar en FreeBSD, nos gustaría verlo integrarse al equipo de PC-BSD® como un committer de PC-BSD®. Los desarrolladores que quieran ayudar a mejorar el código de PC-BSD® siempre son bienvenidos! Si quiere participar en el desarrollo de la base, suscríbase a la `lista de correos de desarrolladores <http://lists.pcbsd.org/mailman/listinfo/dev>`_. Una vez que se haya registrado, siéntase libre de navegar los tickets activos en el `bug tracker <https://bugs.pcbsd.org/projects/pcbsd/>`_ de PC-BSD®. Si ve algo en lo que le gustaría trabajar, o tiene una propuesta para algún proyecto que quiera añadir a PC-BSD®, por favor háganoslo saber por medio de la lista de desarrolladores y estaremos felices de ayudarle a comenzar.

source: Most of the PC-BSD® specific GUI tools are developed in C++ using the Qt Libraries, and other non-GUI development is done using standard Bourne shell scripts. There may be cases where other languages or libraries are needed, but those will be evaluated on a case-by-case basis, so feel free to let us know your proposals on the developers mailing list.
es: La mayoría de las utilerías GUI específicas de PC-BSD® están desarrolladas en C++ usando las Librerías Qt, y otros desarrollos no gráficos se hacen usando scripts de shell Bourne normales. Habrá algunos casos donde se necesiten otros lenguajes o librerías, pero esos serán evaluados en una base caso a caso, así que sientase libre de dejarnos saber sus propuestas en la lista de correos de desarrolladores.

source: Getting the Source Code
es: Obteniendo el Código Fuente
