Repository: pcbsd/pcbsd-translate
Catalog: pcbsd-handbook10/*/support.po
Languages: es

source: The PC-BSD® source code is available from github and :command:`git` needs to be installed in order to download the source code. When using PC-BSD®, :command:`git` is included in the base install.
es: El código fuente de PC-BSD® está disponible desde github y :command:`git` necesita ser instalado para poder descargar el código fuente. Cuando use PC-BSD®, :command:`git` ya viene incluido en la instalación básica.

source: To download the source code, :command:`cd` to the directory to store the source and type::
es: Para descargar el código fuente, haga :command:`cd` al directorio donde almacenará el código fuente y escriba:

source: This will create a directory named :file:`pcbsd/` which contains the local copy of the repository. To keep the local copy in sync with the official repository, run :command:`git pull` within the :file:`pcbsd` directory.
es: Esto creará un directorio llamado :file:`pcbsd/` que contendrá la copia local del repositorio. Para mantener la copia local en sincronía con el repositorio oficial, ejecute :command:`git pull` dentro del directorio :file:`pcbsd`.

source: PC-BSD® graphical applications use Qt version 5 and their source is located in :file:`pcbsd/src-qt5/`. In order to compile the applications in this directory, install the "PC-BSD Build Toolchain" PBI using :ref:`AppCafe®`. To instead install this PBI from the command line, type :command:`pkg install pcbsd-toolchain`.
es: Las aplicaciones gráficas de PC-BSD® usan la versión 5 de Qt y sus fuentes están localizadas en :file:`pcbsd/src-qt5/`. Para compilar las aplicaciones en este directorio, instale el PBI de "PC-BSD Build Toolchain" usando :ref:`AppCafe®`. Para instalar este PBI desde la línea de comandos, ingrese :command:`pkg install pcbsd-toolchain`.

source: Most of the PC-BSD® source code is divided into two sub-categories:
es: La mayoría del código fuente de PC-BSD® está dividido en dos sub categorías:

source: :file:`src-sh/` contains shell and C programs which do not include GUIs. These are the command line utilities used in TrueOS® and PC-BSD®.
es: :file:`src-sh/` contiene programas de shell y C que no incluyen GUIs. Estas son las utilerías de línea de comandos usadas en TrueOS® y PC-BSD®.

source: :file:`src-qt5/` contains the Qt5-based GUIs seen in PC-BSD®.
es: :file:`src-qt5/` contiene las GUIs basadas en Qt5 contenidas en PC-BSD®.

source: To compile the command line utilities::
es: Para compilar las utilerías de línea de comandos:

source: To compile the graphical utilities::
es: Para compilar las utilerías gráficas:

source: Several Qt IDEs are available in :ref:`AppCafe®`. The `QtCreator <http://wiki.qt.io/Category:Tools::QtCreator>`_ PBI is a full-featured IDE designed to help new Qt users get up and running faster while boosting the productivity of experienced Qt developers. `Qt Designer <http://doc.qt.io/qt-4.8/designer-manual.html>`_ is lighter weight as it is only a :file:`.ui` file editor and does not provide any other IDE functionality. To install this package, check the "Search all available PBI and packages" in the "App Search" tab of AppCafe® and search for "qt5-designer". Alternately, install it using :command:`pkg install qt5-designer`.
es: Algunos IDEs de Qt están disponibles en :ref:`AppCafe®`. El PBI `QtCreator <http://wiki.qt.io/Category:Tools::QtCreator>`_ es un IDE lleno de características diseñado para ayudar a nuevos usuarios de Qt a comenzar rápidamente mientras acelera la productividad de desarrolladores Qt experimentados. `Qt Designer <http://doc.qt.io/qt-4.8/designer-manual.html>`_ es ligero ya que es solamente un editor de archivos :file:`.ui` y no proporciona otras funcionalidades de IDE. Para instalar este paquete, revise en "Buscar todos los PBI y paquetes disponibles" en la pestaña "Búsqueda de Aplicaciones" de AppCafe® y busque "qt5-designer". Alternativamente, instálelo usando :command:`pkg install qt5-designer`.

source: If you plan to submit changes so that they can be included in PC-BSD®, fork the repository using the instructions in `fork a repo <https://help.github.com/articles/fork-a-repo>`_. Make your changes to the fork, then submit them by issuing a `git pull request <https://help.github.com/articles/using-pull-requests>`_. Once your changes have been reviewed, they will be committed or sent back with suggestions.
es: Si planea subir cambios para que puedan ser incluidos en PC-BSD®, bifurque el repositorio usando las instrucciones en `bifurcando un repositorio <https://help.github.com/articles/fork-a-repo>`_. Haga sus cambios a la bifurcación, y luego aplíquelos usando un `requerimiento git pull <https://help.github.com/articles/using-pull-requests>`_. Una vez que sus cambios hayan sido revisados, serán introducidos o regresados con sugerencias.

source: Design Guidelines
es: Lineamientos de Diseño

source: PC-BSD® is a community driven project that relies on the support of developers in the community to help in the design and implementation of new utilities and tools for PC-BSD®. The Project aims to present a unified design so that programs feel familiar to users. As an example, while programs could have "File", "Main", or "System" as their first entry in a menu bar, "File" is used as the accepted norm for the first category on the menu bar.
es: PC-BSD® es un proyecto comunitario que depende del soporte de los desarrolladores en la comunidad para ayudar en el diseño e implementación de nuevas utilerías y herramientas para PC-BSD®. El proyecto apunta a presentar un diseño unificado para que los programas se sientan familiares a los usuarios. Como un ejemplo, mientras los programas pueden tener "Archivo", "Principal", o "Sistema" como su primera entrada en una barra de menú, "Archivo" es usado como la norma aceptada para la primera categoría en la barra de menú.

source: This section describes a small list of guidelines for menu and program design in PC-BSD®.
es: Esta sección describe una pequeña lista de lineamientos para el diseño de menús y programas en PC-BSD®.

source: Any graphical program that is a full-featured utility, such as :ref:`Life Preserver`, should have a "File" menu. However, file menus are not necessary for small widget programs or dialogue boxes. When making a file menu, a good rule of thumb is keep it simple. Most PC-BSD® utilities do not need more than two or three items on the file menu.
es: Cualquier programa gráfico que es una utilería llena de caracterísitcas, como :ref:`Life Preserver`, deben tener un menú "Archivo". De cualquier forma, los menús de archivo no son necesarios para pequeños programas widget o cajas de diálogo. Cuando se hace un menú archivo, una buena regla es mantenerlo simple. La mayoría de utilerías de PC-BSD® no necesitan más de dos o tres elementos en el menú archivo.

source: "Configure" is our adopted standard for the category that contains settings or configuration-related settings. If additional categories are needed, check to see what other PC-BSD® utilities are using.
es: "Configurar" es nuestro estándar adoptado para la categoría que contiene las configuraciones o elementos relacionados. Si se necesitan categorías adicionales, revise qué otras están siendo usadas por utilerías de PC-BSD®.

source: File menu icons are taken from the KDE Oxygen theme located in :file:`/usr/local/share/icons/oxygen`. Use these file menu icons so we do not have a bunch of different icons used for the same function. Table 11.3a lists the commonly used icons and their default file names.
es: Los iconos del menú archivo son tomados del tema Oxygen de KDE localizado en :file:`/usr/local/share/icons/oxygen`. Use esos iconos de menú archivo para no tener un montón de iconos diferentes usados para la misma función. La Tabla 11.3a lista los iconos regularmente usados y sus nombres de archivo predeterminados.

source: **Table 11.3a: Commonly Used File Menu Icons**
es: **Tabla 11.3a: Iconos de Menú Archivo Regularmente Usados**

source: Function
es: Función

source: File Menu Icon
es: Icono de Menú Archivo

source: File Name
es: Nombre de Archivo

source: Quit
es: Salir

source: row 1, cell 2
es: línea 1, celda 2

source: Settings
es: Opciones

source: row 2, cell 2
es: línea 2, celda 2

source: PC-BSD® utilities use these buttons as follows:
es: Las utilerías de PC-BSD® usan estos botones como se muestra:

source: **Apply:** applies settings and leaves the window open.
es: **Aplicar:** aplica las configuraciones y deja la ventana abierta.

source: **Close:** closes program without applying settings.
es: **Cerrar:** cierra un programa sin aplicar las configuraciones.

source: **OK:** closes dialogue window and saves settings.
es: **OK:** cierra la ventana de diálogo y guarda las configuraciones.

source: **Cancel:** closes dialog window without applying settings.
es: **Cancelar:** cierra la ventana de dialogo sin aplicar las configuraciones.

source: **Save:** saves settings and closes window.
es: **Guardar:** guarda las configuraciones y cierra la ventana.

source: Fully functional programs like :ref:`Life Preserver` do not use close buttons on the front of the application. Basically, whenever there is a "File" menu, that and an "x" in the top right corner of the application are used instead. Dialogues and widget programs are exceptions to this rule. A good example of a widget program would be :ref:`Update Manager`.
es: Los programas completamente funcionales como :ref:`Life Preserver` no usan botones de cerrado en el frente de la aplicación. Básicamente, donde hay un menú "Archivo", eso y una "x" en la esquina superior derecha de la aplicación son usados. Los diálogos y programas widget son excepciones a la regla. Un buen ejemplo de un programa widget sería el :ref:`Administrador de Actualizaciones`.

source: Many users benefit from keyboard shortcuts and we aim to make them available in every PC-BSD® utility. Qt makes it easy to assign keyboard shortcuts. For instance, to configure keyboard shortcuts that browse the "File" menu, put *&File* in the text slot for the menu entry when making the application. Whichever letter has the *&* symbol in front of it will become the hot key. You can also make a shortcut key by clicking the menu or submenu entry and assigning a shortcut key. Be careful not to duplicate hot keys or shortcut keys. Every key in a menu and submenu should have a key assigned for ease of use and accessibility. Tables 11.3b and 11.3c summarize the commonly used shortcut and hot keys.
es: Muchos usuarios se benefician de los atajos del teclado y nosotros nos enfocamos en tenerlos disponibles en cada utilería de PC-BSD®. Qt hace posible el asignar atajos del teclado. Por ejemplo, para configurar los atajos del teclado que busquen en el menú "Archivo", ponga *&File* en la casilla de texto para la entrada del menú cuando construya la aplicación. Cualquier letra que tenga el símbolo *&* enfrente se convertirá en una tecla de atajo. También puede crear una tecla de atajo presionando la entrada del menú o submenú y asignando una tecla de atajo. Sea cuidadoso de no duplicar las teclas de atajo. Cada tecla en un menú o submenú deberá tener una tecla asignada para facilidad de uso y accesabilidad. Las tablas 11.3b y 11.3c resumen los atajos del teclado comúnmente usados.

source: **Table 11.3b: Shortcut Keys**
es: **Tabla 11.3b: Atajos de Teclado**

source: Shortcut Key
es: Tecla de Acceso Directo

source: Action
es: Acción

source: Help
es: Ayuda

source: **Table 11.3c: Hot Keys**
es: **Tabla 11.3c: Teclas de Atajo**

source: Hot Key
es: Tecla de Atajo

source: Import
es: Importar

source: Export
es: Exportar

source: File Menu
es: Menú Archivo

source: Configure Menu
es: Menú Configuración

source: Help Menu
es: Menú Ayuda

source: When saving an application's settings, the QSettings class should be used if possible. There are two different "organizations", depending on whether the application is running with *root* permissions or user permissions. Use "PCBSD" for the organization for applications that run with user permissions and "PCBSD-root" for applications that are started with root permissions via :command:`sudo`. Proper use prevents the directory where settings files are saved from being locked down by *root* applications, allowing user applications to save and load their settings. Examples 11.3a and 11.3b demonstrate how to use the QSettings class for each type of permission.
es: Cuando se guardan las configuraciones de una aplicación, la clase QSettings debe usarse de ser posible. Hay dos diferentes "organizaciones", dependiendo de si la aplicación está corriendo con permisos de *superusuario* o permisos de usuario. Use "PCBSD" para la organización de aplicaciones que corren con permisos de usuario y "PCBSD-root" para las aplicaciones que son iniciadas con permisos de superusuario mediante :command:`sudo`. El uso correcto previene que el directorio donde se guardan los archivos de configuración sean bloqueados por aplicaciones del *superusuario*, permitiendo que aplicaciones del usuario guarden y carguen sus configuraciones. Los ejemplos 11.3a y 11.3b demuestran como usar la clase QSettings para cada tipo de permiso.

source: **Example 11.3a: User Permission Settings**::
es: **Ejemplo 11.3a: Configuraciones de Permisos de Usuario**:

source: **Example 11.3b: Root Permission Settings**::
es: **Ejemplo 11.3b: Configuraciones de Permisos de Superusuario**:

source: Developers will also find the following resources helpful:
es: Los desarrolladores también encontrarán útiles los siguientes recursos:

source: `Commits Mailing List <http://lists.pcbsd.org/mailman/listinfo/commits>`_
es: `Lista de correos de Commits <http://lists.pcbsd.org/mailman/listinfo/commits>`_

source: `Qt 5.4 Documentation <http://doc.qt.io/qt-5/index.html>`_
es: `Documentación de Qt 5.4 <http://doc.qt.io/qt-5/index.html>`_

source: `C++ Tutorials <http://www.cplusplus.com/doc/tutorial/>`_
es: `Tutoriales de C++ <http://www.cplusplus.com/doc/tutorial/>`_

source: Make Minor Modifications to a PBI Module
es: Haciendo Modificaciones Menores a un Módulo PBI

source: If you have a GitHub account and are logged in, you can contribute minor PBI changes to the `pbi-modules repository <https://github.com/pcbsd/pcbsd/tree/master/pbi-modules>`_ using a web browser. If you do not have a GitHub account, `create one <https://github.com/>`_ using a valid email address as you will need to confirm your email address.
es: Si tiene una cuenta de GitHub y está en su sesión, puede hacer cambios menores a los PBIs en el `repositorio pbi-modules <https://github.com/pcbsd/pcbsd/tree/master/pbi-modules>`_ usando un navegador web. Si no tiene una cuenta de GitHub, `cree una <https://github.com/>`_ usando un correo válido ya que tendrá que confirmar su dirección de correo.

source: For example, to add a screenshot for an application, upload the screenshot file to a publicly accessible site, then add the URL to the screenshot in between the quotes of the *PBI_SCREENSHOTS=""* line in the :file:`pbi.conf` file for that module. Or, to add a similar application, put the package category and package name in between the *PBI_PLUGINS=""* line in the :file:`pbi.conf` file for that module. As an example, refer to the `pbi.conf for the www/firefox PBI module <https://github.com/pcbsd/pcbsd/blob/master/pbi-modules/www/firefox/pbi.conf>`_. More information about the available :file:`pbi.conf` variables can be found in Table 11.1a.
es: Por ejemplo, para añadir una captura de pantalla de una aplicación, suba el archivo de captura a un sitio público y accesible, y después añada la URL de la captura dentro de las comillas de la línea *PBI_SCREENSHOTS=""* en el archivo :file:`pbi.conf` para ese módulo. O, para añadir una aplicación similar, ponga la categoría del paquete y nombre del paquete dentro de la línea *PBI_PLUGINS=""* en el archivo :file:`pbi.conf` para ese módulo. Como ejemplo, refiérase al `pbi.conf del módulo PBI de www/firefox <https://github.com/pcbsd/pcbsd/blob/master/pbi-modules/www/firefox/pbi.conf>`_. Más información acerca de las variables disponibles en :file:`pbi.conf` puede encontrarse en la Tabla 11.1a.

source: **Table 11.1a: Commonly Used pbi.conf Variables**
es: **Tabla 11.1a: Variable Comunmente Usadas en pbi.conf**

source: Description
es: Descripción

source: mandatory; the "category/portname" of the FreeBSD package
es: obligatorio; la "categoría/nombre del port" del paquete FreeBSD

source: mandatory; name of the application
es: obligatorio; nombre de la aplicación

source: mandatory unless does not exist; website for the application
es: obligatorio a menos que no exista; sitio web de la aplicación

source: mandatory; often found at the website for the application
es: obligatorio; casi siempre se encuentra en el sitio web de la aplicación

source: the type of open source license used by the application
es: tipo de licencia open source usada por la aplicación

source: a comma separated list (no spaces) of search terms associated with the application
es: una lista separada por comas (no espacios) de términos de búsqueda asociados con la aplicación

source: mandatory; use "Graphical" or "Text"
es: obligatorio; use "Gráfico" o "Texto"

source: the category to place the application into; click "Browse Categories" within AppCafe to see the list of categories
es: la categoría en donde se pondrá la aplicación; presione "Buscar Categorías" en AppCafe para ver la lista de categorías.

source: a space separated list in the format "category/portname" of other applications to bundle into the PBI
es: una lista separada por espacios en el formato "categoría/nombre del port" de otras aplicaciones que empaquetar en el PBI

source: a space separated list in the format "category/portname" of similar packages
es: una lista separada por espacios en el formato "categoría/nombre del port" de paquetes similares

source: a space separated list of URLs to screenshots in :file:`.png` or :file:`.jpg` format
es: una lista separada por espacios de URLs a las capturas de pantalla en formato :file:`.png` o :file:`.jpg`

source: a space separated list in the format "category/portname" of similar PBIs
es: una lista separada por espacios en el formato "categoría/nombre del port" de PBIs similares

source: export
es: exportar

source: mandatory; followed by a list of all of the variables used in the file
es: obligatorio; seguido de una lista de todas las variables usadas en el archivo

source: To make the edit, click on the :file:`pbi.conf` file for the module, click the "Edit" button, make the change, then click the "Commit changes" button. This will issue a "git pull" request which will be reviewed by a developer who will either approve it or contact you if more information about the edit is needed. Once the request is approved, you will receive an email about the approval and the change will appear in :ref:`AppCafe®` when the next package set becomes available. How long that takes depends upon whether the user's system is set to use the PRODUCTION or EDGE package set.
es: Para hacer la edición, presione en el archivo :file:`pbi.conf` para el módulo, presione en el botón "Editar", haga el cambio, luego presione el botón "Aplicar cambios". Esto creará una solicitud "git pull" que será revisada por un desarrollador que ya sea, la aprobará o lo contactará si se necesita más información sobre la edición. Una vez que la solicitud esté aprobada, recibirá un correo sobre la aprobación y el cambio aparecerá en :ref:`AppCafe®` cuando el siguiente set de paquetes esté disponible. Cuánto tarde dependerá de cómo está configurado el sistema del usuario para usar el set de paquetes PRODUCCION o EDGE.

source: Purchase PC-BSD® Swag
es: Comprando Artículos de PC-BSD®

source: While PC-BSD® is free, some users may wish to purchase media or other items to show their support for the PC-BSD® Project. PC-BSD® items are available from the following websites:
es: Mientras que PC-BSD® es gratuito, algunos usuarios podrían querer comprar discos u otros artículos para mostrar su apoyo al Proyecto PC-BSD®. Los artículos de PC-BSD® está disponibles desde los siguientes sitios web:

source: `FreeBSD Mall <https://www.freebsdmall.com/cgi-bin/fm/scan/fi=prod_bsd/tf=list_order/sf=sku/sf=title/sf=category/se=pc-bsd?id=B3TkJm7G&mv_pc=5>`_: sells PC-BSD® DVDs and subscriptions, stickers, and apparel.
es: `FreeBSD Mall <https://www.freebsdmall.com/cgi-bin/fm/scan/fi=prod_bsd/tf=list_order/sf=sku/sf=title/sf=category/se=pc-bsd?id=B3TkJm7G&mv_pc=5>`_: vende DVDs y suscripciones de PC-BSD®, calcomanías, y ropa.

source: Amazon: sells The Definitive Guide to PC-BSD® (hard copy and Kindle formats) as well as the Kindle versions of the PC-BSD® Handbook. Items available for purchase in your country may vary.
es: Amazon: vende la Guía Definitiva de PC-BSD® (copia física y formatos Kindle) así como las versiones Kindle del Manual de PC-BSD®. Los artículos disponibles para compra en su país pueden cambiar.

source: `The PC-BSD® Corporate Storefront <http://pcbsd.qbstores.com/>`_: sells high-quality apparel and accessories.
es: `The PC-BSD® Corporate Storefront <http://pcbsd.qbstores.com/>`_: vende ropa y accesorios de alta calidad.

source: Become an Advocate
es: Conviértase en Partidario

source: So you love PC-BSD®? Why not tell your family, friends, fellow students and colleagues about it? You will not be the only one that likes a virus-free, feature-rich, no-cost operating system. Here are some suggestions to get you started:
es: Así que adora PC-BSD®? Por qué no les habla a su familia, amigos, compañeros y colegas acerca de él? No será el único que gusta de un sistema operativo libre de virus, rico en características y sin costo. Aquí hay algunas sugerencias para comenzar:

source: Burn a couple of DVDs and pass them out. If your school or user group has an upcoming event where you can promote PC-BSD®, you can request additional DVDs from sales@pcbsd.com.
es: Grabe un par de DVDs y compártalos. Si su escuela o grupo de usuarios tiene un evento próximo donde pueda promover PC-BSD®, puede pedir DVDs adicionales a sales@pcbsd.com.

source: Consider giving a presentation about PC-BSD® at a local community event or conference. Let us know about it and we will help you spread the word.
es: Considere dar una presentación sobre PC-BSD® en un evento local o conferencia de su comunidad. Déjenos saber sobre ella y le ayudaremos a correr la voz.

source: Write a personal blog detailing your journey from your first PC-BSD® install experience to your most recent accomplishment. The blog could also be used to teach or explain how to perform tasks on PC-BSD®. A regional language blog may help build the community in your area and to find others with similar interests.
es: Escriba un blog personal detallando desde su experiencia con su primera instalación de PC-BSD® hasta su más reciente logro. El blog puede ser usado también para enseñar o explicar cómo realizar tareas en PC-BSD®. Un blog en su idioma puede ayudar a construir la comunidad en su área y encontrar a otros con intereses similares.
